Перем Домен;
Перем Группа;
Перем Пользователь;
Перем Пароль;
Перем СоздаватьЗаписиАД;
Перем ПарольПоУмолчанию;
Перем СоответствиеПолей;
Перем Запрос_Текст;
Перем Запрос_Параметры;
Перем ПроизвольныеВыражения;

#Область ПрограммныйИнтерфейс

// Функция - Подтверждает, что обработка является обработкой обслуживания
// 
// Возвращаемое значение:
//  Булево - Истина
//
Функция ЭтоОбработкаВыполненияОбработчика() Экспорт
	
	Возврат Истина;
	
КонецФункции //ЭтоОбработкаВыполненияОбработчика()

// Функция - Получает форму обработчиков команд, где расположены процедуры-обработчики команд
// 			 из списка действий кнопки открытия поля выбора обработки обслуживания
// 
// Возвращаемое значение:
//  Строка - Имя формы обработчиков комманд
//
Функция ПолучитьФормуОбработчиковКоманд() Экспорт
	
	Возврат "Форма";
	
КонецФункции //ПолучитьФормуОбработчиковКоманд()

// Функция - Получает список действий кнопки открытия поля выбора обработки обслуживания
// 
// Возвращаемое значение:
//  СписокЗначений - Список действий
//
Функция ПолучитьСписокДействийКнопкиОткрытия() Экспорт
	
	СписокДействий = Новый СписокЗначений();
	// СписокДействий.Добавить("ВыполнитьКоманду_ОбновитьДанныеАД(Неопределено)", "Обновить данные Active Directory", , БиблиотекаКартинок.ЗаписатьИзменения);
	СписокДействий.Добавить("ОткрытьФорму_Форма", "Настройка...", , БиблиотекаКартинок.ИзменитьФорму);
	
	Возврат СписокДействий;
	
КонецФункции //ПолучитьСписокДействийКнопкиОткрытия()

// Функция - Выполняет обработчик события
//
// Параметры:
//  ОписаниеСобытия     - Структура                 - описание события (см. бир_События.СтруктураОписанияСобытия())
//  Обработчик          - СправочникСсылка			- обработчик события
//                        .бир_СобытияОбработчики
//  ПараметрыСобытия    - Структура                 - параметры, сформированные при возникновении события
// 
// Возвращаемое значение:
//  Булево - Истина - Обработка выполнена успешно, Ложь - в противном случае
//
Функция ОбработатьСобытие(ОписаниеСобытия, Обработчик, ПараметрыСобытия) Экспорт
	
	Если НЕ ТипЗнч(ПараметрыСобытия) = Тип("Структура") Тогда
		ПараметрыСобытия = Новый Структура();
	КонецЕсли;
	
	ПараметрыСобытия.Вставить("ПредставлениеИсточника", СокрЛП(ОписаниеСобытия.Источник));
	
	ПрочитатьНастройки(Обработчик);
	
	ДопПараметры = Новый Структура();
	ДопПараметры.Вставить("Источник", ОписаниеСобытия.Источник);
	
	ПроцессорЗапросов = Обработки.бир_ПроцессорЗапросов.Создать();
	ПроцессорЗапросов.УстановитьТекстЗапроса(Запрос_Текст);
	ПроцессорЗапросов.УстановитьПараметрыЗапроса(Запрос_Параметры);
	ПроцессорЗапросов.УстановитьПроизвольныеВыражения(ПроизвольныеВыражения);
	ПроцессорЗапросов.УстановитьДополнительныеПараметры(ДопПараметры);

	Попытка
		РезультатЗапроса = ПроцессорЗапросов.ВыполнитьЗапрос(0, Ложь);
	Исключение
		ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ТекстОшибки = СтрШаблон("Ошибка выполнения запроса 1С:%1%2%1текст запроса:%1%3",
		                        Символы.ПС,
		                        ТекстОшибки,
		                        Запрос_Текст);
		ПараметрыСобытия.Вставить("РезультатОбработки", ТекстОшибки);
		ПараметрыСобытия.Вставить("ОшибкаОбработки", Истина);
		Возврат Ложь;
	КонецПопытки;
	
	Если РезультатЗапроса.Пустой() Тогда
		ПараметрыСобытия.Вставить("РезультатОбработки", "Получен пустой результат запроса:%1%2", Символы.ПС, Запрос_Текст);
		ПараметрыСобытия.Вставить("ОшибкаОбработки", Ложь);
		Возврат Истина;
	КонецЕсли;
	
	ТаблицаКВыгрузке = РезультатЗапроса.Выгрузить();
	
	Попытка
		ЗапросыАД = ПодготовитьДанныеДляОбработки(ТаблицаКВыгрузке);
	Исключение
		ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ТекстОшибки = СтрШаблон("Ошибка подготовки запросов (%1) Active Directory:%2%3",
		                        ЗапросыАД.Количество(),
		                        Символы.ПС,
		                        ТекстОшибки);
		ПараметрыСобытия.Вставить("РезультатОбработки", ТекстОшибки);
		ПараметрыСобытия.Вставить("ОшибкаОбработки", Истина);
		Возврат Ложь;
	КонецПопытки;
	
    РезультатОбработки = Новый Структура();
	РезультатОбработки.Вставить("РезультатОбработки", ТекстОшибки);
	РезультатОбработки.Вставить("ОшибкаОбработки", Ложь);
	
	Попытка
		РезультатОбработки = ОбработатьЗаписиАД(ЗапросыАД);
	Исключение
		ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ТекстОшибки = СтрШаблон("Ошибка обработки записей (%1) Active Directory:%2%3",
		                        ЗапросыАД.Количество(),
		                        Символы.ПС,
		                        ТекстОшибки);
		ПараметрыСобытия.Вставить("РезультатОбработки", ТекстОшибки);
		ПараметрыСобытия.Вставить("ОшибкаОбработки", Истина);
		Возврат Ложь;
	КонецПопытки;
	
	ТекстРезультата = СтрШаблон("Обработаны записи (%1) Active Directory, добавлены: %2, изменены: %3",
	                            ЗапросыАД.Количество(),
	                            СтрСоединить(РезультатОбработки.Новые),
	                            СтрСоединить(РезультатОбработки.Измененные));
	ПараметрыСобытия.Вставить("РезультатОбработки", ТекстРезультата);
	ПараметрыСобытия.Вставить("ОшибкаОбработки", Ложь);
	
	Возврат Истина;
	
КонецФункции // ОбработатьСобытие()

#КонецОбласти // ПрограммныйИнтерфейс

#Область ПроцедурыВыгрузкиДанных

Функция ЗаписьАД_Найти(ИмяЗаписиАД, ГруппаАД = "")
	
	ТекстЗапроса = "SELECT
	               |	ADsPath,
				   |	distinguishedName
	               |FROM
	               |	'LDAP://[[ПутьЛДАП]]'
	               |WHERE
				   |	objectCategory='person'
				   |	AND objectClass='user'
				   |	AND sAMAccountName='%1'";
	ТекстЗапроса = СтрШаблон(ТекстЗапроса, ИмяЗаписиАД);
	
	Соединение = ПолучитьСоединениеАД();

	Попытка
		ЗаписиАД = ВыполнитьЗапросЛДАП(Соединение, ТекстЗапроса, ГруппаАД);
	Исключение
		Разделитель = "-------------------------------------------------";
		ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ТекстОшибки = СтрШаблон("Не удалось выполнить запрос к Active Directory:%1[%2%1%3%1%2]%1%4",
		                        Символы.ПС,
								Разделитель,
								ТекстЗапроса,
								ТекстОшибки);
		ВызватьИсключение ТекстОшибки;
	КонецПопытки;

	
	Для Каждого ТекЗапись Из ЗаписиАД Цикл
		Возврат ТекЗапись.Ключ;
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции // ЗаписьАД_Найти()

Процедура ЗаписьАД_Включить(ИмяЗаписиАД)

	ЗаписьАД_ИзменитьАктивность(ИмяЗаписиАД, Истина);

КонецПроцедуры // ЗаписьАД_Включить()

Процедура ЗаписьАД_Выключить(ИмяЗаписиАД)

	ЗаписьАД_ИзменитьАктивность(ИмяЗаписиАД, Ложь);

КонецПроцедуры // ЗаписьАД_Выключить()

Процедура ЗаписьАД_ИзменитьАктивность(ИмяЗаписиАД, Включить)

	ПутьАД = ЗаписьАД_Найти(ИмяЗаписиАД);

	ФлагУчетнаяЗаписьОтключена = 2;

	ЛДАП = ПолучитьCOMОбъект("LDAP:");
	Контейнер = ЛДАП.OpenDSObject(ПутьАД, Пользователь, Пароль, 0);
		
	ФлагиРазрешений = Контейнер.Get("userAccountControl"); 
	УчетнаяЗаписьОтключена = ПобитовоеИ(ФлагиРазрешений, ФлагУчетнаяЗаписьОтключена);

	Если Включить И НЕ УчетнаяЗаписьОтключена = 0 Тогда // Включить отключенную запись
		ФлагиРазрешений = ПобитовоеИНе(ФлагиРазрешений, ФлагУчетнаяЗаписьОтключена);
	ИначеЕсли НЕ Включить И УчетнаяЗаписьОтключена = 0 Тогда // Выключить включенную запись
		ФлагиРазрешений = ПобитовоеИли(ФлагиРазрешений, ФлагУчетнаяЗаписьОтключена);
	Иначе
		Возврат
	КонецЕсли;

	Контейнер.Put("userAccountControl", ФлагиРазрешений);

КонецПроцедуры // ЗаписьАД_ИзменитьАктивность()

Процедура ЗаписьАД_УстановитьСвойство(Запись, Знач ИмяСвойства, Знач ЗначениеСвойства, Знач УстанавливатьПустое = Ложь)

	Если ВРег(ИмяСвойства) = "SAMACCOUNTNAME"
	 ИЛИ ВРег(ИмяСвойства) = "CANONICALNAME"
	 ИЛИ ВРег(ИмяСвойства) = "NAME"
	 ИЛИ ВРег(ИмяСвойства) = "PWDLASTSET"
	 ИЛИ ВРег(ИмяСвойства) = "ENABLED"
	 ИЛИ ВРег(ИмяСвойства) = "USERACCOUNTCONTROL" Тогда
		Возврат;
	КонецЕсли;
	Если ЗначениеСвойства = Неопределено Тогда
		ЗначениеСвойства = "";
	КонецЕсли;
	Если НЕ УстанавливатьПустое И ПустаяСтрока(ЗначениеСвойства) Тогда
		Возврат;
	КонецЕсли;

	Попытка
		Запись.GetInfo();
		Запись.Put(ИмяСвойства, ЗначениеСвойства);
		Запись.SetInfo();
	Исключение
		ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ТекстОшибки = СтрШаблон("Ошибка установки значения свойства %1 (%2):%3%4",
		                        ИмяСвойства,
		                        ЗначениеСвойства,
		                        Символы.ПС,
		                        ТекстОшибки);
		ВызватьИсключение ТекстОшибки;
	КонецПопытки;

КонецПроцедуры // ЗаписьАД_УстановитьСвойство()

// Функция - создает пользователя АД
//
// Параметры:
//  НовыеДанныеПользователя		 - Соответствие		 - Новые значения атрибутов AD пользователя (Ключ - имя атрибута, Значение - значение атрибута)
//
Функция ЗаписьАД_Создать(НовыеДанныеПользователя)

	ПутьАД = СтрШаблон("%1%2%3", Домен, ?(ЗначениеЗаполнено(Группа), "/", ""), Группа);
	ПутьККонтейнеруАД = СтрШаблон("LDAP://%1", ПутьАД);
	
	ФлагЗаписьОтключена = 2;
	ФлагПарольНеТребуется = 32;
	ФлагПарольНеИстекает  = 65536;
	
	ЛДАП = ПолучитьCOMОбъект("LDAP:");
	Контейнер = ЛДАП.OpenDSObject(ПутьККонтейнеруАД, Пользователь, Пароль, 0);
	
	КаноничноеИмя = НовыеДанныеПользователя.Получить("canonicalName");
	ИмяПользователя = НовыеДанныеПользователя.Получить("sAMAccountName");
	
	НовыйПользователь = Контейнер.Create("user", СтрШаблон("CN=""%1""", КаноничноеИмя));
	НовыйПользователь.Put("sAMAccountName", ИмяПользователя);
	НовыйПользователь.SetInfo();
	
	НовыйПользователь.SetPassword(ПарольПоУмолчанию);
	
	ЗаписьАД_УстановитьСвойство(НовыйПользователь, "pwdLastSet", 0);

	ФлагиРазрешений = НовыйПользователь.Get("userAccountControl"); 
	ФлагиРазрешений = ПобитовоеИНе(ФлагиРазрешений,
	                               ФлагПарольНеТребуется +
	                               ФлагПарольНеИстекает);
	Если НовыеДанныеПользователя.Получить("Enabled") = Истина Тогда
		ФлагиРазрешений = ПобитовоеИНе(ФлагиРазрешений, ФлагЗаписьОтключена);
	Иначе
		ФлагиРазрешений = ПобитовоеИли(ФлагиРазрешений, ФлагЗаписьОтключена);
	КонецЕсли;
	НовыйПользователь.Put("userAccountControl", ФлагиРазрешений);
	НовыйПользователь.SetInfo();
	
	ОшибкиУстановкиЗначений = Новый Массив();
	
	Для Каждого ТекПоле Из НовыеДанныеПользователя Цикл
		Попытка
			ЗаписьАД_УстановитьСвойство(НовыйПользователь, ТекПоле.Ключ, ТекПоле.Значение);
		Исключение
			ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ОшибкиУстановкиЗначений.Добавить(ТекстОшибки);
		КонецПопытки;
	КонецЦикла;

	Если ОшибкиУстановкиЗначений.Количество() > 0 Тогда
		ТекстОшибки = СтрСоединить(ОшибкиУстановкиЗначений, Символы.ПС);
		ТекстОшибки = СтрШаблон("Ошибка создания пользователя %1 (%2):%3%4",
		                        КаноничноеИмя,
		                        ИмяПользователя,
		                        Символы.ПС,
		                        ТекстОшибки);
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	
КонецФункции // ЗаписьАД_Создать()

// Процедура - изменяет данные пользователя АД
//
// Параметры:
//  ПутьАД						 - Строка			 - Значение атрибута ADsPath пользователя домена для изменения
//  НовыеДанныеПользователя		 - Соответствие		 - Новые значения атрибутов AD пользователя (Ключ - имя атрибута, Значение - значение атрибута)
//
Процедура ЗаписьАД_Изменить(ПутьАД, НовыеДанныеПользователя)
	
	ЛДАП = ПолучитьCOMОбъект("LDAP:");
	Запись = ЛДАП.OpenDSObject(ПутьАД, Пользователь, Пароль, 0);
		
	ОшибкиУстановкиЗначений = Новый Массив();
	
	Для Каждого ТекПоле Из НовыеДанныеПользователя Цикл
		Попытка
			ЗаписьАД_УстановитьСвойство(Запись, ТекПоле.Ключ, ТекПоле.Значение);
		Исключение
			ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ОшибкиУстановкиЗначений.Добавить(ТекстОшибки);
		КонецПопытки;
	КонецЦикла;

	ФлагЗаписьОтключена = 2;

	ФлагиРазрешений = Запись.Get("userAccountControl"); 
	Если НовыеДанныеПользователя.Получить("Enabled") = Истина Тогда
		ФлагиРазрешений = ПобитовоеИНе(ФлагиРазрешений, ФлагЗаписьОтключена);
	Иначе
		ФлагиРазрешений = ПобитовоеИли(ФлагиРазрешений, ФлагЗаписьОтключена);
	КонецЕсли;
	Запись.Put("userAccountControl", ФлагиРазрешений);
	Запись.SetInfo();
	
	Если ОшибкиУстановкиЗначений.Количество() > 0 Тогда
		КаноничноеИмя = НовыеДанныеПользователя.Получить("canonicalName");
		ИмяПользователя = НовыеДанныеПользователя.Получить("sAMAccountName");

		ТекстОшибки = СтрСоединить(ОшибкиУстановкиЗначений, Символы.ПС);
		ТекстОшибки = СтрШаблон("Ошибка изменения пользователя %1 (%2):%3%4",
		                        КаноничноеИмя,
		                        ИмяПользователя,
		                        Символы.ПС,
		                        ТекстОшибки);
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;

КонецПроцедуры // ЗаписьАД_Изменить()

// Функция - Дополняет текст запроса загрузки данных в Active Directory
//			 данными, полученными запросом 1С
//
// Параметры:
//  ТаблицаКВыгрузке               - ТаблицаЗначений       - результат запроса 1С
//  СоответствиеПолей              - ТаблицаЗначений       - описание сопоставления колонок запроса 1С и таблицы СУБД-приемника
//                                   Массив из Структура
//    *АтрибутАД                     - Строка                - имя поля записи Active Directory
//    *КолонкаЗапроса                - Строка                - имя колонки запроса получения данных 1С
//    *ПолеПоиска                    - Булево                - признак ключевого поля, по которому выполняется поск записей Active Directory
//    *Выражение					 - Строка                - выражение на языке 1С, которое будет выполнено для строки результата запроса
//                                                             и результат которого будет передан для записи в Active Directory
//    *НеПустое                      - Булево                - признак того, что поле записи Active Directory не может быть пустым
//  ПроизвольныеВыражения          - ТаблицаЗначений       - таблица произвольных выражений на языке 1С, для обработки выгружаемых значений
//                                   Массив из Структура
//    *Имя                           - Строка                - имя произвольного выражения
//    *Код                         - Строка                  - код произвольного выражения на языке 1С
// 
// Возвращаемое значение:
//  Массив из Структура                        - запросы для изменения данных в Active Directory
//    *НовыеЗначенияПолей    - Соответствие      - новые значения полей для записи в Active Directory
//    *Запрос                - Строка            - текст запроса изменения данных в Active Directory
//
Функция ПодготовитьДанныеДляОбработки(ТаблицаКВыгрузке) Экспорт
	
	ЗапросыАД = Новый Массив();
	
	Ошибки = Новый Массив();
	
	//Обрабатываем поля для которых указано выражение для вычисления значения
	Для Каждого ТекСтрока Из ТаблицаКВыгрузке Цикл
		
		НовыеЗначенияПолей = Новый Соответствие();
		
		Для Каждого ТекСоответствие Из СоответствиеПолей Цикл
			
			Если ЗначениеЗаполнено(ТекСоответствие.Выражение) Тогда
			
				Попытка
					ТекСтрока[ТекСоответствие.КолонкаЗапроса] = ВычислитьВыражениеДляПоля(ТекСтрока, ТекСоответствие.Выражение);
				Исключение	
					ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
					ТекстОшибки = СтрШаблон("Не удалось вычислить выражение ""%1"" для поля ""%2"":%3%4",
					                        ТекСоответствие.Выражение,
					                        ТекСоответствие.КолонкаЗапроса,
					                        Символы.ПС,
					                        ТекстОшибки);
					Ошибки.Добавить(ТекстОшибки);
					Продолжить;
				КонецПопытки;
				
			КонецЕсли;
	
			//Если ТекСоответствие.ПолеПоиска Тогда
			//	Продолжить;
			//КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(ТекСтрока[ТекСоответствие.КолонкаЗапроса]) И ТекСоответствие.НеПустое Тогда
				Продолжить;
			КонецЕсли;
			
			НовыеЗначенияПолей.Вставить(ТекСоответствие.АтрибутАД, ТекСтрока[ТекСоответствие.КолонкаЗапроса]);
		КонецЦикла;
		
		ЗапросАД = ПодготовитьТекстЗапросаАД(СоответствиеПолей, ТекСтрока);
		
		ЗапросыАД.Добавить(Новый Структура("Запрос, НовыеЗначенияПолей", ЗапросАД, НовыеЗначенияПолей));
		
	КонецЦикла;
	
	Если Ошибки.Количество() > 0 Тогда
		ТекстОшибки = СтрСоединить(Ошибки, Символы.ПС);
		ТекстОшибки = СтрШаблон("Ошибка подготовки запросов к Active Directory:%1%2", Символы.ПС, ТекстОшибки);
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	
	Возврат ЗапросыАД;
	
КонецФункции // ПодготовитьДанныеДляОбработки()

// Функция - Выполняет получение записей Active Directory и их изменение 
//
// Параметры:
//  ЗапросыАД					- Массив (Структура)		 - Массив запросов для изменения данных в Active Directory
//		НовыеЗначенияПолей		- Соответствие				 - Новыйе значения полей для записи в Active Directory
//		Запрос					- Строка					 - Текст запроса изменения данных в Active Directory
// 
// Возвращаемое значение:
//  	Булево			 - Истина - Записи Active Directory успешно обработаны; Ложь - в противном случае
//
Функция ОбработатьЗаписиАД(ЗапросыАД) Экспорт
	
	Соединение = ПолучитьСоединениеАД();
	
	Результат = Новый Структура();
	Результат.Вставить("Новые"     , Новый Массив());
	Результат.Вставить("Измененные", Новый Массив());
	Результат.Вставить("Ошибки"    , Новый Массив());
	
	НовыеЗаписи = Новый Массив();
	Для Каждого ТекЗапрос Из ЗапросыАД Цикл
		
		Попытка
			//ТекЗапрос.НовыеЗначенияПолей["sAMAccountName"] = "broshkyx1";
			ИмяЗаписиАД = СокрЛП(ТекЗапрос.НовыеЗначенияПолей.Получить("sAMAccountName"));
		Исключение
			ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		КонецПопытки;
		Если НЕ ЗначениеЗаполнено(ИмяЗаписиАД) Тогда
			Если ЗначениеЗаполнено(ТекстОшибки) Тогда
				ТекстОшибки = СтрШаблон("Не удалось получить имя записи Active Directory:%1%2", Символы.ПС, ТекстОшибки);
			Иначе
				ТекстОшибки = "Не удалось получить имя записи Active Directory";
			КонецЕсли;
			Результат.Ошибки.Добавить(ТекстОшибки);
		КонецЕсли;

		ЗаписьАД = ЗаписьАД_Найти(ИмяЗаписиАД);
		
		Если ЗаписьАД = Неопределено И СоздаватьЗаписиАД Тогда
			Попытка
				ЗаписьАД_Создать(ТекЗапрос.НовыеЗначенияПолей);
			Исключение
				ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
				ТекстОшибки = СтрШаблон("Не удалось создать пользователя Active Directory ""%1"":%2%3",
				                        ИмяЗаписиАД,
				                        Символы.ПС,
				                        ТекстОшибки);
				Результат.Ошибки.Добавить(ТекстОшибки);
			КонецПопытки;
			Результат.Новые.Добавить(ИмяЗаписиАД);
		ИначеЕсли ЗаписьАД = Неопределено Тогда
			ТекстОшибки = СтрШаблон("Не найден пользователь Active Directory ""%1""!", ИмяЗаписиАД);
			Результат.Ошибки.Добавить(ТекстОшибки);
		Иначе
			Попытка
				ЗаписьАД_Изменить(ЗаписьАД, ТекЗапрос.НовыеЗначенияПолей);
			Исключение
				ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
				ТекстОшибки = СтрШаблон("Не удалось изменить пользователя Active Directory ""%1"":%2%3",
				                        ИмяЗаписиАД,
				                        Символы.ПС,
				                        ТекстОшибки);
				Результат.Ошибки.Добавить(ТекстОшибки);
			КонецПопытки;
			Результат.Измененные.Добавить(ИмяЗаписиАД);
		КонецЕсли;
		
	КонецЦикла;
	
	Если Результат.Ошибки.Количество() > 0 Тогда
		ТекстОшибки = СтрШаблон("При обработке записей Active Directory возникли ошибки:%1%2",
		                        Символы.ПС,
		                        СтрСоединить(Результат.Ошибки));
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
		
	Возврат Результат;
	
КонецФункции // ОбработатьЗаписиАД()

// Функция - Получает соединение для выполнения запроса к Active Directory
//
// Возвращаемое значение:
//  COMОбъект				- Объект-соединение для запроса данных пользователей Active Directory
//
Функция ПолучитьСоединениеАД()
	
	СтрокаСоединения = СтрШаблон("Provider=ADSDSOObject;User Id=%1;Password=%2", Пользователь, Пароль);

	Попытка
		Соединение = Новый COMОбъект("ADODB.Connection");
		Соединение.Provider = "ADSDSOObject";
		Соединение.Open(СтрокаСоединения);
	Исключение
		ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ТекстОшибки = СтрШаблон("Не удалось получить соединение с Active Directory:%1%2", Символы.ПС, ТекстОшибки);
		ВызватьИсключение ТекстОшибки;
	КонецПопытки;
	
	Возврат Соединение;
	
КонецФункции // ПолучитьСоединениеАД()

// Функция - Подготовить текст запроса АД
//
// Параметры:
//  СоответствиеПолей	 - ТаблицаЗначений				 - Соответствие полей данных атрибутам Active Directory
//		АтрибутАД			 - Строка					 - Имя атрибута active Directory
//		КолонкаЗапроса		 - Строка					 - Имя колонки запроса
//		ПолеПоиска			 - Булево					 - Признак того, что необходимо установить фильтр по указанному атрибуту AD со значением из полученных данных
//  ДанныеКВыгрузке		 - Структура,					 - Данные для выгрузки в Active Directory
//						   СтрокаТаблицыЗначений 
// 
// Возвращаемое значение:
//  Строка				 - Текст запроса к Active Directory
//
Функция ПодготовитьТекстЗапросаАД(СоответствиеПолей, ДанныеКВыгрузке)
	
	ТекстЗапроса = "SELECT";
	
	ТекстУсловия = "
				   |	objectCategory='person'
				   |	AND objectClass='user'";
	
	Для Каждого ТекСтрока Из СоответствиеПолей Цикл
		ТекстЗапроса = ТекстЗапроса
					 + ?(ТекстЗапроса= "SELECT", "", ",")
					 + "
					   |	" + ТекСтрока.АтрибутАД;
		
		Если ТекСтрока.ПолеПоиска Тогда
			ТекстУсловия = ТекстУсловия + ?(ПустаяСтрока(ТекстУсловия), "", "
																		|	AND ") + СокрЛП(ТекСтрока.АтрибутАД) + "='" + СокрЛП(ДанныеКВыгрузке[ТекСтрока.КолонкаЗапроса]) + "'";
		КонецЕсли;
	КонецЦикла;
	
	Если Найти(ТекстЗапроса, "ADsPath") = 0 Тогда
		ТекстЗапроса = ТекстЗапроса
					 + ?(ТекстЗапроса= "SELECT", "", ",")
					 + "
					   |	ADsPath";
	КонецЕсли;

	ТекстЗапроса = ТекстЗапроса + "
								  |FROM 'LDAP://[[ПутьЛДАП]]'
								  |";
	
	Если НЕ ТекстУсловия = "" Тогда
		ТекстЗапроса = ТекстЗапроса + "
								  |	WHERE
								  |	" + ТекстУсловия;
	КонецЕсли;
							  
	Возврат ТекстЗапроса;
	
КонецФункции // ПодготовитьТекстЗапросаАД()

// Функция - Выполнить запрос ЛДАП
//
// Параметры:
//  Соединение				- COMОбъект			 - Объект-соединение для запроса данных пользователей Active Directory
//  ТекстЗапроса			- Строка			 - Текст запроса к Active Directory
// 
// Возвращаемое значение:
//  Соответствие (Структура)		- Список пользователей Active Directory с их атрибутами
//
Функция ВыполнитьЗапросЛДАП(Соединение, Знач ТекстЗапроса, ГруппаАД = "")
	
	// Подключаемся к LDAP
	ЕстьЛДАП = Ложь;
	
	СписокПровайдеров = ПолучитьCOMОбъект("ADs:");
	Для Каждого Провайдер Из СписокПровайдеров Цикл
		Если СтрЧислоВхождений(Провайдер.Name,"LDAP:")>0 Тогда
			ЕстьЛДАП =  Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если НЕ ЕстьЛДАП Тогда
		ВызватьИсключение "Отсутствует провайдер LDAP.";
	КонецЕсли;	

	Попытка	

		КореньДСЕ = ПолучитьCOMОбъект("LDAP://RootDSE");
		СтруктураКонтекстаЗапроса = КореньДСЕ.Get("defaultNamingContext");
	
	Исключение
		ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ТекстОшибки = СтрШаблон("Не удалось подключиться к контейнеру доменов по причине:%1%2",
		                        Символы.ПС,
		                        ТекстОшибки);
		ВызватьИсключение ТекстОшибки;
	КонецПопытки;

	НаборЗаписей = Новый COMObject("ADODB.RecordSet");
	НаборЗаписей.ActiveConnection	= Соединение;
	НаборЗаписей.CursorType			= 3;
	НаборЗаписей.LockType			= 2;
	НаборЗаписей.PageSize			= 10000;
	
	ПутьАД = СтрШаблон("%1%2%3", Домен, ?(ЗначениеЗаполнено(ГруппаАД), "/", ""), ГруппаАД);
	НаборЗаписей.Open(СтрЗаменить(ТекстЗапроса, "[[ПутьЛДАП]]", ПутьАД));
	
	ПользователиАД = Новый Соответствие();
	
	Если НаборЗаписей.EOF = Истина Тогда
		Возврат ПользователиАД;
	КонецЕсли;
	
	НаборЗаписей.MoveFirst();
	Пока НЕ НаборЗаписей.EOF Цикл
		ПользовательАД = Новый Структура();
		Для Каждого ТекПоле ИЗ НаборЗаписей.Fields Цикл
			ПользовательАД.Вставить(ТекПоле.Name, ТекПоле.Value);
		КонецЦикла;
		ПользователиАД.Вставить(ПользовательАД.ADsPath, ПользовательАД);
		НаборЗаписей.MoveNext();
	КонецЦикла; 
	
	Возврат ПользователиАД;
	
КонецФункции // ВыполнитьЗапросЛДАП()

Процедура ПрочитатьНастройки(Знач Настройки) Экспорт

	Если ТипЗнч(Настройки) = Тип("СправочникСсылка.бир_СобытияОбработчики") Тогда
		Настройки = Настройки.ОбработкаНастройки.Получить();
	КонецЕсли;

	Если НЕ ТипЗнч(Настройки) = Тип("Структура") Тогда
		ВызватьИсключение "Не заданы настройки обработчика событий!"
	КонецЕсли;
	
	Домен = "";
	Настройки.Свойство("Домен", Домен);
	
	Группа = "";
	Настройки.Свойство("Группа", Группа);

	Пользователь = "";
	Настройки.Свойство("Пользователь", Пользователь);
	
	Пароль = "";
	Настройки.Свойство("Пароль", Пароль);
	
	СоздаватьЗаписиАД = Ложь;
	Если Настройки.Свойство("СоздаватьЗаписиАД") Тогда
		СоздаватьЗаписиАД = Настройки.СоздаватьЗаписиАД;
	КонецЕсли;
		
	ПарольПоУмолчанию = "Q2w3e4r5t6,01";
	Если Настройки.Свойство("ПарольПоУмолчанию") И ЗначениеЗаполнено(Настройки.ПарольПоУмолчанию) Тогда
		ПарольПоУмолчанию = Настройки.ПарольПоУмолчанию;
	КонецЕсли;
	
	СоответствиеПолей = "";
	Если НЕ Настройки.Свойство("ЗаполнениеПолей", СоответствиеПолей) Тогда
		ВызватьИсключение "Не указано соответствие полей запроса и данных Active Directory!"
	КонецЕсли;

	Запрос_Текст = "";
	Настройки.Свойство("Запрос_Текст", Запрос_Текст);

	Запрос_Параметры = "";
	Настройки.Свойство("Запрос_Параметры", Запрос_Параметры);

	ПроизвольныеВыражения = "";
	Настройки.Свойство("ПроизвольныеВыражения", ПроизвольныеВыражения);

КонецПроцедуры // ПрочитатьНастройки()

#КонецОбласти // ПроцедурыВыгрузкиДанных

#Область ВспомогательныеПроцедуры

// Функция - Вычисляет выражение на языке 1С для строки таблицы
//
// Параметры:
//  ТекущаяСтрока				 - СтрокаТаблицыЗначений	 - Строка, для которой будет вычеслено выражение
//  Выражение					 - Строка					 - Код на языке 1С
// 
// Возвращаемое значение:
//		Произвольный		- Результат вычисления выражения
//
Функция ВычислитьВыражениеДляПоля(ТекущаяСтрока, Знач Выражение) Экспорт
	
	ЭтоПроизвольноеВыражение = Ложь;
	ВыражениеДляВычисления = Выражение;
	
	Если ТипЗнч(ПроизвольныеВыражения) = Тип("ТаблицаЗначений") ИЛИ ТипЗнч(ПроизвольныеВыражения) = Тип("Массив") Тогда
		
		Для Каждого ТекВыражение Из ПроизвольныеВыражения Цикл
			Если ВРег(СокрЛП(ТекВыражение.Имя)) = ВРег(СокрЛП(Выражение)) Тогда
				ВыражениеДляВычисления = ТекВыражение.Код;
				ЭтоПроизвольноеВыражение = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Результат = "";
	
	Попытка
		Выполнить(?(ЭтоПроизвольноеВыражение, "", "Результат = ") + ВыражениеДляВычисления);
	Исключение
		ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ТекстОшибки = СтрШаблон("Ошибка вычисления выражения ""%1"":%2%3", СокрЛП(Выражение), Символы.ПС, ТекстОшибки);
		ВызватьИсключение ТекстОшибки;
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции // ВычислитьВыражениеДляПоля()
	
// Функция - Получает значение поля distinguishedName по переданному значению SAMAccountName
//
// Параметры:
//  ИмяЗаписиАД    - Строка    - идентификатор записи AD (sAMAccountName)
// 
// Возвращаемое значение:
//   Строка			- значение поля distinguishedName первой найденой записи AD ("" - если записей не найдено)
//
Функция ПолноеИмяЗаписиАД(ИмяЗаписиАД, ГруппаАД = "")
	
	ТекстЗапроса = "SELECT
	               |	ADsPath,
				   |	distinguishedName
	               |FROM
	               |	'LDAP://[[ПутьЛДАП]]'
	               |WHERE
				   |	objectCategory='person'
				   |	AND objectClass='user'
				   |	AND sAMAccountName='%1'";
	ТекстЗапроса = СтрШаблон(ТекстЗапроса, ИмяЗаписиАД);
	
	Соединение = ПолучитьСоединениеАД();

	Попытка
		ЗаписиАД = ВыполнитьЗапросЛДАП(Соединение, ТекстЗапроса, ГруппаАД);
	Исключение
		Разделитель = "-------------------------------------------------";
		ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ТекстОшибки = СтрШаблон("Не удалось выполнить запрос к Active Directory:%1[%2%1%3%1%2]%1%4",
		                        Символы.ПС,
								Разделитель,
								ТекстЗапроса,
								ТекстОшибки);
		ВызватьИсключение ТекстОшибки;
	КонецПопытки;

	Для Каждого ТекЗапись Из ЗаписиАД Цикл
		Возврат ТекЗапись.Значение.distinguishedName;
	КонецЦикла;
	
	Возврат "";
	
КонецФункции // ПолноеИмяЗаписиАД()

// Функция - Получает запись AD по переданному значению SAMAccountName
//
// Параметры:
//  ИмяЗаписиАД    - Строка    - идентификатор записи AD (sAMAccountName)
// 
// Возвращаемое значение:
//   Строка			- первая найденая запись AD (Неопределено - если записей не найдено)
//
Функция ЗаписьАД(ИмяЗаписиАД, ГруппаАД = "")
	
	ПутьАД = ЗаписьАД_Найти(ИмяЗаписиАД, ГруппаАД);

	Попытка
		ЛДАП = ПолучитьCOMОбъект("LDAP:");
		Возврат ЛДАП.OpenDSObject(ПутьАД, Пользователь, Пароль, 0);
	Исключение
		ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ТекстОшибки = СтрШаблон("Ошибка получения записи Active Directory по имени ""%1"":%2%3",
		                        ИмяЗаписиАД,
		                        Символы.ПС,
		                        ТекстОшибки);
		ВызватьИсключение ТекстОшибки;
	КонецПопытки;

	Возврат Неопределено;
	
КонецФункции // ЗаписьАД()

#КонецОбласти // ВспомогательныеПроцедуры
