
#Область ОписаниеПеременных

&НаСервере
Перем ПреобразованиеДанных;    // ОбработкаОбъект   - обработка преобразования данных

#КонецОбласти // ОписаниеПеременных

#Область ОбработчикиСобытийФормы

// Процедура - обработчик события "ПриСозданииНаСервере
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Элементы.ВерсияОбработки.Заголовок = "v. " + ВерсияОбработки();

	УстановитьЗапросСПараметрамиНаСервере(Параметры);

КонецПроцедуры // ПриСозданииНаСервере()

#КонецОбласти // ОбработчикиСобытийФормы

#Область ОбработчикиСобытийЭлементовФормы

// Процедура - обработчик события "ПриИзменении" поля "Запрос_Текст" формы
//
&НаКлиенте
Процедура Запрос_ТекстПриИзменении(Элемент)

	Запрос_ОбновитьПараметрыНаСервере();

КонецПроцедуры // Запрос_ТекстПриИзменении()

// Процедура - обработчик события "ПриНачалеРедактирования" таблицы "Запрос_Параметры" формы
//
&НаКлиенте
Процедура Запрос_ПараметрыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)

	ПривестиТипЗначенияПараметра(Элементы.Запрос_Параметры.ТекущиеДанные);

КонецПроцедуры // Запрос_ПараметрыПриНачалеРедактирования()

// Процедура - обработчик события "ПриИзменении" поля "Запрос_ПараметрыСпособЗаполнения" формы
//
&НаКлиенте
Процедура Запрос_ПараметрыСпособЗаполненияПриИзменении(Элемент)

	ПривестиТипЗначенияПараметра(Элементы.Запрос_Параметры.ТекущиеДанные);

КонецПроцедуры // Запрос_ПараметрыСпособЗаполненияПриИзменении()

// Процедура - Ооработчик события "ПриАктивизацииСтрок" поля "НастройкаСоединения" формы
//
&НаКлиенте
Процедура ПроизвольныеВыраженияПриАктивизацииСтроки(Элемент)

	ТекущиеДанные = Элемент.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ОбновитьКодПроизвольногоВыражения = (НЕ ПроизвольныеВыражения_ТекущаяСтрока = Элементы.ПроизвольныеВыражения.ТекущаяСтрока
	                                   И ТипЗнч(ПроизвольныеВыражения_ТекущаяСтрока)= Тип("Число")
	                                   И ПроизвольныеВыражения_ТекущаяСтрока < ПроизвольныеВыражения.Количество());
	Если ОбновитьКодПроизвольногоВыражения Тогда
		ПредыдущаяСтрока = ПроизвольныеВыражения.Получить(ПроизвольныеВыражения_ТекущаяСтрока);
		ПредыдущаяСтрока.Код = ПроизвольныеВыражения_Код;
	КонецЕсли;

	Элементы.ПроизвольныеВыражения_ИмяФункции.Заголовок = ТекущиеДанные.Имя;

	ПроизвольныеВыражения_Код = ТекущиеДанные.Код;

	ПроизвольныеВыражения_ТекущаяСтрока = Элементы.ПроизвольныеВыражения.ТекущаяСтрока;

КонецПроцедуры // ПроизвольныеВыраженияПриАктивизацииСтроки()

&НаКлиенте
Процедура ПроизвольныеВыраженияПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)

	ТекущиеДанные = Элемент.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Элементы.ПроизвольныеВыражения_ИмяФункции.Заголовок = ТекущиеДанные.Имя;
	
КонецПроцедуры // ПроизвольныеВыраженияПриОкончанииРедактирования()

#КонецОбласти // ОбработчикиСобытийЭлементовФормы

#Область ОбработчикиКомандФормы

// Процедура - обработчик команды "Запрос_ОткрытьКонструктор"
//
&НаКлиенте
Процедура Запрос_ОткрытьКонструктор(Команда)

	Конструктор = Новый КонструкторЗапроса(Запрос_Текст);

	ОповещениеОЗакрытии = Новый ОписаниеОповещения("Запрос_ОткрытьКонструкторЗавершение", ЭтаФорма);
	Конструктор.Показать(ОповещениеОЗакрытии);

КонецПроцедуры // Запрос_ОткрытьКонструктор()

// Процедура - завершение обработчика команды "Запрос_ОткрытьКонструктор"
// после закрытия конструктора запросов
//
// Параметры:
//   Текст                      - Строка       - Текст запроса
//   ДополнительныеПараметры    - Структура    - Параметры переданные из команды "Запрос_ОткрытьКонструктор"
//
&НаКлиенте
Процедура Запрос_ОткрытьКонструкторЗавершение(Текст, ДополнительныеПараметры) Экспорт

	Если Текст = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Запрос_Текст = Текст;

	Запрос_ОбновитьПараметрыНаСервере();

КонецПроцедуры // Запрос_ОткрытьКонструкторЗавершение()

&НаКлиенте
Процедура Запрос_ПроверитьСинтаксис(Команда)
	
	ТекстСообщения = "";
	Запрос_ПроверитьСинтаксисСервер(ТекстСообщения);
	Если ЗначениеЗаполнено(ТекстСообщения) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения, Объект.Ссылка, , Объект.ТекстЗапроса);
	КонецЕсли;
	
КонецПроцедуры // Запрос_ПроверитьСинтаксис()

&НаСервере
Процедура Запрос_ПроверитьСинтаксисСервер(ТекстОшибки = "")
	
	Схема = Новый СхемаЗапроса();
	
	Попытка
		Схема.УстановитьТекстЗапроса(Запрос_Текст);
	Исключение
		ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ТекстОшибки = СтрШаблон("ru = 'Текст запроса содержит ошибки:%1%2'", Символы.ПС, ТекстОшибки);
		ТекстОшибки = НСтр(ТекстОшибки);
	КонецПопытки;
	
КонецПроцедуры // Запрос_ПроверитьСинтаксисСервер()

// Процедура - обработчик команды "Запрос_ОбновитьПараметры"
//
&НаКлиенте
Процедура Запрос_ОбновитьПараметры(Команда)

	Запрос_ОбновитьПараметрыНаСервере();

КонецПроцедуры // Запрос_ОбновитьПараметры()

// Процедура - обновляет параметры запроса из текста запроса
//
&НаСервере
Процедура Запрос_ОбновитьПараметрыНаСервере()

	Если ПустаяСтрока(Запрос_Текст) Тогда
		Возврат;
	КонецЕсли;

	Схема = Новый СхемаЗапроса();
	Схема.УстановитьТекстЗапроса(Запрос_Текст);

	НайденныеПараметры = Схема.НайтиПараметры();

	Для Каждого ТекПараметр Из НайденныеПараметры Цикл

		СтрокиПараметров = Запрос_Параметры.НайтиСтроки(Новый Структура("Имя", ТекПараметр.Имя));

		Если СтрокиПараметров.Количество() = 0 Тогда
			СтрокаПараметра = Запрос_Параметры.Добавить();
			СтрокаПараметра.Имя              = ТекПараметр.Имя;
			СтрокаПараметра.СпособЗаполнения = "Значение";
		Иначе
			СтрокаПараметра = СтрокиПараметров[0];
		КонецЕсли;

		СтрокаПараметра.Тип = ТекПараметр.ТипЗначения;

		Если ВРег(СтрокаПараметра.СпособЗаполнения) = "ЗНАЧЕНИЕ" Тогда
			СтрокаПараметра.Значение = СтрокаПараметра.Тип.ПривестиЗначение(СтрокаПараметра.Значение);
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры // Запрос_ОбновитьПараметрыНаСервере()

// Процедура - обработчик команды "Запрос_УдалитьНеиспользуемыеПараметры"
//
&НаКлиенте
Процедура Запрос_УдалитьНеиспользуемыеПараметры(Команда)

	Запрос_УдалитьНеиспользуемыеПараметрыНаСервере();

КонецПроцедуры // Запрос_УдалитьНеиспользуемыеПараметры()

// Процедура - удаляет параметры, отсутствующие в тексте запроса
//
&НаСервере
Процедура Запрос_УдалитьНеиспользуемыеПараметрыНаСервере()

	Если ПустаяСтрока(Запрос_Текст) Тогда
		Запрос_Параметры.Очистить();
		Возврат;
	КонецЕсли;

	Схема = Новый СхемаЗапроса();
	Схема.УстановитьТекстЗапроса(Запрос_Текст);

	НайденныеПараметры = Схема.НайтиПараметры();

	УдаляемыеПараметры = Новый Массив();

	Для Каждого ТекСтрокаПараметра Из Запрос_Параметры Цикл

		Если НЕ НайденныеПараметры.Найти(ТекСтрокаПараметра.Имя) = Неопределено Тогда
			Продолжить;
		КонецЕсли;

		УдаляемыеПараметры.Добавить(ТекСтрокаПараметра);
	КонецЦикла;
	
	Для Каждого ТекСтрокаПараметра Из УдаляемыеПараметры Цикл
		Запрос_Параметры.Удалить(ТекСтрокаПараметра);
	КонецЦикла;

КонецПроцедуры // Запрос_УдалитьНеиспользуемыеПараметрыНаСервере()

// Процедура - обработчик команды "ПроизвольныеВыражения_Сохранить"
//
&НаКлиенте
Процедура ПроизвольныеВыражения_Сохранить(Команда)

	ТекущиеДанные = Элементы.ПроизвольныеВыражения.ТекущиеДанные;

	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ТекущиеДанные.Код = ПроизвольныеВыражения_Код;

КонецПроцедуры // ПроизвольныеВыражения_Сохранить()

#КонецОбласти // ОбработчикиКомандФормы

#Область ПроцедурыСохраненияИЗагрузкиНастроек

// Процедура - обработчик команды "СохранитьНастройкиИЗакрыть"
//
&НаКлиенте
Процедура ПрименитьНастройкиИЗакрыть(Команда)

	Закрыть("ИзмененыНастройки");

КонецПроцедуры // ПрименитьНастройкиИЗакрыть()
	
// Функция - получить настройки для сохранения на сервере
// 
// Возвращаемое значение:
//   Строка    - настройки в формате JSON
//
&НаСервере
Функция ПолучитьНастройкиДляСохраненияНаСервере()

	СтруктураНастроек = ПолучитьЗапросСПараметрамиНаСервере();

	Возврат ПреобразованиеДанных().ЗаписатьОписаниеОбъектаВJSON(СтруктураНастроек);

КонецФункции // ПолучитьНастройкиДляСохраненияНаСервере()

// Процедура - обработчик команды "СохранитьНастройкиВФайл"
//
&НаКлиенте
Процедура СохранитьНастройкиВФайл(Команда)

	ВыборФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	ВыборФайла.Фильтр = "Настройки процессора запросов (*.json)|*.json";
	ВыборФайла.Заголовок = "Сохранение настроек процессора запросов";

	ОбработкаВыбораФайла = Новый ОписаниеОповещения("СохранитьНастройкиВФайлЗавершение", ЭтотОбъект);

	ВыборФайла.Показать(ОбработкаВыбораФайла);

КонецПроцедуры // СохранитьНастройкиВФайл()

// Процедура - завершение обработки команды команды "СохранитьНастройкиВФайл"
//
&НаКлиенте
Процедура СохранитьНастройкиВФайлЗавершение(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт

	Если НЕ ТипЗнч(ВыбранныеФайлы) = Тип("Массив") Тогда
		Возврат;
	КонецЕсли;

	Если ВыбранныеФайлы.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	Настройки = ПолучитьНастройкиДляСохраненияНаСервере();

	ТекстНастроек = Новый ТекстовыйДокумент();
	ТекстНастроек.УстановитьТекст(Настройки);
	ТекстНастроек.НачатьЗапись(, ВыбранныеФайлы[0], "UTF-8");

КонецПроцедуры // СохранитьНастройкиВФайлЗавершение()

// Процедура - Загрузить настройки на сервере
//
// Параметры:
//  ТекстНастроек    - Строка (JSON)    - настройки в формате JSON
//
&НаСервере
Процедура ЗагрузитьНастройкиНаСервере(Знач ТекстНастроек)

	СтруктураНастроек = ПреобразованиеДанных().ПрочитатьОписаниеОбъектаИзJSON(ТекстНастроек);

	Настройки = ПреобразованиеДанных().ЗначениеИзСтруктуры(СтруктураНастроек);

	УстановитьЗапросСПараметрамиНаСервере(Настройки);

КонецПроцедуры // ЗагрузитьНастройкиНаСервере()

// Процедура - Обработчик команды "ЗагрузитьНастройкиИзФайла"
//
&НаКлиенте
Процедура ЗагрузитьНастройкиИзФайла(Команда)

	ВыборФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ВыборФайла.Фильтр = "Настройки процессора запросов (*.json)|*.json";
	ВыборФайла.Заголовок = "Открытие настроек процессора запросов";

	ОбработкаВыбораФайла = Новый ОписаниеОповещения("ЗагрузитьНастройкиИзФайлаПродолжение", ЭтотОбъект);

	ВыборФайла.Показать(ОбработкаВыбораФайла);

КонецПроцедуры // ЗагрузитьНастройкиИзФайла()

// Процедура - Продолжение обработки команды команды "ЗагрузитьНастройкиИзФайла"
//
&НаКлиенте
Процедура ЗагрузитьНастройкиИзФайлаПродолжение(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт

	Если НЕ ТипЗнч(ВыбранныеФайлы) = Тип("Массив") Тогда
		Возврат;
	КонецЕсли;

	Если ВыбранныеФайлы.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	ДопПараметры = Новый Структура("ТекстНастроек", Новый ТекстовыйДокумент());

	ОбработкаЧтенияФайла = Новый ОписаниеОповещения("ЗагрузитьНастройкиИзФайлаЗавершение", ЭтотОбъект, ДопПараметры);

	ДопПараметры.ТекстНастроек.НачатьЧтение(ОбработкаЧтенияФайла, ВыбранныеФайлы[0], "UTF-8");

КонецПроцедуры // ЗагрузитьНастройкиИзФайлаПродолжение()

// Процедура - Завершение обработки команды команды "ЗагрузитьНастройкиИзФайла"
//
&НаКлиенте
Процедура ЗагрузитьНастройкиИзФайлаЗавершение(ДополнительныеПараметры) Экспорт

	ЗагрузитьНастройкиНаСервере(ДополнительныеПараметры.ТекстНастроек.ПолучитьТекст());

КонецПроцедуры // ЗагрузитьНастройкиИзФайлаЗавершение()

#КонецОбласти // ПроцедурыСохраненияИЗагрузкиНастроек

#Область ПрограммныйИнтерфейс

// Функция - возвращает список колонок запроса
//
// Возвращаемое значение:
//   Массив из Структура                - Список колонок запроса и их типов
//     *Имя            - Строка           - Имя колонки запроса
//     *ТипЗначения    - ОписаниеТипов    - Тип колонки запроса
//
&НаКлиенте
Функция ПолучитьКолонкиЗапроса() Экспорт

	Возврат ПолучитьКолонкиЗапросаНаСервере();

КонецФункции // ПолучитьКолонкиЗапроса()

// Функция - возвращает список колонок запроса
//
// Возвращаемое значение:
//   Массив из Структура                - Список колонок запроса и их типов
//     *Имя            - Строка           - Имя колонки запроса
//     *ТипЗначения    - ОписаниеТипов    - Тип колонки запроса
//
&НаСервере
Функция ПолучитьКолонкиЗапросаНаСервере()

	КолонкиЗапроса = Новый Массив();

	Если ПустаяСтрока(Запрос_Текст) Тогда
		Возврат КолонкиЗапроса;
	КонецЕсли;

	Схема = Новый СхемаЗапроса();
	Схема.УстановитьТекстЗапроса(Запрос_Текст);

	Запрос = Неопределено;
	Для Каждого ТекЗапрос Из Схема.ПакетЗапросов Цикл

		Если ТипЗнч(ТекЗапрос) = Тип("ЗапросУничтоженияТаблицыСхемыЗапроса") Тогда
			Продолжить;
		КонецЕсли;
		Если ЗначениеЗаполнено(ТекЗапрос.ТаблицаДляПомещения) Тогда
			Продолжить;
		КонецЕсли;

		Запрос = ТекЗапрос;
	КонецЦикла;

	Если ТипЗнч(Запрос) = Тип("ЗапросВыбораСхемыЗапроса") Тогда
		Для Каждого ТекКолонка Из Запрос.Колонки Цикл
			Колонка = Новый Структура();
			Колонка.Вставить("Имя"        , ТекКолонка.Псевдоним);
			Колонка.Вставить("ТипЗначения", ТекКолонка.ТипЗначения);
			КолонкиЗапроса.Добавить(Колонка);
		КонецЦикла;
	КонецЕсли;

	Возврат КолонкиЗапроса;

КонецФункции // ПолучитьКолонкиЗапросаНаСервере()

// Функция - возвращает тест запроса, таблицы параметров и произвольных выражений
// 
// Возвращаемое значение:
//   Структура                                          - Текст запроса, таблицы параметров
//                                                        и произвольных выражений
//     *Запрос_Текст             - Строка                 - Текст запроса
//     *Запрос_Параметры         - Структура из Структура    - Параметры запроса
//     *ПроизвольныеВыражения    - Структура    - Произвольные выражения
//
&НаКлиенте
Функция ПолучитьЗапросСПараметрами() Экспорт

	Возврат ПолучитьЗапросСПараметрамиНаСервере();

КонецФункции // ПолучитьЗапросСПараметрами()

// Функция - возвращает тест запроса, таблицы параметров и произвольных выражений
// 
// Возвращаемое значение:
//   Структура                                             - Текст запроса, таблицы параметров
//                                                           и произвольных выражений
//     *Запрос_Текст             - Строка                    - Текст запроса
//     *Запрос_Параметры         - Структура из Структура    - Параметры запроса
//       **Ключ                    - Строка                    - имя параметра запроса
//       **Значение
//          ***Значение              - Произвольный              - значение параметра запроса
//                                                                 или имя произвольного выражения
//          ***Выражение             - Булево                    - Истина - для вычисления значения параметра
//                                                                 используется произвольное выражение
//     *ПроизвольныеВыражения    - Соответствие              - Произвольные выражения
//       **Ключ                     - Строка                   - имя произвольного выражения
//       **Значение                 - Строка                   - код произвольного выражения
//
&НаСервере
Функция ПолучитьЗапросСПараметрамиНаСервере()
	
	ПараметрыДляСохранения = Новый Структура();
	Для Каждого ТекСтрока Из Запрос_Параметры Цикл
		ЗначениеПараметра = Новый Структура("Значение, Выражение");
		ЗначениеПараметра.Значение  = ТекСтрока.Значение;
		ЗначениеПараметра.Выражение = (ВРег(ТекСтрока.СпособЗаполнения) = "ВЫРАЖЕНИЕ");
		ПараметрыДляСохранения.Вставить(ТекСтрока.Имя, ЗначениеПараметра);
	КонецЦикла;
	
	ВыраженияДляСохранения = Новый Соответствие();
	Для Каждого ТекСтрока Из ПроизвольныеВыражения Цикл
		ВыраженияДляСохранения.Вставить(ТекСтрока.Имя, ТекСтрока.Код);
	КонецЦикла;

	ЗапросСПараметрами = Новый Структура();
	ЗапросСПараметрами.Вставить("Запрос_Текст"         , Запрос_Текст);
	ЗапросСПараметрами.Вставить("Запрос_Параметры"     , ПараметрыДляСохранения);
	ЗапросСПараметрами.Вставить("ПроизвольныеВыражения", ВыраженияДляСохранения);

	Возврат ЗапросСПараметрами;

КонецФункции // ПолучитьЗапросСПараметрамиНаСервере()

// Функция - устанавливает значения реквизитов формы из переданных настроек
//
// Параметры:
//   Настройки                 - Структура                 - Текст запроса, таблицы параметров
//                                                           и произвольных выражений
//     *Запрос_Текст             - Строка                    - Текст запроса
//     *Запрос_Параметры         - Структура из Структура    - Параметры запроса
//       **Ключ                    - Строка                    - имя параметра запроса
//       **Значение
//          ***Значение              - Произвольный              - значение параметра запроса
//                                                                 или имя произвольного выражения
//          ***Выражение             - Булево                    - Истина - для вычисления значения параметра
//                                                                 используется произвольное выражение
//     *ПроизвольныеВыражения    - Соответствие              - Произвольные выражения
//       **Ключ                     - Строка                   - имя произвольного выражения
//       **Значение                 - Строка                   - код произвольного выражения
//
&НаКлиенте
Процедура УстановитьЗапросСПараметрами(Настройки) Экспорт

	УстановитьЗапросСПараметрамиНаСервере(Настройки);

КонецПроцедуры // УстановитьЗапросСПараметрами()

// Функция - устанавливает значения реквизитов формы из переданных настроек
//
// Параметры:
//   Настройки                 - Структура                 - Текст запроса, таблицы параметров
//                                                           и произвольных выражений
//     *Запрос_Текст             - Строка                    - Текст запроса
//     *Запрос_Параметры         - Структура из Структура    - Параметры запроса
//       **Ключ                    - Строка                    - имя параметра запроса
//       **Значение
//          ***Значение              - Произвольный              - значение параметра запроса
//                                                                 или имя произвольного выражения
//          ***Выражение             - Булево                    - Истина - для вычисления значения параметра
//                                                                 используется произвольное выражение
//     *ПроизвольныеВыражения    - Соответствие              - Произвольные выражения
//       **Ключ                     - Строка                   - имя произвольного выражения
//       **Значение                 - Строка                   - код произвольного выражения
//
&НаСервере
Процедура УстановитьЗапросСПараметрамиНаСервере(Настройки)

	Если НЕ ТипЗнч(Настройки) = Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	Если Настройки.Свойство("Запрос_Текст") Тогда
		Запрос_Текст = Настройки.Запрос_Текст;
	КонецЕсли;

	ЗаполнитьТаблицуПараметровЗапроса(Настройки);
	ЗаполнитьТаблицуПроизвольныхВыражений(Настройки);

КонецПроцедуры // УстановитьЗапросСПараметрамиНаСервере()

#КонецОбласти // ПрограммныйИнтерфейс

#Область СлужебныеПроцедурыИФункции

// Функция - заполняет таблицу редактирования параметров запроса
//
// Параметры:
//   Настройки                 - Структура                 - Текст запроса, таблицы параметров
//                                                           и произвольных выражений
//     *Запрос_Параметры         - Структура из Структура    - Параметры запроса
//       **Ключ                    - Строка                    - имя параметра запроса
//       **Значение
//          ***Значение              - Произвольный              - значение параметра запроса
//                                                                 или имя произвольного выражения
//          ***Выражение             - Булево                    - Истина - для вычисления значения параметра
//                                                                 используется произвольное выражение
//
&НаСервере
Процедура ЗаполнитьТаблицуПараметровЗапроса(Настройки)

	Если НЕ Настройки.Свойство("Запрос_Параметры") Тогда
		Возврат;
	КонецЕсли;

	Если ТипЗнч(Настройки.Запрос_Параметры) = Тип("ТаблицаЗначений") Тогда
		Запрос_Параметры.Загрузить(Настройки.Запрос_Параметры);
		Возврат;
	КонецЕсли;

	Запрос_Параметры.Очистить();
	
	Если НЕ ТипЗнч(Настройки.Запрос_Параметры) = Тип("Структура") Тогда
		Возврат;
	КонецЕсли;

	Для Каждого ТекПараметр Из Настройки.Запрос_Параметры Цикл
		НовыйПараметр = Запрос_Параметры.Добавить();
		НовыйПараметр.Имя = ТекПараметр.Ключ;

		ЭтоСписокЗначений = (ТипЗнч(ТекПараметр.Значение.Значение) = Тип("СписокЗначений")
		                 ИЛИ ТипЗнч(ТекПараметр.Значение.Значение) = Тип("Массив"));
						 
		Если ТипЗнч(ТекПараметр.Значение.Значение) = Тип("Массив") Тогда
			НовыйПараметр.Значение = Новый СписокЗначений();
			НовыйПараметр.Значение.ЗагрузитьЗначения(ТекПараметр.Значение.Значение);
		Иначе
			НовыйПараметр.Значение = ТекПараметр.Значение.Значение;
		КонецЕсли;

		Если ЭтоСписокЗначений Тогда
			НовыйПараметр.СпособЗаполнения = "Список";
			ВремТипы = Новый Массив();
			Для Каждого ТекЭлемент Из НовыйПараметр.Значение Цикл
				Если НЕ ВремТипы.Найти(ТипЗнч(ТекЭлемент.Значение)) = Неопределено Тогда
					Продолжить;
				КонецЕсли;
				ВремТипы.Добавить(ТипЗнч(ТекЭлемент.Значение));
			КонецЦикла;
			НовыйПараметр.Тип = Новый ОписаниеТипов(ВремТипы);
		Иначе
			НовыйПараметр.СпособЗаполнения = ?(ТекПараметр.Значение.Выражение, "Выражение", "Значение");
			НовыйПараметр.Тип              = ТипЗнч(НовыйПараметр.Значение);
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры // ЗаполнитьТаблицуПараметровЗапроса()

// Процедура - заполняет таблицу редактирования произвольных выражений
//
// Параметры:
//   Настройки                 - Структура                 - Текст запроса, таблицы параметров
//                                                           и произвольных выражений
//     *ПроизвольныеВыражения    - Соответствие              - Произвольные выражения
//       **Ключ                     - Строка                   - имя произвольного выражения
//       **Значение                 - Строка                   - код произвольного выражения
//
&НаСервере
Процедура ЗаполнитьТаблицуПроизвольныхВыражений(Настройки)

	Если НЕ Настройки.Свойство("ПроизвольныеВыражения") Тогда
		Возврат;
	КонецЕсли;

	Если ТипЗнч(Настройки.ПроизвольныеВыражения) = Тип("ТаблицаЗначений") Тогда
		ПроизвольныеВыражения.Загрузить(Настройки.ПроизвольныеВыражения);
		Возврат;
	КонецЕсли;

	ПроизвольныеВыражения.Очистить();
	
	Если НЕ (ТипЗнч(Настройки.ПроизвольныеВыражения) = Тип("Соответствие") ИЛИ ТипЗнч(Настройки.ПроизвольныеВыражения) = Тип("Структура")) Тогда
		Возврат;
	КонецЕсли;

	Для Каждого ТекВыражение Из Настройки.ПроизвольныеВыражения Цикл
		НовоеВыражение = ПроизвольныеВыражения.Добавить();
		НовоеВыражение.Имя = ТекВыражение.Ключ;
		НовоеВыражение.Код = ТекВыражение.Значение;
	КонецЦикла;

КонецПроцедуры // ЗаполнитьТаблицуПроизвольныхВыражений()

// Процедура - Устанавливает тип значения параметра запроса, режим выбора из списка и список доступных значений
//
// Параметры:
//   ТекущиеДанные    - ДанныеФормыЭлементКоллекции    - Редактируемая строка параметров запроса
//
&НаКлиенте
Процедура ПривестиТипЗначенияПараметра(ТекущиеДанные)

	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Элементы.Запрос_ПараметрыЗначение.ВыбиратьТип =
		НЕ (ТекущиеДанные.Тип.Типы().Количество() = 1)
		 И (ВРег(ТекущиеДанные.СпособЗаполнения) = "ЗНАЧЕНИЕ"
		 ИЛИ ТекущиеДанные.СпособЗаполнения = "");

	Если ВРег(ТекущиеДанные.СпособЗаполнения) = "СПИСОК" Тогда

		Элементы.Запрос_ПараметрыЗначение.РежимВыбораИзСписка = Ложь;

		ОписаниеСписка = Новый ОписаниеТипов("СписокЗначений");

		ТекущиеДанные.Значение = ОписаниеСписка.ПривестиЗначение(ТекущиеДанные.Значение);
		ТекущиеДанные.Значение.ТипЗначения = ТекущиеДанные.Тип;

	ИначеЕсли ВРег(ТекущиеДанные.СпособЗаполнения) = "ВЫРАЖЕНИЕ" Тогда

		Элементы.Запрос_ПараметрыЗначение.РежимВыбораИзСписка = Истина;
		Элементы.Запрос_ПараметрыЗначение.СписокВыбора.Очистить();

		ОписаниеСтроки = Новый ОписаниеТипов("Строка");

		ТекущиеДанные.Значение = ОписаниеСтроки.ПривестиЗначение(ТекущиеДанные.Значение);

		Для Каждого ТекВыражение Из ПроизвольныеВыражения Цикл
			Элементы.Запрос_ПараметрыЗначение.СписокВыбора.Добавить(ТекВыражение.Имя);
		КонецЦикла;

	Иначе

		Элементы.Запрос_ПараметрыЗначение.РежимВыбораИзСписка = Ложь;
		ТекущиеДанные.Значение = ТекущиеДанные.Тип.ПривестиЗначение(ТекущиеДанные.Значение);

	КонецЕсли;

КонецПроцедуры // ПривестиТипЗначенияПараметра()

// Функция - Получает обработку сериализации значений
//
// Возвращаемое значение:
//   ВнешняяОбработкаОбъект    - обработка преобразования данных
//
&НаСервере
Функция ПреобразованиеДанных() Экспорт

	Если ПреобразованиеДанных = Неопределено Тогда
		ПреобразованиеДанных = Обработки.бир_ПреобразованиеДанных.Создать();
	КонецЕсли;

	Возврат ПреобразованиеДанных; 

КонецФункции // ПреобразованиеДанных()

// Функция - возвращает версию обработки
// 
// Возвращаемое значение:
//   Строка    - версия обработки
//
&НаСервере
Функция ВерсияОбработки()

	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	Возврат ОбработкаОбъект.Версия();

КонецФункции // ВерсияОбработки()

#КонецОбласти // СлужебныеПроцедурыИФункции
