
#Область ПрограммныйИнтерфейс

// Процедура - выводит сообщение пользователю при смене расположения ИБ
//
Процедура ВывестиСообщениеПользователюОТекущемРасположенииИБ() Экспорт
	
	ПараметрыФормыСообщения = Новый Структура("ТекстСообщения");
	Если НЕ бир_РасположениеИБВызовСервера.ВыводитьСообщениеПользователюОТекущемРасположенииИБ(ПараметрыФормыСообщения.ТекстСообщения) Тогда
		Возврат;
	КонецЕсли;
	
	ОткрытьФорму("Справочник.бир_НастройкиРасположенияИБ.Форма.ФормаСообщенияПользователя", ПараметрыФормыСообщения);

КонецПроцедуры // ВывестиСообщениеПользователюОТекущемРасположенииИБ()

// Позволяет переопределить заголовок программы.
//
// Параметры:
//  ЗаголовокПриложения - Строка - текст заголовка программы;
//  ПриЗапуске          - Булево - Истина, если вызывается при начале работы программы.
//                                 В этом случае недопустимо вызывать те серверные функции конфигурации,
//                                 которые рассчитывают на то, что запуск уже полностью завершен. 
//                                 Например, вместо СтандартныеПодсистемыКлиентПовтИсп.ПараметрыРаботыКлиента
//                                 следует вызывать СтандартныеПодсистемыКлиентПовтИсп.ПараметрыРаботыКлиентаПриЗапуске. 
//
Процедура ПриУстановкеЗаголовкаКлиентскогоПриложения(ЗаголовокПриложения, ПриЗапуске) Экспорт
	
	НовыйЗаголовок = "";
	
	Если НЕ бир_РасположениеИБВызовСервера.УстанавливатьЗаголовокСистемы(НовыйЗаголовок) Тогда
		Возврат;
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(НовыйЗаголовок) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыПодключения =
		бир_РасположениеИБКлиентСервер.ПараметрыПодключенияИзСтрокиСоединенияИБ(СтрокаСоединенияИнформационнойБазы());

	Если ЗначениеЗаполнено(ЗаголовокПриложения) Тогда
		НовыйЗаголовок = СтрЗаменить(НовыйЗаголовок, "[СтандартныйЗаголовок]", ЗаголовокПриложения);
	КонецЕсли;

	ИмяСервера = ПараметрыПодключения.АдресСервера;

	Если ЗначениеЗаполнено(ИмяСервера) Тогда
		НовыйЗаголовок = СтрЗаменить(НовыйЗаголовок, "[ИмяСервера]", ИмяСервера);
	КонецЕсли;
	
	ИмяБазы = ПараметрыПодключения.ИмяБазы;

	Если ЗначениеЗаполнено(ИмяБазы) Тогда
		НовыйЗаголовок = СтрЗаменить(НовыйЗаголовок, "[ИмяБазы]", ИмяБазы);
	КонецЕсли;
	
	Версия = бир_РасположениеИБВызовСервера.ВерсияСистемы();
	Если ЗначениеЗаполнено(Версия) Тогда
		НовыйЗаголовок = СтрЗаменить(НовыйЗаголовок, "[Версия]", Версия);
	КонецЕсли;

	ЗаголовокПриложения = НовыйЗаголовок;
	
КонецПроцедуры // ПриУстановкеЗаголовкаКлиентскогоПриложения()

#КонецОбласти // ПрограммныйИнтерфейс

#Область СлужебныйПрограммныйИнтерфейс

// Обработчик начала работы с системой
//
Процедура ПриНачалеРаботыСистемы() Экспорт
	
	бир_РасположениеИБКлиент.ВывестиСообщениеПользователюОТекущемРасположенииИБ();
	
КонецПроцедуры // ПриНачалеРаботыСистемы()

// Функция - возвращает путь к каталогу AppData\Roaming в профиле текущего пользователя
//
// Возвращаемое значение:
//   Строка    - путь к каталогу AppData\Roaming в профиле текущего пользователя
//
Функция КаталогAppData() Экспорт

#Если ВебКлиент Тогда
	Возврат "";
#Иначе
	ИмяФайла = ПолучитьИмяВременногоФайла("txt");
	Команда = СтрШаблон("cmd /c echo %%appdata%% > %1", ИмяФайла);
	
	ЗапуститьПриложение(Команда, , Истина);

	Текст = Новый ТекстовыйДокумент();
	Текст.Прочитать(ИмяФайла);
	
	УдалитьФайлы(ИмяФайла);

	Возврат СокрЛП(Текст.ПолучитьСтроку(1));
#КонецЕсли

КонецФункции // КаталогAppData()

#КонецОбласти // СлужебныйПрограммныйИнтерфейс()
