
#Область ПрограммныйИнтерфейс

// Функция получает дополнительные данные, которые нужно сохранить, при сохранении данных по переданным ссылкам
//
// Параметры:
//   ОсновныеДанные    - Массив Из ЛюбаяСсылка    - список ссылок на объекты, для которых нужно получить
//                                                  дополнительные данные для сохранения
//
// Возвращаемое значение:
//   Массив Из Структура,    - списох дополнительных данных, ссылок или отборов независимых регистров сведений,
//   Массив Из ЛюбаяСсылка     которые нужно сохранить, при сохранении "основных" объектов
//
Функция ДополнительныеДанныеДляСохранения(Знач ОсновныеДанные) Экспорт
	
	ДополнительныеДанные = Новый Массив();
	
	// Здесь можно описать заполнение массива дополнительных данных для сохранения
	// на основании переданного массива ссылок на основные сохраняемые данные
	
	// Шаблон_ДополнитьДанныеДляСохранения(ОсновныеДанные, ДополнительныеДанные);
	
	Возврат ДополнительныеДанные;
	
КонецФункции // ДополнительныеДанныеДляСохранения() 

#КонецОбласти // ПрограммныйИнтерфейс

#Область ПроцедурыИфункцииПолученияДополнительныхДанныхДляСохранения

// Шаблон процедуры получения дополнительных данных
//
Процедура Шаблон_ДополнитьДанныеДляСохранения(ОсновныеДанные, ДополнительныеДанные = Неопределено)
	
	
	
КонецПроцедуры // Шаблон_ДополнитьДанныеДляСохранения()

#КонецОбласти // ПроцедурыИфункцииПолученияДополнительныхДанныхДляСохранения
