
#Область ПрограммныйИнтерфейс

// Процедура - открывает диалог выбора файла и сохраняет данные в выбранный файл
//
// Параметры:
//   Данные             - Массив из ЛюбаяСсылка    - массив ссылок на сохраняемые данные
//   Параметры          - Структура                - описание допустимых типов для загрузки
//     *СсылкаНаОбъект    - ЛюбаяСсылка              - если указана, то загружаются данные в этот объект
//   Форма              - УправляемаяФорма         - форма-владелец
//
Процедура ВыбратьФайлИСохранитьДанные(Данные, Параметры = Неопределено, Форма = Неопределено) Экспорт

	ОбработкаСохранения = ОбработкаСохранения(Параметры, Форма);
	ОбработкаСохранения.ВыбратьФайлИСохранитьДанные(Данные);

КонецПроцедуры // ВыбратьФайлИСохранитьДанные()

// Процедура - выполняет сохранение данных в файл
//
// Параметры:
//   Данные             - Массив из ЛюбаяСсылка    - массив ссылок на сохраняемые данные
//   ПутьКФайлу         - Строка                   - путь к файлу для сохранения
//   Параметры          - Структура                - описание допустимых типов для загрузки
//     *СсылкаНаОбъект    - ЛюбаяСсылка              - если указана, то загружаются данные в этот объект
//   Форма              - УправляемаяФорма         - форма-владелец
//
Процедура СохранитьДанныеВФайл(Данные, ПутьКФайлу, Параметры = Неопределено, Форма = Неопределено) Экспорт

	ОбработкаСохранения = ОбработкаСохранения(Параметры, Форма);
	ОбработкаСохранения.СохранитьДанныеВФайл(Данные, ПутьКФайлу);

КонецПроцедуры // СохранитьДанныеВФайл()

// Процедура - открывает диалог выбора файла и загружает данные из выбранного файла
//
// Параметры:
//   Параметры                - Структура           - описание допустимых типов для загрузки
//     *ОграничениеТипа         - ОписаниеТипов       - описание допустимых типов для загрузки
//     *РезервноеКопирование    - Булево              - Истина - выполнить резервное копирование изменяемых данных
//     *ПоказатьДиалогВыбора    - Булево              - Истина - пользователю будет предложено
//                                                      выбрать восстанавливаемые данные
//     *СсылкаНаОбъект          - ЛюбаяСсылка         - если указана, то загружаются данные в этот объект
//   Форма                   - УправляемаяФорма    - форма-владелец
//
Процедура ВыбратьФайлИВосстановитьДанные(Параметры = Неопределено, Форма = Неопределено) Экспорт

	ОбработкаСохранения = ОбработкаСохранения(Параметры, Форма);
	ОбработкаСохранения.ВыбратьФайлИВосстановитьДанные();

КонецПроцедуры // ВыбратьФайлИВосстановитьДанные()

// Процедура - выполняет загрузку данных из файла
//
// Параметры:
//   ПутьКФайлу               - Строка              - путь к файлу для сохранения
//   Параметры                - Структура           - описание допустимых типов для загрузки
//     *ОграничениеТипа         - ОписаниеТипов       - описание допустимых типов для загрузки
//     *РезервноеКопирование    - Булево              - Истина - выполнить резервное копирование изменяемых данных
//     *ПоказатьДиалогВыбора    - Булево              - Истина - пользователю будет предложено
//                                                      выбрать восстанавливаемые данные
//     *СсылкаНаОбъект          - ЛюбаяСсылка         - если указана, то загружаются данные в этот объект
//   Форма                    - УправляемаяФорма    - форма-владелец
//
Процедура ВосстановитьДанныеИзФайла(ПутьКФайлу, Параметры = Неопределено, Форма = Неопределено) Экспорт

	ОбработкаСохранения = ОбработкаСохранения(Параметры, Форма);
	ОбработкаСохранения.ВосстановитьДанныеИзФайла(ПутьКФайлу);

КонецПроцедуры // ВосстановитьДанныеИзФайла()

#КонецОбласти // ПрограммныйИнтерфейс

#Область СлужебныйПрограммныйИнтерфейс

// Функция - возвращает форму обработки сохранения/восстановления данных
//
// Параметры:
//   ПараметрыОбработки       - Структура           - описание допустимых типов для загрузки
//     *ОграничениеТипа         - ОписаниеТипов       - описание допустимых типов для загрузки
//     *РезервноеКопирование    - Булево              - Истина - выполнить резервное копирование изменяемых данных
//     *ПоказатьДиалогВыбора    - Булево              - Истина - пользователю будет предложено
//                                                      выбрать восстанавливаемые данные
//     *СсылкаНаОбъект          - ЛюбаяСсылка         - если указана, то загружаются данные в этот объект
//   Форма                    - УправляемаяФорма    - форма-владелец
//
// Возвращаемое значение:
//   УправляемаяФорма    - форма обработки сохранения/восстановления данных
//
Функция ОбработкаСохранения(ПараметрыОбработки = Неопределено, Форма = Неопределено) Экспорт

	Параметры = ПараметрыОбработки();
	Если ТипЗнч(ПараметрыОбработки) = Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(Параметры, ПараметрыОбработки);
	КонецЕсли;
	
	Возврат ПолучитьФорму("Обработка.бир_СохранениеВосстановлениеДанных.Форма.Форма", Параметры, Форма);

КонецФункции // ОбработкаСохранения()

// Функция - возвращает структуру параметров обработки сохранения/восстановления файлов
//
// Возвращаемое значение:
//   Структура                                   - описание допустимых типов для загрузки
//     *ОграничениеТипа         - ОписаниеТипов    - описание допустимых типов для загрузки
//     *РезервноеКопирование    - Булево           - Истина - выполнить резервное копирование изменяемых данных
//     *ПоказатьДиалогВыбора    - Булево           - Истина - пользователю будет предложено
//                                                   выбрать восстанавливаемые данные
//     *СсылкаНаОбъект          - ЛюбаяСсылка      - если указана, то загружаются данные в этот объект
//
Функция ПараметрыОбработки() Экспорт

	ПараметрыОбработки = Новый Структура();
	ПараметрыОбработки.Вставить("ОграничениеТипа"     , Новый ОписаниеТипов());
	ПараметрыОбработки.Вставить("РезервноеКопирование", Ложь);
	ПараметрыОбработки.Вставить("ПоказатьДиалогВыбора", Ложь);
	ПараметрыОбработки.Вставить("СсылкаНаОбъект"      , Неопределено);

	Возврат ПараметрыОбработки;

КонецФункции // ПараметрыОбработки()

#КонецОбласти // СлужебныйПрограммныйИнтерфейс
