Перем ПреобразованиеДанных;

#Область ПрограммныйИнтерфейс

// Функция - Подтверждает, что обработка является обработкой обслуживания
// 
// Возвращаемое значение:
//  Булево - Истина
//
Функция ЭтоОбработкаПроверкиСобытия() Экспорт
	
	Возврат Истина;
	
КонецФункции // ЭтоОбработкаПроверкиСобытия()

// Функция - Получает форму обработчиков команд, где расположены процедуры-обработчики команд
// 			 из списка действий кнопки открытия поля выбора обработки обслуживания
// 
// Возвращаемое значение:
//  Строка - Имя формы обработчиков комманд
//
Функция ПолучитьФормуОбработчиковКоманд() Экспорт
	
	Возврат "Форма";
	
КонецФункции // ПолучитьФормуОбработчиковКоманд()

// Функция - Получает список действий кнопки открытия поля выбора обработки обслуживания
// 
// Возвращаемое значение:
//  СписокЗначений - Список действий
//
Функция ПолучитьСписокДействийКнопкиОткрытия() Экспорт
	
	СписокДействий = Новый СписокЗначений();
	
	Возврат СписокДействий;
	
КонецФункции // ПолучитьСписокДействийКнопкиОткрытия()

// Функция - Выполняет проверку условий регистрации события
//
// Параметры:
//  Источник			 - Объект, НаборЗаписей						- Объект - источник возникновения события
//  Событие				 - СправочникСсылка.бир_События				- Проверяемое событие
//  ПараметрыПодписки	 - Структура								- Параметры обработчика подписки на событие, в котором выполняется проверка
//  ПараметрыСобытия	 - Структура								 - Параметры события для сохранения
// 
// Возвращаемое значение:
//  Булево - Истина - событие произошло (проверка выполнена успешно)
//
Функция ПроверитьНаступлениеСобытия(Источник, Событие, ПараметрыПодписки, ПараметрыСобытия) Экспорт
	
	//СоответствиеОбработчиков = Новый Соответствие();
	//СоответствиеОбработчиков.Вставить("Объект.ПриКопировании"								, Новый Структура("ВидОбъекта, МоментПроверки", "ВсеОбъекты"		, "ПриКопировании"));
	//СоответствиеОбработчиков.Вставить("Объект.ПередЗаписью"								, Новый Структура("ВидОбъекта, МоментПроверки", "ВсеОбъекты"		, "ПередЗаписью"));
	//СоответствиеОбработчиков.Вставить("ДокументОбъект.ПередЗаписью"						, Новый Структура("ВидОбъекта, МоментПроверки", "Документ"			, "ПередЗаписью"));
	//СоответствиеОбработчиков.Вставить("Объект.ПриЗаписи"									, Новый Структура("ВидОбъекта, МоментПроверки", "ВсеОбъекты"		, "ПриЗаписи"));
	//СоответствиеОбработчиков.Вставить("Объект.ПередУдалением"								, Новый Структура("ВидОбъекта, МоментПроверки", "ВсеОбъекты"		, "ПередУдалением"));
	//СоответствиеОбработчиков.Вставить("Объект.ОбработкаЗаполнения"						, Новый Структура("ВидОбъекта, МоментПроверки", "ВсеОбъекты"		, "ОбработкаЗаполнения"));
	//СоответствиеОбработчиков.Вставить("Объект.ОбработкаПроверкиЗаполнения"				, Новый Структура("ВидОбъекта, МоментПроверки", "ВсеОбъекты"		, "ОбработкаПроверкиЗаполнения"));
	//СоответствиеОбработчиков.Вставить("ДокументОбъект.ОбработкаПроведения"				, Новый Структура("ВидОбъекта, МоментПроверки", "Документ"			, "ОбработкаПроведения"));
	//СоответствиеОбработчиков.Вставить("ДокументОбъект.ОбработкаУдаленияПроведения"		, Новый Структура("ВидОбъекта, МоментПроверки", "Документ"			, "ОбработкаУдаленияПроведения"));
	//СоответствиеОбработчиков.Вставить("БизнесПроцессОбъект.ОбработкаИнтерактивнойАктивации"	, Новый Структура("ВидОбъекта, МоментПроверки", "БизнесПроцесс"		, "ОбработкаИнтерактивнойАктивации"));
	//СоответствиеОбработчиков.Вставить("ЗадачаОбъект.ОбработкаИнтерактивнойАктивации"		, Новый Структура("ВидОбъекта, МоментПроверки", "Задача"			, "ОбработкаИнтерактивнойАктивации"));
	//СоответствиеОбработчиков.Вставить("ЗадачаОбъект.ОбработкаПроверкиВыполнения"			, Новый Структура("ВидОбъекта, МоментПроверки", "Задача"			, "ОбработкаПроверкиВыполнения"));
	//СоответствиеОбработчиков.Вставить("ЗадачаОбъект.ПередВыполнением"						, Новый Структура("ВидОбъекта, МоментПроверки", "Задача"			, "ПередВыполнением"));
	//СоответствиеОбработчиков.Вставить("ЗадачаОбъект.ПередИнтерактивнымВыполнением"		, Новый Структура("ВидОбъекта, МоментПроверки", "Задача"			, "ПередИнтерактивнымВыполнением"));
	//СоответствиеОбработчиков.Вставить("Задачам.ПриВыполнении"								, Новый Структура("ВидОбъекта, МоментПроверки", "Задача"			, "ПриВыполнении"));
	//СоответствиеОбработчиков.Вставить("НаборЗаписей.ОбработкаПроверкиЗаполнения"			, Новый Структура("ВидОбъекта, МоментПроверки", "НаборЗаписей"		, "ОбработкаПроверкиЗаполнения"));
	//СоответствиеОбработчиков.Вставить("НаборЗаписей.ПередЗаписью"							, Новый Структура("ВидОбъекта, МоментПроверки", "НаборЗаписей"		, "ПередЗаписью"));
	//СоответствиеОбработчиков.Вставить("НаборЗаписей.ПриЗаписи"							, Новый Структура("ВидОбъекта, МоментПроверки", "НаборЗаписей"		, "ПриЗаписи"));
	//СоответствиеОбработчиков.Вставить("РегистрСведенийНаборЗаписей.ОбработкаЗаполнения"	, Новый Структура("ВидОбъекта, МоментПроверки", "РегистрСведений"	, "ОбработкаЗаполнения"));
	
	МоментПроверки = Неопределено;
	ПараметрыПодписки.Свойство("МоментПроверки", МоментПроверки);
	
	ИдОбъектаМетаданных = Неопределено;
	ПараметрыПодписки.Свойство("ИдОбъектаМетаданных", ИдОбъектаМетаданных);
	
	Если МоментПроверки = "ПередЗаписью" Тогда
		ИзмененныеРеквизиты = ПолучитьИзмененияРеквизитов(Источник, Событие);
		Источник.ДополнительныеСвойства.Вставить("бир_События_ОбъектИзменен", Ложь);
		Если ИзмененныеРеквизиты.Количество() > 0 Тогда
			Источник.ДополнительныеСвойства.бир_События_ОбъектИзменен = Истина;
			Источник.ДополнительныеСвойства.Вставить("бир_События_ИзмененныеРеквизиты", ИзмененныеРеквизиты);
		КонецЕсли;
		Возврат Ложь;
	ИначеЕсли МоментПроверки = "ПриЗаписи" Тогда
		ОбъектИзменен = Ложь;
		ПередатьДляОбработки = Ложь;
		Источник.ДополнительныеСвойства.Свойство("бир_События_ОбъектИзменен", ОбъектИзменен);
		Источник.ДополнительныеСвойства.Свойство("бир_События_ПередатьДляОбработки", ПередатьДляОбработки);
		Если ОбъектИзменен = Истина Тогда
			ПараметрыСобытия.Вставить("ИзмененныеРеквизиты", Источник.ДополнительныеСвойства.бир_События_ИзмененныеРеквизиты);
			Если ПередатьДляОбработки = Истина Тогда
				ПараметрыСобытия.Вставить("ДанныеОбъекта", СериализоватьОбъект(Источник, НастройкаОбработкиОбъекта(Источник, Событие)));
			КонецЕсли;
			
			ИзмененныйОбъект = СокрЛП(Источник.Метаданные());
			Если ПреобразованиеДанных().ЭтоЗначениеСсылочногоТипа(Источник) Тогда
				ИзмененныйОбъект = СокрЛП(Источник.Ссылка);
			КонецЕсли;
				
			ИзмененныеРеквизитыТекст = "отсутствуют";
			
			Для Каждого ТекЭлемент Из ПараметрыСобытия.ИзмененныеРеквизиты Цикл
				ИзмененныеРеквизитыТекст = СтрШаблон("%1%2%3",
				                                     ?(ИзмененныеРеквизитыТекст = "отсутствуют", "", ИзмененныеРеквизитыТекст),
													 ?(ИзмененныеРеквизитыТекст = "отсутствуют", "", ", "),
				                                     ТекЭлемент.Ключ);
			КонецЦикла;
			ПараметрыСобытия.Вставить("РезультатПроверки",
			                          СтрШаблон("Зарегистрировано изменение данных ""%1"" изменены реквизиты ""%2""",
									            ИзмененныйОбъект,
									            ИзмененныеРеквизитыТекст));
		КонецЕсли;
											
		Возврат ОбъектИзменен;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции // ПроверитьНаступлениеСобытия()

#КонецОбласти

#Область СлужебныеПроцедуры

// Функция - Проверяет наличие функциональности дополнительных реквизитов и сведений
//
// Параметры:
//   ИдентификаторОбъекта    - СправочникСсылка.                   - Объект для которого проверяется наличие доолнительных реквизитов
//                             ИдентификаторыОбъектовМетаданных,     если не указан, то возвращается наличие функциональности
//                             СправочникСсылка.                     доп. реквизитов для конфигурации в целом
//                             ИдентификаторыОбъектовРасширений
//																				  
//   ДопРеквизиты            - Массив (ПланВидовХарактеристикСсылка.		- В параметре возвращается массив доп реквизитов
//                             ДополнительныеРеквизитыИСведения)
// 
// Возвращаемое значение:
//   Булево - Истина - Есть функциональностть доп. реквизитов
//
Функция ЕстьДопРеквизиты(ИдентификаторОбъекта = Неопределено, ДопРеквизиты = Неопределено) Экспорт
	
	Если Метаданные.Справочники.Найти("НаборыДополнительныхРеквизитовИСведений") = Неопределено
	 ИЛИ Метаданные.ПланыВидовХарактеристик.Найти("ДополнительныеРеквизитыИСведения") = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
		
	Если ИдентификаторОбъекта = Неопределено Тогда
		Возврат Истина;
	КонецЕсли;
	
	МетаОбъект = Метаданные.НайтиПоПолномуИмени(ИдентификаторОбъекта.ПолноеИмя);
	
	Если МетаОбъект = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	НаборДопРеквизитов = Неопределено;
	Попытка
		НаборДопРеквизитов = Справочники.НаборыДополнительныхРеквизитовИСведений[СтрЗаменить(ИдентификаторОбъекта.ПолноеИмя, ".", "_")]
	Исключение
		Возврат Ложь;
	КонецПопытки;
	
	Если НаборДопРеквизитов = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	МассивНазначений = Новый Массив();
		
	Если НаборДопРеквизитов.ЭтоГруппа Тогда
		Выборка = Справочники.НаборыДополнительныхРеквизитовИСведений.Выбрать(НаборДопРеквизитов);
		
		Пока Выборка.Следующий() Цикл
			Если Выборка.ЭтоГруппа Тогда
				Продолжить;
			КонецЕсли;
			МассивНазначений.Добавить(Выборка.Ссылка);
		КонецЦикла;
	Иначе
		МассивНазначений.Добавить(НаборДопРеквизитов);
	КонецЕсли;
	
	ДопРеквизиты = Новый Массив();
	Для Каждого ТекНазначение Из МассивНазначений Цикл
		
		Для Каждого ТекСтрока Из ТекНазначение.ДополнительныеРеквизиты Цикл
			Если НЕ ДопРеквизиты.Найти(ТекСтрока.Свойство) = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			ДопРеквизиты.Добавить(ТекСтрока.Свойство);
			
		КонецЦикла;
		
	КонецЦикла;
	
	Если МетаОбъект.ТабличныеЧасти.Найти("ДополнительныеРеквизиты") = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;

КонецФункции // ЕстьДопРеквизиты()

// Функция - Получает список измененных реквизитов объекта
//
// Параметры:
//  Источник			 - Объект, НаборЗаписей			 - Объект - источник возникновения события
// 
// Возвращаемое значение:
//  Структура - Список измененных реквизитов объекта
//
Функция ПолучитьИзмененияРеквизитов(Источник, Событие)
	
	Источник.ДополнительныеСвойства.Вставить("бир_События_ПередатьДляОбработки", Ложь);
	
	МетаОбъект = Источник.Метаданные();
	
	ИдентификаторОбъекта = Справочники.ИдентификаторыОбъектовМетаданных.НайтиПоРеквизиту("ПолноеИмя", МетаОбъект.ПолноеИмя());
	Если НЕ ЗначениеЗаполнено(ИдентификаторОбъекта) Тогда
		ИдентификаторОбъекта = Справочники.ИдентификаторыОбъектовРасширений.НайтиПоРеквизиту("ПолноеИмя", МетаОбъект.ПолноеИмя());
	КонецЕсли;
		
	ПараметрыОбъекта = НастройкаОбработкиОбъекта(ИдентификаторОбъекта, Событие);
	
	Источник.ДополнительныеСвойства.бир_События_ПередатьДляОбработки = ПараметрыОбъекта.ПередатьДляОбработки;
	
	ПроверяемыеРеквизиты = ПараметрыОбъекта.ПроверяемыеРеквизиты;
	ИсключаемыеРеквизиты = ПараметрыОбъекта.ИсключаемыеРеквизиты;
	
	СохраненныйДокумент = Источник.Ссылка;
	
	ИзмененныеРеквизиты = Новый Соответствие();
	
	Если НЕ ОбъектСоответствуетОтбору(Источник, ПараметрыОбъекта) Тогда
		Возврат ИзмененныеРеквизиты;
	КонецЕсли;

	Для Каждого ТекРеквизит Из МетаОбъект.СтандартныеРеквизиты Цикл
		Если НЕ ИсключаемыеРеквизиты.Найти(ТекРеквизит.Имя) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Если (НЕ ПроверяемыеРеквизиты.Количество() = 0) И ПроверяемыеРеквизиты.Найти(ТекРеквизит.Имя) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Если Источник[ТекРеквизит.Имя] = СохраненныйДокумент[ТекРеквизит.Имя] Тогда
			Продолжить;
		КонецЕсли;
		
		ИзмененныеРеквизиты.Вставить(ТекРеквизит.Имя, Новый Структура("СтароеЗначение, НовоеЗначение", СокрЛП(СохраненныйДокумент[ТекРеквизит.Имя]), СокрЛП(Источник[ТекРеквизит.Имя])));
		
	КонецЦикла;
	
	Для Каждого ТекРеквизит Из МетаОбъект.Реквизиты Цикл
		Если НЕ ИсключаемыеРеквизиты.Найти(ТекРеквизит.Имя) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Если (НЕ ПроверяемыеРеквизиты.Количество() = 0) И ПроверяемыеРеквизиты.Найти(ТекРеквизит.Имя) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Если Источник[ТекРеквизит.Имя] = СохраненныйДокумент[ТекРеквизит.Имя] Тогда
			Продолжить;
		КонецЕсли;
		
		ИзмененныеРеквизиты.Вставить(ТекРеквизит.Имя, Новый Структура("СтароеЗначение, НовоеЗначение", СокрЛП(СохраненныйДокумент[ТекРеквизит.Имя]), СокрЛП(Источник[ТекРеквизит.Имя])));
		
	КонецЦикла;
	
	ДопРеквизиты = Новый Массив();
	
	ЕстьДопРеквизиты = ЕстьДопРеквизиты(ИдентификаторОбъекта, ДопРеквизиты);
	
	Для Каждого ТекТЧ Из МетаОбъект.ТабличныеЧасти Цикл
		
		Если ЕстьДопРеквизиты И ТекТЧ.Имя = "ДополнительныеРеквизиты" Тогда
			Продолжить;
		КонецЕсли;
		
		Если НЕ ИсключаемыеРеквизиты.Найти(СтрШаблон("__ТЧ.%1", ТекТЧ.Имя)) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		КоличествоСтрок = Макс(СохраненныйДокумент[ТекТЧ.Имя].Количество(), Источник[ТекТЧ.Имя].Количество());
		
		Для й = 0 По КоличествоСтрок - 1 Цикл
			
			Если й + 1 > СохраненныйДокумент[ТекТЧ.Имя].Количество() Тогда
				ИзмененныеРеквизиты.Вставить(СтрШаблон("__ТЧ_%1_%2", ТекТЧ.Имя, Формат(й + 1, "ЧГ=0")),
				                             Новый Структура("СтароеЗначение, НовоеЗначение", "<>", "<строка добавлена>"));
				Продолжить;
			ИначеЕсли й + 1 > Источник[ТекТЧ.Имя].Количество() Тогда
				ИзмененныеРеквизиты.Вставить(СтрШаблон("__ТЧ_%1_%2", ТекТЧ.Имя, Формат(й + 1, "ЧГ=0")),
				                             Новый Структура("СтароеЗначение, НовоеЗначение", "<строка удалена>", "<>"));
				Продолжить;
			КонецЕсли;
					
			Для Каждого ТекРеквизит Из ТекТЧ.Реквизиты Цикл
				
				Если НЕ ИсключаемыеРеквизиты.Найти(ТекТЧ.Имя + "." + ТекРеквизит.Имя) = Неопределено Тогда
					Продолжить;
				КонецЕсли;
		
				Если (НЕ ПроверяемыеРеквизиты.Количество() = 0)
				   И ПроверяемыеРеквизиты.Найти(СтрШаблон("__ТЧ.%1", ТекТЧ.Имя)) = Неопределено
				   И ПроверяемыеРеквизиты.Найти(СтрШаблон("%1.%2", ТекТЧ.Имя, ТекРеквизит.Имя)) = Неопределено Тогда
					Продолжить;
				КонецЕсли;
		
				Если Источник[ТекТЧ.Имя][й][ТекРеквизит.Имя] = СохраненныйДокумент[ТекТЧ.Имя][й][ТекРеквизит.Имя] Тогда
					Продолжить;
				КонецЕсли;
				
				ИзмененныеРеквизиты.Вставить(СтрШаблон("__ТЧ_%1_%2_%3", ТекТЧ.Имя, Формат(й + 1, "ЧГ=0"), ТекРеквизит.Имя),
				                                       Новый Структура("СтароеЗначение, НовоеЗначение",
													                   СокрЛП(СохраненныйДокумент[ТекТЧ.Имя][й][ТекРеквизит.Имя]),
																	   СокрЛП(Источник[ТекТЧ.Имя][й][ТекРеквизит.Имя])));
				
			КонецЦикла;
		КонецЦикла;
		
	КонецЦикла;
	
	Для Каждого ТекРеквизит Из ДопРеквизиты Цикл
		Если НЕ ИсключаемыеРеквизиты.Найти(СокрЛП(ТекРеквизит.УникальныйИдентификатор())) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Если (НЕ ПроверяемыеРеквизиты.Количество() = 0) И ПроверяемыеРеквизиты.Найти(СокрЛП(ТекРеквизит.УникальныйИдентификатор())) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		СтароеЗначение = Неопределено;
		НовоеЗначение = Неопределено;
		
		СтрокиЗначений = СохраненныйДокумент.ДополнительныеРеквизиты.НайтиСтроки(Новый Структура("Свойство", ТекРеквизит));
		Если СтрокиЗначений.Количество() > 0 Тогда
			СтароеЗначение = СтрокиЗначений[0].Значение;
		КонецЕсли;
		
		СтрокиЗначений = Источник.ДополнительныеРеквизиты.НайтиСтроки(Новый Структура("Свойство", ТекРеквизит));
		Если СтрокиЗначений.Количество() > 0 Тогда
			НовоеЗначение = СтрокиЗначений[0].Значение;
		КонецЕсли;
		
		Если НовоеЗначение = СтароеЗначение Тогда
			Продолжить;
		КонецЕсли;
		
		ИзмененныеРеквизиты.Вставить(ТекРеквизит, Новый Структура("СтароеЗначение, НовоеЗначение", СокрЛП(СтароеЗначение), СокрЛП(НовоеЗначение)));
		
	КонецЦикла;
	
	Возврат ИзмененныеРеквизиты;
	
КонецФункции // ПолучитьИзмененияРеквизитов()

Функция ОбъектСоответствуетОтбору(Источник, ПараметрыОбъекта)
	
	Если НЕ (ПараметрыОбъекта.Свойство("НастройкиКомпоновки")
	   И ТипЗнч(ПараметрыОбъекта.НастройкиКомпоновки) = Тип("Структура")) Тогда
		Возврат Истина;
	КонецЕсли;
	
	МетаОбъект = Источник.Метаданные();

	ПоляОтбора = Новый Массив();
	
	Для Каждого ТекРеквизит Из МетаОбъект.Реквизиты Цикл
		ПоляОтбора.Добавить(СтрШаблон("Данные.%1.*", ТекРеквизит.Имя));	
	КонецЦикла;
	
	ТекстЗапроса = "ВЫБРАТЬ
	               |	Данные.Ссылка КАК Ссылка
	               |ИЗ
	               |	&ТаблицаОбъекта КАК Данные
				   |ГДЕ
				   |	Данные.Ссылка = &Ссылка
	               |{ГДЕ
	               |	&ПоляОтбора}";
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТаблицаОбъекта", МетаОбъект.ПолноеИмя());
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПоляОтбора", СтрСоединить(ПоляОтбора, ","));
	
	СпрЗапрос = Справочники.бир_ЗапросыКДанным.СоздатьЭлемент();
	СпрЗапрос.Ид = "Данные";
	СпрЗапрос.УстановитьТекстЗапроса(ТекстЗапроса);
	
	УстановитьПривилегированныйРежим(Истина);
	
	СКД = СпрЗапрос.СхемаКомпоновкиДанных();
	АдресСКД = ПоместитьВоВременноеХранилище(СКД);
	
	КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных();
	КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСКД));

	НастройкиКомпоновки = Новый НастройкиКомпоновкиДанных();
	ПреобразованиеДанных().НастройкиСКДИзСтруктуры(НастройкиКомпоновки, ПараметрыОбъекта.НастройкиКомпоновки);
	КомпоновщикНастроек.ЗагрузитьНастройки(НастройкиКомпоновки);
	НастройкиКомпоновки = КомпоновщикНастроек.ПолучитьНастройки();
	НастройкиКомпоновки.ПараметрыДанных.УстановитьЗначениеПараметра("Ссылка", Источник.Ссылка);

	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СКД,
	                                              НастройкиКомпоновки,
	                                              ,
	                                              ,
	                                              Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки);
	
	РезультатОтбора = Новый ТаблицаЗначений();
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений();
	ПроцессорВывода.УстановитьОбъект(РезультатОтбора);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);

	Если РезультатОтбора.Количество() = 0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции // ОбъектСоответствуетОтбору()

Функция НастройкаОбработкиОбъекта(Знач ИдентификаторОбъекта, Знач Событие)
	
	Настройка = Новый Структура();
	Настройка.Вставить("ПередатьДляОбработки", Ложь);
	Настройка.Вставить("ПроверяемыеРеквизиты", Новый Массив());
	Настройка.Вставить("ИсключаемыеРеквизиты", Новый Массив());
	Настройка.Вставить("НастройкиКомпоновки", Неопределено);
	Настройка.Вставить("СохраняемыеРеквизиты", Новый Массив());
	Настройка.Вставить("НеСохраняемыеРеквизиты", Новый Массив());
	
	СохраненнаяНастройка = Событие.ОбработкаНастройки.Получить();
	
	НастройкиРеквизитов = Новый Соответствие();
	Если СохраненнаяНастройка.Свойство("РеквизитыОбъектов") Тогда
		НастройкиРеквизитов = СохраненнаяНастройка.РеквизитыОбъектов;
	КонецЕсли;
	
	Если НЕ (ТипЗнч(ИдентификаторОбъекта) = Тип("СправочникСсылка.ИдентификаторыОбъектовМетаданных")
	     ИЛИ ТипЗнч(ИдентификаторОбъекта) = Тип("СправочникСсылка.ИдентификаторыОбъектовРасширений")) Тогда
		МетаОбъект = ИдентификаторОбъекта.Метаданные();
		ИдентификаторОбъекта = Справочники.ИдентификаторыОбъектовМетаданных.НайтиПоРеквизиту("ПолноеИмя", МетаОбъект.ПолноеИмя());
		Если НЕ ЗначениеЗаполнено(ИдентификаторОбъекта) Тогда
			ИдентификаторОбъекта = Справочники.ИдентификаторыОбъектовРасширений.НайтиПоРеквизиту("ПолноеИмя", МетаОбъект.ПолноеИмя());
		КонецЕсли;
	КонецЕсли;
	
	Если ТипЗнч(НастройкиРеквизитов) = Тип("Соответствие") Тогда
		
		ПараметрыОбъекта = НастройкиРеквизитов[ИдентификаторОбъекта];
		ЗаполнитьЗначенияСвойств(Настройка, ПараметрыОбъекта);
		
	КонецЕсли;
	
	Возврат Настройка;
	
КонецФункции // НастройкаОбработкиОбъекта()

// Функция - Получает объект, серриализованный в XML
//
// Параметры:
//  Источник			 - Объект, НаборЗаписей			 - Объект - источник возникновения события
// 
// Возвращаемое значение:
//  Строка - Объект, серриализованный в XML
//
Функция СериализоватьОбъект(Источник, НастройкаОбработкиОбъекта)
	
	Если НЕ Источник.ДополнительныеСвойства.Свойство("бир_События_ПередатьДляОбработки") Тогда
		Возврат "";
	КонецЕсли;
	
	Если НЕ Источник.ДополнительныеСвойства.бир_События_ПередатьДляОбработки = Истина Тогда
		Возврат "";
	КонецЕсли;
	
	ДанныеОбъекта = ПреобразованиеДанных().ОбъектВСтруктуру(Источник,
	                                                        НастройкаОбработкиОбъекта.СохраняемыеРеквизиты,
														    НастройкаОбработкиОбъекта.НеСохраняемыеРеквизиты);
	
	Возврат ДанныеОбъекта;
	
КонецФункции // СериализоватьОбъект()

Функция ПреобразованиеДанных()
	
	Если ПреобразованиеДанных = Неопределено Тогда 
		ПреобразованиеДанных = Обработки.бир_ПреобразованиеДанных.Создать();
	КонецЕсли;
	
	Возврат ПреобразованиеДанных;
	
КонецФункции // ПреобразованиеДанных()

#КонецОбласти // СлужебныеПроцедуры
