
Перем ПреобразованиеДанных;

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ОбработкаНастройкиАдресВХранилище") Тогда
		ОбработкаНастройкиАдресВХранилище = Параметры.ОбработкаНастройкиАдресВХранилище;
	
		Настройки = ПолучитьИзВременногоХранилища(ОбработкаНастройкиАдресВХранилище);
	
		Если ТипЗнч(Настройки) = Тип("Структура") Тогда
			НастройкиРеквизитов = Новый Соответствие();
			Если Настройки.Свойство("РеквизитыОбъектов") Тогда
				НастройкиРеквизитов = Настройки.РеквизитыОбъектов;
			КонецЕсли;
						
			Если НЕ ТипЗнч(НастройкиРеквизитов) = Тип("Соответствие") Тогда
				НастройкиРеквизитов = Новый Соответствие();
			КонецЕсли;
			
			Для Каждого ТекОбъект Из НастройкиРеквизитов Цикл
				
				НоваяСтрока = РеквизитыОбъектов.Добавить();
				НоваяСтрока.ТипОбъекта                    = ТекОбъект.Ключ;
				НоваяСтрока.ПроверяемыеТолькоОтмеченные   = Ложь;
				НоваяСтрока.ИсключаемыеТолькоОтмеченные   = Ложь;
				НоваяСтрока.СохраняемыеТолькоОтмеченные   = Ложь;
				НоваяСтрока.НеСохраняемыеТолькоОтмеченные = Ложь;
				НоваяСтрока.ПередатьДляОбработки          = Ложь;
				
				Если ТекОбъект.Значение.Свойство("ПередатьДляОбработки") Тогда
					НоваяСтрока.ПередатьДляОбработки = ТекОбъект.Значение.ПередатьДляОбработки;
				КонецЕсли;
				
				Если ТекОбъект.Значение.Свойство("НастройкиКомпоновки") Тогда
					НоваяСтрока.НастройкиКомпоновки = ТекОбъект.Значение.НастройкиКомпоновки;
				КонецЕсли;

				СписокРеквизитовБазовый = ПолучитьСписокРеквизитовНаСервере(ТекОбъект.Ключ);
				СписокРеквизитовБазовый = ДополнитьСписокРеквизитовТабличнымиЧастямиНаСервере(ТекОбъект.Ключ, СписокРеквизитовБазовый);
			    СписокРеквизитов = ДополнитьСписокРеквизитовДопРеквизитамиНаСервере(ТекОбъект.Ключ, СписокРеквизитовБазовый);
				
				Для Каждого ТекЭлемент Из СписокРеквизитов Цикл
					Пометка = Ложь;
					Если ТекОбъект.Значение.Свойство("ПроверяемыеРеквизиты") Тогда
						Пометка = НЕ ТекОбъект.Значение.ПроверяемыеРеквизиты.Найти(ТекЭлемент.Значение) = Неопределено;
					КонецЕсли;
					НоваяСтрока.ПроверяемыеРеквизиты.Добавить(ТекЭлемент.Значение, ТекЭлемент.Представление, Пометка);
					НоваяСтрока.ПроверяемыеТолькоОтмеченные = ?(НЕ НоваяСтрока.ПроверяемыеТолькоОтмеченные, Пометка, Истина);
					Пометка = Ложь;
					Если ТекОбъект.Значение.Свойство("ИсключаемыеРеквизиты") Тогда
						Пометка = НЕ ТекОбъект.Значение.ИсключаемыеРеквизиты.Найти(ТекЭлемент.Значение) = Неопределено;
					КонецЕсли;
					НоваяСтрока.ИсключаемыеРеквизиты.Добавить(ТекЭлемент.Значение, ТекЭлемент.Представление, Пометка);
					НоваяСтрока.ИсключаемыеТолькоОтмеченные = ?(НЕ НоваяСтрока.ИсключаемыеТолькоОтмеченные, Пометка, Истина);
				КонецЦикла;

				СписокРеквизитов = ДополнитьСписокРеквизитовДвижениямиНаСервере(ТекОбъект.Ключ, СписокРеквизитовБазовый);
				
				Для Каждого ТекЭлемент Из СписокРеквизитов Цикл
					Пометка = Ложь;
					Если ТекОбъект.Значение.Свойство("СохраняемыеРеквизиты") Тогда
						Пометка = НЕ ТекОбъект.Значение.СохраняемыеРеквизиты.Найти(ТекЭлемент.Значение) = Неопределено;
					КонецЕсли;
					НоваяСтрока.СохраняемыеРеквизиты.Добавить(ТекЭлемент.Значение, ТекЭлемент.Представление, Пометка);
					НоваяСтрока.СохраняемыеТолькоОтмеченные = ?(НЕ НоваяСтрока.СохраняемыеТолькоОтмеченные, Пометка, Истина);
					Пометка = Ложь;
					Если ТекОбъект.Значение.Свойство("НеСохраняемыеРеквизиты") Тогда
						Пометка = НЕ ТекОбъект.Значение.НеСохраняемыеРеквизиты.Найти(ТекЭлемент.Значение) = Неопределено;
					КонецЕсли;
					НоваяСтрока.НеСохраняемыеРеквизиты.Добавить(ТекЭлемент.Значение, ТекЭлемент.Представление, Пометка);
					НоваяСтрока.НеСохраняемыеТолькоОтмеченные = ?(НЕ НоваяСтрока.НеСохраняемыеТолькоОтмеченные, Пометка, Истина);
				КонецЦикла;
			КонецЦикла;
			
			ОбъектыДляОбработки = Новый Соответствие();
			Если Настройки.Свойство("ОбъектыДляОбработки") Тогда
				ОбъектыДляОбработки = Настройки.ОбъектыДляОбработки;
			КонецЕсли;
						
			Если НЕ ТипЗнч(ОбъектыДляОбработки) = Тип("Соответствие") Тогда
				ОбъектыДляОбработки = Новый Соответствие();
			КонецЕсли;
			
			Для Каждого ТекСтрока Из РеквизитыОбъектов Цикл
				Если ОбъектыДляОбработки[ТекСтрока.ТипОбъекта] = Неопределено Тогда
					Продолжить;
				КонецЕсли;
				ТекСтрока.ПередатьДляОбработки = Истина;
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийФормы

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура РеквизитыОбъектовПриАктивизацииСтроки(Элемент)
	
	ПодключитьОбработчикОжидания("ЗаполнитьРеквизитыОбъекта", 0.3, Истина);
	
КонецПроцедуры // РеквизитыОбъектовПриАктивизацииСтроки()

&НаКлиенте
Процедура РеквизитыОбъектовТипОбъектаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.РеквизитыОбъектов.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные.ПроверяемыеРеквизиты.Очистить();
	ТекущиеДанные.ИсключаемыеРеквизиты.Очистить();
	ТекущиеДанные.СохраняемыеРеквизиты.Очистить();
	ТекущиеДанные.НеСохраняемыеРеквизиты.Очистить();
		
	СписокРеквизитовБазовый = ПолучитьСписокРеквизитовНаСервере(ТекущиеДанные.ТипОбъекта);
	СписокРеквизитовБазовый = ДополнитьСписокРеквизитовТабличнымиЧастямиНаСервере(ТекущиеДанные.ТипОбъекта, СписокРеквизитовБазовый);
	СписокРеквизитов = ДополнитьСписокРеквизитовДопРеквизитамиНаСервере(ТекущиеДанные.ТипОбъекта, СписокРеквизитовБазовый);
	
	Для Каждого ТекЭлемент Из СписокРеквизитов Цикл
		ТекущиеДанные.ПроверяемыеРеквизиты.Добавить(ТекЭлемент.Значение, ТекЭлемент.Представление);
		ТекущиеДанные.ИсключаемыеРеквизиты.Добавить(ТекЭлемент.Значение, ТекЭлемент.Представление);
	КонецЦикла;
	
    СписокРеквизитов = ДополнитьСписокРеквизитовДвижениямиНаСервере(ТекущиеДанные.ТипОбъекта, СписокРеквизитовБазовый);
	
	Для Каждого ТекЭлемент Из СписокРеквизитов Цикл
		ТекущиеДанные.СохраняемыеРеквизиты.Добавить(ТекЭлемент.Значение, ТекЭлемент.Представление);
		ТекущиеДанные.НеСохраняемыеРеквизиты.Добавить(ТекЭлемент.Значение, ТекЭлемент.Представление);
	КонецЦикла;

	ЗаполнитьРеквизитыОбъекта();
	
КонецПроцедуры // РеквизитыОбъектовТипОбъектаПриИзменении()

&НаКлиенте
Процедура РеквизитыПометкаПриИзменении(Элемент)
	
	ТекущиеДанныеОбъект = Элементы.РеквизитыОбъектов.ТекущиеДанные;
	
	Если ТекущиеДанныеОбъект = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанныеРеквизит = Элемент.Родитель.ТекущиеДанные;
	
	Если ТекущиеДанныеРеквизит = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекЭлемент = ТекущиеДанныеОбъект[Элемент.Родитель.Имя].НайтиПоЗначению(ТекущиеДанныеРеквизит.Значение); 
	
	ТекЭлемент.Пометка = ТекущиеДанныеРеквизит.Пометка;
	
КонецПроцедуры // РеквизитыПометкаПриИзменении()

&НаКлиенте
Процедура КомпоновщикНастроекНастройкиОтборПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)

	СохранитьНастройкиКомпоновки();

КонецПроцедуры // КомпоновщикНастроекНастройкиОтборПриОкончанииРедактирования()

&НаКлиенте
Процедура КомпоновщикНастроекНастройкиОтборПослеУдаления(Элемент)

	СохранитьНастройкиКомпоновки();

КонецПроцедуры // КомпоновщикНастроекНастройкиОтборПослеУдаления()

#КонецОбласти // ОбработчикиСобытийЭлементовФормы

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СохранитьНастройку(Команда)
	
	СохранитьНастройкуНаСервере();
	
	Оповестить("ИзмененыНастройки", ЭтаФорма.ВладелецФормы, ЭтаФорма);
	
	Закрыть("ИзмененыНастройки");
	
КонецПроцедуры // СохранитьНастройку()

&НаСервере
Процедура СохранитьНастройкуНаСервере()
	
	Настройка = Новый Структура();
	
	НастройкиРеквизитов = Новый Соответствие();
	ОбъектыДляОбработки = Новый Соответствие();
	Для Каждого ТекСтрока Из РеквизитыОбъектов Цикл
		НовыйОбъект = Новый Структура("ПередатьДляОбработки,
									  |ПроверяемыеРеквизиты,
									  |ИсключаемыеРеквизиты,
									  |НастройкиКомпоновки,
									  |СохраняемыеРеквизиты,
									  |НеСохраняемыеРеквизиты",
									  Ложь,
									  Новый Массив(),
									  Новый Массив(),
									  Неопределено,
									  Новый Массив(),
									  Новый Массив());
		
		Для Каждого ТекЭлемент Из ТекСтрока.ПроверяемыеРеквизиты Цикл
			Если ТекЭлемент.Пометка Тогда
				НовыйОбъект.ПроверяемыеРеквизиты.Добавить(ТекЭлемент.Значение);
			КонецЕсли;
		КонецЦикла;
		Для Каждого ТекЭлемент Из ТекСтрока.ИсключаемыеРеквизиты Цикл
			Если ТекЭлемент.Пометка Тогда
				НовыйОбъект.ИсключаемыеРеквизиты.Добавить(ТекЭлемент.Значение);
			КонецЕсли;
		КонецЦикла;
		НовыйОбъект.НастройкиКомпоновки = ТекСтрока.НастройкиКомпоновки;
		
		Для Каждого ТекЭлемент Из ТекСтрока.СохраняемыеРеквизиты Цикл
			Если ТекЭлемент.Пометка Тогда
				НовыйОбъект.СохраняемыеРеквизиты.Добавить(ТекЭлемент.Значение);
			КонецЕсли;
		КонецЦикла;
		Для Каждого ТекЭлемент Из ТекСтрока.НеСохраняемыеРеквизиты Цикл
			Если ТекЭлемент.Пометка Тогда
				НовыйОбъект.НеСохраняемыеРеквизиты.Добавить(ТекЭлемент.Значение);
			КонецЕсли;
		КонецЦикла;
		
		НастройкиРеквизитов.Вставить(ТекСтрока.ТипОбъекта, НовыйОбъект);
		
		Если ТекСтрока.ПередатьДляОбработки Тогда
			НовыйОбъект.ПередатьДляОбработки = Истина;
		КонецЕсли;
		
	КонецЦикла;
	
	Настройка.Вставить("РеквизитыОбъектов", НастройкиРеквизитов);
	
	ПоместитьВоВременноеХранилище(Настройка, ОбработкаНастройкиАдресВХранилище);
	
КонецПроцедуры // СохранитьНастройкуНаСервере()

&НаКлиенте
Процедура ИсключаемыеПоказывать(Команда)
	
	ТекущиеДанные = Элементы.РеквизитыОбъектов.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.ИсключаемыеРеквизитыПоказывать.Пометка = НЕ Элементы.ИсключаемыеРеквизитыПоказывать.Пометка;
	
	ТекущиеДанные.ИсключаемыеТолькоОтмеченные = Элементы.ИсключаемыеРеквизитыПоказывать.Пометка;
	
	ЗаполнитьРеквизитыОбъекта();
	
КонецПроцедуры // ИсключаемыеПоказывать()

&НаКлиенте
Процедура ПроверяемыеПоказывать(Команда)
	
	ТекущиеДанные = Элементы.РеквизитыОбъектов.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.ПроверяемыеРеквизитыПоказывать.Пометка = НЕ Элементы.ПроверяемыеРеквизитыПоказывать.Пометка;
	
	ТекущиеДанные.ПроверяемыеТолькоОтмеченные = Элементы.ПроверяемыеРеквизитыПоказывать.Пометка;
	
	ЗаполнитьРеквизитыОбъекта();
	
КонецПроцедуры // ПроверяемыеПоказывать()

&НаКлиенте
Процедура СохраняемыеПоказывать(Команда)
	
	ТекущиеДанные = Элементы.РеквизитыОбъектов.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.СохраняемыеРеквизитыПоказывать.Пометка = НЕ Элементы.СохраняемыеРеквизитыПоказывать.Пометка;
	
	ТекущиеДанные.СохраняемыеТолькоОтмеченные = Элементы.СохраняемыеРеквизитыПоказывать.Пометка;
	
	ЗаполнитьРеквизитыОбъекта();
	
КонецПроцедуры // СохраняемыеПоказывать()

&НаКлиенте
Процедура НеСохраняемыеПоказывать(Команда)
	
	ТекущиеДанные = Элементы.РеквизитыОбъектов.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.НеСохраняемыеРеквизитыПоказывать.Пометка = НЕ Элементы.НеСохраняемыеРеквизитыПоказывать.Пометка;
	
	ТекущиеДанные.НеСохраняемыеТолькоОтмеченные = Элементы.НеСохраняемыеРеквизитыПоказывать.Пометка;
	
	ЗаполнитьРеквизитыОбъекта();
	
КонецПроцедуры // НеСохраняемыеПоказывать()

#КонецОбласти // ОбработчикиКомандФормы

#Область СлужебныеПроцедуры

// Функция - Получает список реквизитов указанного объекта
// 
// Возвращаемое значение:
//   СписокЗначений - Список реквизитов указанного объекта
//
&НаСервере
Функция ПолучитьСписокРеквизитовНаСервере(ИдентификаторОбъекта)
	
	СписокРеквизитов = Новый СписокЗначений();
	
	МетаОбъект = Метаданные.НайтиПоПолномуИмени(ИдентификаторОбъекта.ПолноеИмя);
	
	Если МетаОбъект = Неопределено Тогда
		Возврат СписокРеквизитов;
	КонецЕсли;

	Для Каждого ТекРеквизит Из МетаОбъект.СтандартныеРеквизиты Цикл
		СписокРеквизитов.Добавить(ТекРеквизит.Имя, ТекРеквизит.Представление());
	КонецЦикла;
	
	Для Каждого ТекРеквизит Из МетаОбъект.Реквизиты Цикл
		СписокРеквизитов.Добавить(ТекРеквизит.Имя, ТекРеквизит.Представление());
	КонецЦикла;
	
	СписокРеквизитов.СортироватьПоПредставлению();
	
	Возврат СписокРеквизитов;
	
КонецФункции // ПолучитьСписокРеквизитовНаСервере()

// Функция - Дополняет список реквизитов указанного объекта реквизитами табличных частей
// 
// Возвращаемое значение:
//   СписокЗначений - Список реквизитов объекта, дополненный реквизитами табличных частей
//
&НаСервере
Функция ДополнитьСписокРеквизитовТабличнымиЧастямиНаСервере(ИдентификаторОбъекта, Знач СписокРеквизитов = Неопределено)
	
	ДобавляемыеРеквизиты = Новый СписокЗначений();
	
	МетаОбъект = Метаданные.НайтиПоПолномуИмени(ИдентификаторОбъекта.ПолноеИмя);
	
	Если МетаОбъект = Неопределено Тогда
		Возврат ДобавляемыеРеквизиты;
	КонецЕсли;

	ДопРеквизиты = Неопределено;
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ЕстьДопРеквизиты = ОбработкаОбъект.ЕстьДопРеквизиты(ИдентификаторОбъекта, ДопРеквизиты);
	
	Для Каждого ТекТЧ Из МетаОбъект.ТабличныеЧасти Цикл
		
		Если ЕстьДопРеквизиты И ТекТч.Имя = "ДополнительныеРеквизиты" Тогда
			Продолжить;
		КонецЕсли;
			
		ДобавляемыеРеквизиты.Добавить(СтрШаблон("__ТЧ.%1", ТекТЧ.Имя),
		                              СтрШаблон("ТЧ: %1", ТекТЧ.Представление()));
		
		Для Каждого ТекРеквизит Из ТекТЧ.Реквизиты Цикл
			ДобавляемыеРеквизиты.Добавить(СтрШаблон("%1.%2", ТекТЧ.Имя, ТекРеквизит.Имя),
			                              СтрШаблон("%1: %2", ТекТЧ.Представление(), ТекРеквизит.Представление()));
		КонецЦикла;
		
	КонецЦикла;
	
	ДобавляемыеРеквизиты.СортироватьПоПредставлению();
	
	НовыйСписокРеквизитов = Новый СписокЗначений();
	Если ТипЗнч(СписокРеквизитов) = Тип("СписокЗначений") Тогда
		Для Каждого ТекЭлемент Из СписокРеквизитов Цикл
			НовыйСписокРеквизитов.Добавить(ТекЭлемент.Значение, ТекЭлемент.Представление);
		КонецЦикла;
	КонецЕсли;
	Для Каждого ТекЭлемент Из ДобавляемыеРеквизиты Цикл
		НовыйСписокРеквизитов.Добавить(ТекЭлемент.Значение, ТекЭлемент.Представление);
	КонецЦикла;
	
	Возврат НовыйСписокРеквизитов;
	
КонецФункции // ДополнитьСписокРеквизитовТабличнымиЧастямиНаСервере()

// Функция - Дополняет список реквизитов указанного объекта дополнительными реквизитами, если они используются
// 
// Возвращаемое значение:
//   СписокЗначений - Список реквизитов объекта, дополненный доп. реквизитами
//
&НаСервере
Функция ДополнитьСписокРеквизитовДопРеквизитамиНаСервере(ИдентификаторОбъекта, Знач СписокРеквизитов = Неопределено)
	
	ДобавляемыеРеквизиты = Новый СписокЗначений();
	
	МетаОбъект = Метаданные.НайтиПоПолномуИмени(ИдентификаторОбъекта.ПолноеИмя);
	
	Если МетаОбъект = Неопределено Тогда
		Возврат ДобавляемыеРеквизиты;
	КонецЕсли;

	ДопРеквизиты = Неопределено;
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ЕстьДопРеквизиты = ОбработкаОбъект.ЕстьДопРеквизиты(ИдентификаторОбъекта, ДопРеквизиты);
	
	Если ЕстьДопРеквизиты И ТипЗнч(ДопРеквизиты) = Тип("Массив") Тогда
		
		Для Каждого ТекРеквизит Из ДопРеквизиты Цикл
			Если НЕ ДобавляемыеРеквизиты.НайтиПоЗначению(ТекРеквизит) = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			ДобавляемыеРеквизиты.Добавить(СокрЛП(ТекРеквизит.УникальныйИдентификатор()),
			                              СтрШаблон("Доп.: %1", СокрЛП(ТекРеквизит)));
		КонецЦикла;
		
	КонецЕсли;
	
	ДобавляемыеРеквизиты.СортироватьПоПредставлению();
	
	НовыйСписокРеквизитов = Новый СписокЗначений();
	Если ТипЗнч(СписокРеквизитов) = Тип("СписокЗначений") Тогда
		Для Каждого ТекЭлемент Из СписокРеквизитов Цикл
			НовыйСписокРеквизитов.Добавить(ТекЭлемент.Значение, ТекЭлемент.Представление);
		КонецЦикла;
	КонецЕсли;
	Для Каждого ТекЭлемент Из ДобавляемыеРеквизиты Цикл
		НовыйСписокРеквизитов.Добавить(ТекЭлемент.Значение, ТекЭлемент.Представление);
	КонецЦикла;
	
	Возврат НовыйСписокРеквизитов;
	
КонецФункции // ДополнитьСписокРеквизитовДопРеквизитамиНаСервере()

// Функция - Дополняет список реквизитов указанного документа именами регистров по которым документ проводится
// 
// Возвращаемое значение:
//   СписокЗначений - Список реквизитов указанного документа, дополненный именами регистров
//
&НаСервере
Функция ДополнитьСписокРеквизитовДвижениямиНаСервере(ИдентификаторОбъекта, Знач СписокРеквизитов = Неопределено)
	
	ДобавляемыеРеквизиты = Новый СписокЗначений();
	
	МетаОбъект = Метаданные.НайтиПоПолномуИмени(ИдентификаторОбъекта.ПолноеИмя);
	
	Если МетаОбъект = Неопределено Тогда
		Возврат ДобавляемыеРеквизиты;
	КонецЕсли;
	
	ДобавляемыеРеквизиты.Добавить("Движения", "Движения");
	
	Для Каждого ТекРегистр Из МетаОбъект.Движения Цикл
		
		ДобавляемыеРеквизиты.Добавить(СтрШаблон("Движения.%1", ТекРегистр.Имя),
		                              СтрШаблон("Движения: %1", ТекРегистр.Представление()));
		
	КонецЦикла;
	
	ДобавляемыеРеквизиты.СортироватьПоПредставлению();
	
	НовыйСписокРеквизитов = Новый СписокЗначений();
	Если ТипЗнч(СписокРеквизитов) = Тип("СписокЗначений") Тогда
		Для Каждого ТекЭлемент Из СписокРеквизитов Цикл
			НовыйСписокРеквизитов.Добавить(ТекЭлемент.Значение, ТекЭлемент.Представление);
		КонецЦикла;
	КонецЕсли;
	Для Каждого ТекЭлемент Из ДобавляемыеРеквизиты Цикл
		НовыйСписокРеквизитов.Добавить(ТекЭлемент.Значение, ТекЭлемент.Представление);
	КонецЦикла;
	
	Возврат НовыйСписокРеквизитов;
	
КонецФункции // ДополнитьСписокРеквизитовДвижениямиНаСервере()

&НаКлиенте
Процедура ЗаполнитьРеквизитыОбъекта()
	
	ПроверяемыеРеквизиты.Очистить();
	ИсключаемыеРеквизиты.Очистить();
	СохраняемыеРеквизиты.Очистить();
	НеСохраняемыеРеквизиты.Очистить();
	
	ТекущиеДанные = Элементы.РеквизитыОбъектов.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.ПроверяемыеРеквизитыПоказывать.Пометка = ТекущиеДанные.ПроверяемыеТолькоОтмеченные;
	Элементы.ИсключаемыеРеквизитыПоказывать.Пометка = ТекущиеДанные.ИсключаемыеТолькоОтмеченные;
	Элементы.СохраняемыеРеквизитыПоказывать.Пометка = ТекущиеДанные.СохраняемыеТолькоОтмеченные;
	Элементы.НеСохраняемыеРеквизитыПоказывать.Пометка = ТекущиеДанные.НеСохраняемыеТолькоОтмеченные;
	
	Для Каждого ТекРеквизит Из ТекущиеДанные.ПроверяемыеРеквизиты Цикл
		Если Элементы.ПроверяемыеРеквизитыПоказывать.Пометка И НЕ ТекРеквизит.Пометка Тогда
			Продолжить;
		КонецЕсли;
		
		ПроверяемыеРеквизиты.Добавить(ТекРеквизит.Значение, ТекРеквизит.Представление, ТекРеквизит.Пометка);
	КонецЦикла;
	
	Для Каждого ТекРеквизит Из ТекущиеДанные.ИсключаемыеРеквизиты Цикл
		Если Элементы.ИсключаемыеРеквизитыПоказывать.Пометка И НЕ ТекРеквизит.Пометка Тогда
			Продолжить;
		КонецЕсли;
		
		ИсключаемыеРеквизиты.Добавить(ТекРеквизит.Значение, ТекРеквизит.Представление, ТекРеквизит.Пометка);
	КонецЦикла;
	
	ПрочитатьНастройкиКомпоновки(ТекущиеДанные.ТипОбъекта, ТекущиеДанные.НастройкиКомпоновки);
	
	Для Каждого ТекРеквизит Из ТекущиеДанные.СохраняемыеРеквизиты Цикл
		Если Элементы.СохраняемыеРеквизитыПоказывать.Пометка И НЕ ТекРеквизит.Пометка Тогда
			Продолжить;
		КонецЕсли;
		
		СохраняемыеРеквизиты.Добавить(ТекРеквизит.Значение, ТекРеквизит.Представление, ТекРеквизит.Пометка);
	КонецЦикла;
	
	Для Каждого ТекРеквизит Из ТекущиеДанные.НеСохраняемыеРеквизиты Цикл
		Если Элементы.НеСохраняемыеРеквизитыПоказывать.Пометка И НЕ ТекРеквизит.Пометка Тогда
			Продолжить;
		КонецЕсли;
		
		НеСохраняемыеРеквизиты.Добавить(ТекРеквизит.Значение, ТекРеквизит.Представление, ТекРеквизит.Пометка);
	КонецЦикла;
	
КонецПроцедуры // ЗаполнитьРеквизитыОбъекта()

&НаСервереБезКонтекста
Функция ТипЗначенияРеквизита(ИдентификаторОбъекта, Реквизит)
	
	МетаОбъект = Метаданные.НайтиПоПолномуИмени(ИдентификаторОбъекта.ПолноеИмя);
	
	Если МетаОбъект = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;

	Попытка
		МетаРеквизит = МетаОбъект.Реквизиты.Найти(Реквизит);
	Исключение
		Возврат Неопределено;
	КонецПопытки;
	
	Если МетаРеквизит = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;

	Возврат МетаРеквизит.Тип;
	
КонецФункции // ТипЗначенияРеквизита()

&НаСервере
Процедура ПрочитатьНастройкиКомпоновки(ИдентификаторОбъекта, Знач СтруктураНастроек = Неопределено)
	
	Если Не ЗначениеЗаполнено(ИдентификаторОбъекта) Тогда
		Возврат;
	КонецЕсли;
	
	МетаОбъект = Метаданные.НайтиПоПолномуИмени(ИдентификаторОбъекта.ПолноеИмя);

	ПоляОтбора = Новый Массив();
	
	Для Каждого ТекРеквизит Из МетаОбъект.Реквизиты Цикл
		ПоляОтбора.Добавить(СтрШаблон("Данные.%1.*", ТекРеквизит.Имя));	
	КонецЦикла;
	
	ТекстЗапроса = "ВЫБРАТЬ
	               |	Данные.Ссылка КАК Ссылка
	               |ИЗ
	               |	&ТаблицаОбъекта КАК Данные
	               |{ГДЕ
	               |	&ПоляОтбора}";
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТаблицаОбъекта", ИдентификаторОбъекта.ПолноеИмя);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПоляОтбора", СтрСоединить(ПоляОтбора, ","));
	
	СпрЗапрос = Справочники.бир_ЗапросыКДанным.СоздатьЭлемент();
	СпрЗапрос.Ид = "Данные";
	СпрЗапрос.УстановитьТекстЗапроса(ТекстЗапроса);
	
	СКД = СпрЗапрос.СхемаКомпоновкиДанных();//НастройкиКомпоновкиДанных();
	АдресСКД = ПоместитьВоВременноеХранилище(СКД, ЭтотОбъект.УникальныйИдентификатор);
	
	КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСКД));
	
	Если СтруктураНастроек = Неопределено Тогда
		КомпоновщикНастроек.ЗагрузитьНастройки(СпрЗапрос.НастройкиКомпоновкиДанных());
	Иначе
		НастройкиКомпоновки = Новый НастройкиКомпоновкиДанных();
		ПреобразованиеДанных().НастройкиСКДИзСтруктуры(НастройкиКомпоновки, СтруктураНастроек);
		КомпоновщикНастроек.ЗагрузитьНастройки(НастройкиКомпоновки);
	КонецЕсли;
	
КонецПроцедуры // ПрочитатьНастройкиКомпоновки()

&НаСервере
Процедура СохранитьНастройкиКомпоновки()
	
	ТекущиеДанные = РеквизитыОбъектов.Получить(Элементы.РеквизитыОбъектов.ТекущаяСтрока);
	
	ТекущиеДанные.НастройкиКомпоновки = ПреобразованиеДанных().НастройкиСКДВСтруктуру(КомпоновщикНастроек.ПолучитьНастройки());
	
КонецПроцедуры // СохранитьНастройкиКомпоновки()

&НаСервере
Функция ПреобразованиеДанных()
	
	Если ПреобразованиеДанных = Неопределено Тогда 
		ПреобразованиеДанных = Обработки.бир_ПреобразованиеДанных.Создать();
	КонецЕсли;
	
	Возврат ПреобразованиеДанных;
	
КонецФункции // ПреобразованиеДанных()

#КонецОбласти // СлужебныеПроцедуры
