
&НаСервере
Функция ПолучитьРолиНаСервере(Выводить = Ложь)
	
	МассивРолей = Новый Массив();
	
	МетаОбъект = Метаданные.НайтиПоПолномуИмени(Объект.ТипОбъекта.ПолноеИмя);
	Если МетаОбъект = Неопределено Тогда
		Возврат МассивРолей;
	КонецЕсли;
	
	Для Каждого ТекРоль Из Метаданные.Роли Цикл
		Если НЕ ПравоДоступа(ПравоДоступа, МетаОбъект, ТекРоль) Тогда
			Продолжить;
		КонецЕсли;
		
		ИдОбъектаМетаданных = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(ТекРоль.ПолноеИмя(), Истина);
			
		МассивРолей.Добавить(ИдОбъектаМетаданных);
	КонецЦикла;
	
	Если НЕ Выводить Тогда
		Возврат МассивРолей;
	КонецЕсли;
	
	ТипыИдМетаданных = Новый Массив();
	ТипыИдМетаданных.Добавить(Тип("СправочникСсылка.ИдентификаторыОбъектовМетаданных"));
	ТипыИдМетаданных.Добавить(Тип("СправочникСсылка.ИдентификаторыОбъектовРасширений"));
	
	ДокументРезультат.Очистить();
	
	ДокументРезультат.Область(1, 1).Текст			= "Роль";
	ДокументРезультат.Область(1, 1).Шрифт			= Новый Шрифт(,, Истина);
	ДокументРезультат.Область(1, 1).ЦветФона		= Новый Цвет(172, 172, 172);
	ДокументРезультат.Область(1, 1).ШиринаКолонки	= 40;
	
	й = 2;
	Для Каждого ТекСтрока Из МассивРолей Цикл
		ДокументРезультат.Область(й, 1).СодержитЗначение	= Истина;
		ДокументРезультат.Область(й, 1).ТипЗначения			= Новый ОписаниеТипов(ТипыИдМетаданных);
		ДокументРезультат.Область(й, 1).Значение			= ТекСтрока;
		й = й + 1;
	КонецЦикла;
	
	Возврат МассивРолей;
	
КонецФункции

&НаКлиенте
Процедура ПолучитьРоли(Команда)
	
	МассивРолей = ПолучитьРолиНаСервере(Истина);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьПрофилиНаСервере(Выводить = Ложь)
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	                      |	ПрофилиГруппДоступаРоли.Ссылка
	                      |ИЗ
	                      |	Справочник.ПрофилиГруппДоступа.Роли КАК ПрофилиГруппДоступаРоли
	                      |ГДЕ
	                      |	ПрофилиГруппДоступаРоли.Роль В(&МассивРолей)
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	ПрофилиГруппДоступаРоли.Ссылка.Наименование");
	Запрос.УстановитьПараметр("МассивРолей", ПолучитьРолиНаСервере());
	
	Результат = Запрос.Выполнить();
	
	МассивПрофилей = Результат.Выгрузить().ВыгрузитьКолонку("Ссылка");
	
	Если НЕ Выводить Тогда
		Возврат МассивПрофилей;
	КонецЕсли;
	
	ДокументРезультат.Очистить();
	
	ДокументРезультат.Область(1, 1).Текст			= "Профиль";
	ДокументРезультат.Область(1, 1).Шрифт			= Новый Шрифт(,, Истина);
	ДокументРезультат.Область(1, 1).ЦветФона		= Новый Цвет(172, 172, 172);
	ДокументРезультат.Область(1, 1).ШиринаКолонки	= 40;
	
	й = 2;
	Для Каждого ТекСтрока Из МассивПрофилей Цикл
		ДокументРезультат.Область(й, 1).СодержитЗначение	= Истина;
		ДокументРезультат.Область(й, 1).ТипЗначения			= Новый ОписаниеТипов("СправочникСсылка.ПрофилиГруппДоступа");
		ДокументРезультат.Область(й, 1).Значение			= ТекСтрока;
		й = й + 1;
	КонецЦикла;
	
	Возврат МассивПрофилей;
	
КонецФункции

&НаКлиенте
Процедура ПолучитьПрофили(Команда)
	
	МассивПрофилей = ПолучитьПрофилиНаСервере(Истина);
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьПользователейНаСервере()
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	                      |	ПрофилиГруппДоступаРоли.Ссылка
	                      |ПОМЕСТИТЬ ВТПрофили
	                      |ИЗ
	                      |	Справочник.ПрофилиГруппДоступа.Роли КАК ПрофилиГруппДоступаРоли
	                      |ГДЕ
	                      |	ПрофилиГруппДоступаРоли.Роль В(&МассивРолей)
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ РАЗЛИЧНЫЕ
	                      |	Пользователи.Ссылка КАК Пользователь,
	                      |	ГруппыПользователейСостав.Ссылка КАК ГруппаПользователей
	                      |ПОМЕСТИТЬ ВТПользователиИГруппы
	                      |ИЗ
	                      |	Справочник.Пользователи КАК Пользователи
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ГруппыПользователей.Состав КАК ГруппыПользователейСостав
	                      |		ПО Пользователи.Ссылка = ГруппыПользователейСостав.Пользователь
	                      |
	                      |ОБЪЕДИНИТЬ
	                      |
	                      |ВЫБРАТЬ РАЗЛИЧНЫЕ
	                      |	Пользователи.Ссылка,
	                      |	СоставыГруппПользователей.ГруппаПользователей
	                      |ИЗ
	                      |	Справочник.Пользователи КАК Пользователи
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СоставыГруппПользователей КАК СоставыГруппПользователей
	                      |		ПО Пользователи.Ссылка = СоставыГруппПользователей.Пользователь
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ РАЗЛИЧНЫЕ
	                      |	Пользователи.Ссылка КАК Пользователь,
	                      |	Профили.Ссылка КАК Профиль
	                      |ИЗ
	                      |	Справочник.Пользователи КАК Пользователи
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ ВТПользователиИГруппы КАК ПользователиИГруппы
	                      |		ПО Пользователи.Ссылка = ПользователиИГруппы.Пользователь
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ГруппыДоступа.Пользователи КАК ГруппыДоступаПользователи
	                      |		ПО (Пользователи.Ссылка = ГруппыДоступаПользователи.Пользователь
	                      |				ИЛИ Пользователи.Ссылка = ГруппыДоступаПользователи.Ссылка.Пользователь
	                      |				ИЛИ ПользователиИГруппы.ГруппаПользователей = ГруппыДоступаПользователи.Пользователь)
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ ВТПрофили КАК Профили
	                      |		ПО (ГруппыДоступаПользователи.Ссылка.Профиль = Профили.Ссылка)
	                      |ГДЕ
	                      |	НЕ Профили.Ссылка ЕСТЬ NULL 
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	Пользователи.Наименование,
	                      |	Профили.Ссылка.Наименование");
	Запрос.УстановитьПараметр("МассивРолей", ПолучитьРолиНаСервере());
	
	Результат = Запрос.Выполнить();
	
	ДокументРезультат.Очистить();
	
	ДокументРезультат.Область(1, 1).Текст			= "Пользователь";
	ДокументРезультат.Область(1, 1).Шрифт			= Новый Шрифт(,, Истина);
	ДокументРезультат.Область(1, 1).ЦветФона		= Новый Цвет(172, 172, 172);
	ДокументРезультат.Область(1, 1).ШиринаКолонки	= 40;
	
	ДокументРезультат.Область(1, 2).Текст			= "Профиль";
	ДокументРезультат.Область(1, 2).Шрифт			= Новый Шрифт(,, Истина);
	ДокументРезультат.Область(1, 2).ЦветФона		= Новый Цвет(172, 172, 172);
	ДокументРезультат.Область(1, 2).ШиринаКолонки	= 40;
	
	й = 2;
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		ДокументРезультат.Область(й, 1).СодержитЗначение	= Истина;
		ДокументРезультат.Область(й, 1).ТипЗначения			= Новый ОписаниеТипов("СправочникСсылка.Пользователи");
		ДокументРезультат.Область(й, 1).Значение			= Выборка.Пользователь;
		
		ДокументРезультат.Область(й, 2).СодержитЗначение	= Истина;
		ДокументРезультат.Область(й, 2).ТипЗначения			= Новый ОписаниеТипов("СправочникСсылка.ПрофилиГруппДоступа");
		ДокументРезультат.Область(й, 2).Значение			= Выборка.Профиль;
		
		й = й + 1;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьПользователей(Команда)
	
	ПолучитьПользователейНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.ПравоДоступа.СписокВыбора.Добавить("Чтение", "Чтение (Read) - чтение"); 
	Элементы.ПравоДоступа.СписокВыбора.Добавить("Добавление", "Добавление (Insert) - добавление"); 
	Элементы.ПравоДоступа.СписокВыбора.Добавить("Изменение", "Изменение (Update) - изменение"); 
	Элементы.ПравоДоступа.СписокВыбора.Добавить("Удаление", "Удаление (Delete) - удаление"); 
	Элементы.ПравоДоступа.СписокВыбора.Добавить("Проведение", "Проведение (Posting) - проведение документов"); 
	Элементы.ПравоДоступа.СписокВыбора.Добавить("ОтменаПроведения", "ОтменаПроведения (UndoPosting) - отмена проведения документов"); 
	Элементы.ПравоДоступа.СписокВыбора.Добавить("Просмотр", "Просмотр (View) - просмотр"); 
	Элементы.ПравоДоступа.СписокВыбора.Добавить("ИнтерактивноеДобавление", "ИнтерактивноеДобавление (InteractiveInsert) - интерактивное добавление"); 
	Элементы.ПравоДоступа.СписокВыбора.Добавить("Редактирование", "Редактирование (Edit) - редактирование"); 
	Элементы.ПравоДоступа.СписокВыбора.Добавить("ИнтерактивнаяПометкаУдаления", "ИнтерактивнаяПометкаУдаления (InteractiveSetDeletionMark) - интерактивная пометка на удаление"); 
	Элементы.ПравоДоступа.СписокВыбора.Добавить("ИнтерактивноеСнятиеПометкиУдаления", "ИнтерактивноеСнятиеПометкиУдаления (InteractiveClearDeletionMark) - интерактивное снятие пометки на удаление"); 
	Элементы.ПравоДоступа.СписокВыбора.Добавить("ИнтерактивноеУдалениеПомеченных", "ИнтерактивноеУдалениеПомеченных (InteractiveDeleteMarked) - интерактивное удаление помеченных объектов"); 
	Элементы.ПравоДоступа.СписокВыбора.Добавить("ИнтерактивноеПроведение", "ИнтерактивноеПроведение (InteractivePosting) - интерактивное проведение"); 
	Элементы.ПравоДоступа.СписокВыбора.Добавить("ИнтерактивноеПроведениеНеОперативное", "ИнтерактивноеПроведениеНеОперативное (InteractivePostingRegular) - интерактивное проведение (стандартными командами форм) документа в неоперативном режиме"); 
	Элементы.ПравоДоступа.СписокВыбора.Добавить("ИнтерактивнаяОтменаПроведения", "ИнтерактивнаяОтменаПроведения (InteractiveUndoPosting) - интерактивная отмена проведения"); 
	Элементы.ПравоДоступа.СписокВыбора.Добавить("ИнтерактивноеИзменениеПроведенных", "ИнтерактивноеИзменениеПроведенных (InteractiveChangeOfPosted) - интерактивное редактирование проведенного документа. Если право не установлено, то пользователь не может проведенный документ удалить, установить пометку удаления, перепровести или сделать непроведенным. Форма такого документа открывается в режиме просмотра"); 
	Элементы.ПравоДоступа.СписокВыбора.Добавить("ВводПоСтроке", "ВводПоСтроке (InputByString) - использование режима ввода по строке"); 
	Элементы.ПравоДоступа.СписокВыбора.Добавить("УправлениеИтогами", "УправлениеИтогами (TotalsControl) - управление итогами регистра бухгалтерии и регистра накопления (установка периода, по который рассчитаны итоги, и пересчет итогов)"); 
	Элементы.ПравоДоступа.СписокВыбора.Добавить("Использование", "Использование (Use) - использование"); 
	Элементы.ПравоДоступа.СписокВыбора.Добавить("ИнтерактивноеУдаление", "ИнтерактивноеУдаление (InteractiveDelete) - интерактивное непосредственное удаление"); 
	Элементы.ПравоДоступа.СписокВыбора.Добавить("Администрирование", "Администрирование (Administration) - администрирование информационной базы; требуется наличия права ""Администрирование данных"""); 
	Элементы.ПравоДоступа.СписокВыбора.Добавить("АдминистрированиеДанных", "АдминистрированиеДанных (DataAdministration) - право на административные действия над данными"); 
	Элементы.ПравоДоступа.СписокВыбора.Добавить("МонопольныйРежим", "МонопольныйРежим (ExclusiveMode) - использование монопольного режима"); 
	Элементы.ПравоДоступа.СписокВыбора.Добавить("АктивныеПользователи", "АктивныеПользователи (ActiveUsers) - просмотр списка активных пользователей"); 
	Элементы.ПравоДоступа.СписокВыбора.Добавить("ЖурналРегистрации", "ЖурналРегистрации (EventLog) - журнал регистрации"); 
	Элементы.ПравоДоступа.СписокВыбора.Добавить("ВнешнееСоединение", "ВнешнееСоединение (ExternalConnection) - внешнее соединение"); 
	Элементы.ПравоДоступа.СписокВыбора.Добавить("Automation", "Automation (Automation) - использование automation"); 
	Элементы.ПравоДоступа.СписокВыбора.Добавить("ИнтерактивноеОткрытиеВнешнихОбработок", "ИнтерактивноеОткрытиеВнешнихОбработок (InteractiveOpenExtDataProcessors) - интерактивное открытие внешних обработок"); 
	Элементы.ПравоДоступа.СписокВыбора.Добавить("ИнтерактивноеОткрытиеВнешнихОтчетов", "ИнтерактивноеОткрытиеВнешнихОтчетов (InteractiveOpenExtReports) - интерактивное открытие внешних отчетов"); 
	Элементы.ПравоДоступа.СписокВыбора.Добавить("Получение", "Получение (Get) - получение значения, не хранящегося в базе данных"); 
	Элементы.ПравоДоступа.СписокВыбора.Добавить("Установка", "Установка (Set) - установка значения, не сохраняемого в базе данных"); 
	Элементы.ПравоДоступа.СписокВыбора.Добавить("ИнтерактивнаяАктивация", "ИнтерактивнаяАктивация (InteractiveActivate) - интерактивная активация"); 
	Элементы.ПравоДоступа.СписокВыбора.Добавить("Старт", "Старт (Start) - старт бизнес-процесса"); 
	Элементы.ПравоДоступа.СписокВыбора.Добавить("ИнтерактивныйСтарт", "ИнтерактивныйСтарт (InteractiveStart) - интерактивный старт бизнес-процесса"); 
	Элементы.ПравоДоступа.СписокВыбора.Добавить("Выполнение", "Выполнение (Execute) - выполнение задачи"); 
	Элементы.ПравоДоступа.СписокВыбора.Добавить("ИнтерактивноеВыполнение", "ИнтерактивноеВыполнение (InteractiveExecute) - интерактивное выполнение задачи"); 
	Элементы.ПравоДоступа.СписокВыбора.Добавить("Вывод", "Вывод (Output) - вывод на печать, запись и копирование в буфер обмена"); 
	Элементы.ПравоДоступа.СписокВыбора.Добавить("ОбновлениеКонфигурацииБазыДанных", "ОбновлениеКонфигурацииБазыДанных (UpdateDataBaseConfiguration) - обновление конфигурации базы данных"); 
	Элементы.ПравоДоступа.СписокВыбора.Добавить("ТонкийКлиент", "ТонкийКлиент (ThinClient) - право запуска тонкого клиента"); 
	Элементы.ПравоДоступа.СписокВыбора.Добавить("ВебКлиент", "ВебКлиент (WebClient) - право запуска веб-клиента"); 
	Элементы.ПравоДоступа.СписокВыбора.Добавить("ТолстыйКлиент", "ТолстыйКлиент (ThickClient) - право запуска толстого клиента"); 
	Элементы.ПравоДоступа.СписокВыбора.Добавить("РежимВсеФункции", "РежимВсеФункции (AllFunctionsMode) - право на использования режима ""Все функции"""); 
	Элементы.ПравоДоступа.СписокВыбора.Добавить("СохранениеДанныхПользователя", "СохранениеДанныхПользователя (SaveUserData) - право на сохранение данных пользователя (настроек, избранного, истории)"); 
	Элементы.ПравоДоступа.СписокВыбора.Добавить("ИзменениеСтандартнойАутентификации", "ИзменениеСтандартнойАутентификации (StandardAuthenticationChange) - пользователь имеет право изменять свои сохраненные параметры стандартной аутентификации внешнего источника данных"); 
	Элементы.ПравоДоступа.СписокВыбора.Добавить("ИзменениеСтандартнойАутентификацииСеанса", "ИзменениеСтандартнойАутентификацииСеанса (SessionStandardAuthenticationChange) - пользователь имеет право изменять параметры стандартной аутентификации внешнего источника данных для текущего сеанса"); 
	Элементы.ПравоДоступа.СписокВыбора.Добавить("ИзменениеАутентификацииОССеанса", "ИзменениеАутентификацииОССеанса (SessionOSAuthenticationChange) - пользователь имеет право изменять параметры стандартной аутентификации внешнего источника данных для текущего сеанса и текущего пользователя"); 
	Элементы.ПравоДоступа.СписокВыбора.Добавить("ИнтерактивноеУдалениеПредопределенныхДанных", "ИнтерактивноеУдалениеПредопределенныхДанных (InteractiveDeletePredefinedData) - интерактивное удаление предопределенных данных"); 
	Элементы.ПравоДоступа.СписокВыбора.Добавить("ИнтерактивнаяПометкаУдаленияПредопределенныхДанных", "ИнтерактивнаяПометкаУдаленияПредопределенныхДанных (InteractiveSetDeletionMarkPredefinedData) - интерактивная пометка предопределенных данных"); 
	Элементы.ПравоДоступа.СписокВыбора.Добавить("ИнтерактивноеСнятиеПометкиУдаленияПредопределенных", "ИнтерактивноеСнятиеПометкиУдаленияПредопределенных (InteractiveClearDeletionMarkPredefinedData) - интерактивное снятие пометки предопределенных данных"); 
	Элементы.ПравоДоступа.СписокВыбора.Добавить("ИнтерактивноеУдалениеПомеченныхПредопределенныхДан", "ИнтерактивноеУдалениеПомеченныхПредопределенныхДан (InteractiveDeleteMarkedPredefinedData) - интерактивное удаление помеченных предопределенных данных");
	
КонецПроцедуры
