
Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ЭтотОбъект.Количество() = 0 И Замещение И ЗначениеЗаполнено(ЭтотОбъект.Отбор.Ид.Значение) Тогда
		
		НаборЗаписей = РегистрыСведений.бир_СобытияОбработка.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Ид.Установить(ЭтотОбъект.Отбор.Ид.Значение);
		НаборЗаписей.Записать(Истина);
		
		НаборЗаписей = РегистрыСведений.бир_СобытияОбработкаНаКлиенте.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Ид.Установить(ЭтотОбъект.Отбор.Ид.Значение);
		НаборЗаписей.Записать(Истина);
		
	КонецЕсли;

КонецПроцедуры // ПередЗаписью()
