////////////////////////////////////////////////////////////////////////////////
// Подсистема "Обработка событий (EventHUB)". (Передача обработки на сервер)
//
////////////////////////////////////////////////////////////////////////////////


#Область ПрограммныйИнтерфейс

#Область ОбработкаСобытий

// Функция - Получает список обработчиков событий, которые необходимо выполнить на стороне клиента
// 
// Возвращаемое значение:
//  Массив(Структура) - Массив описаний обработчиков событий
//
Функция ОбработчикиСобытийДляВыполненияНаКлиенте() Экспорт
	
	Возврат бир_События.ОбработчикиСобытийДляВыполненияНаКлиенте();
	
КонецФункции // ОбработчикиСобытийДляВыполненияНаКлиенте()

// Процедура - записывает результат обработки события на стороне клиента
//
// Параметры:
//  ОписаниеСобытия     - Структура                 - описание события (см. бир_События.СтруктураОписанияСобытия())
//  Обработчик          - СправочникСсылка          - обработчик события
//                        .бир_СобытияОбработчики
//  Пользователь        - СправочникСсылка          - пользователь для которого выполнялась обработка события
//                        .Пользователи
//  Обработано          - Булево                    - Истина - Обработка события выполнена; Ложь - в противном случае
//  РезультатОбработки  - Строка                    - описание результата обработки или текст ошибки
//  ОшибкаОбработки     - Булево                    - Истина - В процессе выполнения обработки произошла ошибка;
//                                                    Ложь - в противном случае
//
Процедура ЗаписатьРезультатОбработкиСобытияНаКлиенте(ОписаниеСобытия,
                                                     Знач Обработчик,
                                                     Знач Пользователь = Неопределено,
                                                     Знач Обработано = Неопределено,
                                                     Знач РезультатОбработки = "",
													 Знач ОшибкаОбработки = Ложь) Экспорт
	
	бир_События.ЗаписатьРезультатОбработкиСобытияНаКлиенте(ОписаниеСобытия,
	                                                       Обработчик,
	                                                       Пользователь,
	                                                       Обработано,
	                                                       РезультатОбработки,
	                                                       ОшибкаОбработки);
	
КонецПроцедуры // ЗаписатьРезультатОбработкиСобытияНаКлиенте()

#КонецОбласти // ОбработкаСобытий

#Область ИнтерфейсСобытияВнешнихИБ

// Функция - передать событие во внешнюю ИБ
//
// Параметры:
// 	НастройкиПодключения          - Структура        - структура настроек подключения к http-сервису, в т.ч.:
//    *Сервис_Сервер               - Строка            - адрес сервера http-сервиса
//    *Сервис_АдресРесурса         - Строка            - адрес ресурса http-сервиса
//    *Сервис_Пользователь         - Строка            - имя пользователя сервиса
//    *Сервис_Пароль               - Строка            - пароль пользователя сервиса
//    *Соединение                  - HTTPСоединение    - полученный ранее объект соединения
//                                                       с http-сервисом для повторного использования
//    *Соединение_Использование    - Булево            - флаг необходимости повторного использования
//                                                        объекта соединения с http-сервисом 
//    *Таймаут                     - Число             - время ожидания соединения
//  ОписаниеСобытия               - Структура         - Структура описания события
// 
// Возвращаемое значение:
//  Строка - Ответ сервиса передачи событий внешней ИБ
//
Функция ПередатьСобытиеВоВнешнююИБ(НастройкиПодключения, ОписаниеСобытия) Экспорт
	
	Возврат бир_ВнешниеСобытияОтправкаЗапросов.ПередатьСобытиеВоВнешнююИБ(НастройкиПодключения, ОписаниеСобытия);
	
КонецФункции // ПередатьСобытиеВоВнешнююИБ()

// Функция - получает идентификатор для текущей точки возникновения события от сервиса
//
// Параметры:
// 	НастройкиПодключения          - Структура        - структура настроек подключения к http-сервису, в т.ч.:
//    *Сервис_Сервер               - Строка            - адрес сервера http-сервиса
//    *Сервис_АдресРесурса         - Строка            - адрес ресурса http-сервиса
//    *Сервис_Пользователь         - Строка            - имя пользователя сервиса
//    *Сервис_Пароль               - Строка            - пароль пользователя сервиса
//    *Соединение                  - HTTPСоединение    - полученный ранее объект соединения
//                                                       с http-сервисом для повторного использования
//    *Соединение_Использование    - Булево            - флаг необходимости повторного использования
//                                                       объекта соединения с http-сервисом 
//    *Таймаут                     - Число             - время ожидания соединения
// 
// Возвращаемое значение:
//   Строка    - Идентификатор точки возникновения событий
//
Функция ПолучитьИдентификаторВнешнейИБ(НастройкиПодключения) Экспорт
									  
	Возврат бир_ВнешниеСобытияОтправкаЗапросов.ПолучитьИдентификаторВнешнейИБ(НастройкиПодключения);
	
КонецФункции // ПолучитьИдентификаторВнешнейИБ()

// Функция - получает список событий из внешней ИБ
//
// Параметры:
// 	НастройкиПодключения          - Структура         - структура настроек подключения к http-сервису, в т.ч.:
//    *Сервис_Сервер               - Строка            - адрес сервера http-сервиса
//    *Сервис_АдресРесурса         - Строка            - адрес ресурса http-сервиса
//    *Сервис_Пользователь         - Строка            - имя пользователя сервиса
//    *Сервис_Пароль               - Строка            - пароль пользователя сервиса
//    *Соединение                  - HTTPСоединение    - полученный ранее объект соединения
//                                                       с http-сервисом для повторного использования
//    *Соединение_Использование    - Булево            - флаг необходимости повторного использования
//                                                       объекта соединения с http-сервисом 
//    *Таймаут                     - Число             - время ожидания соединения
// 
// Возвращаемое значение:
//  Массив    - Массив описаний событий
//
Функция ПолучитьСписокСобытийВнешнейИБ(НастройкиПодключения) Экспорт
	
	Возврат бир_ВнешниеСобытияОтправкаЗапросов.ПолучитьСписокСобытийВнешнейИБ(НастройкиПодключения);
	
КонецФункции // ПолучитьСписокСобытийВнешнейИБ()

#КонецОбласти // ИнтерфейсСобытияВнешнихИБ

#КонецОбласти // ПрограммныйИнтерфейс

#Область СлужебныйПрограммныйИнтерфейс

// Функция - возвращает структуру описания события
//
// Параметры:
//  ТочкаВозникновения   - СправочникСсылка
//                         .бир_СобытияТочкиВозникновения     - точка (ИБ), где возникло событие
//  ИдСобытия            - Строка                             - уникальный идентификатор события
//  Источник             - ЛюбаяСсылка                        - источник возникновения события
//  Событие              - СправочникСсылка.бир_События       - возникшее событие
//  Дата                 - Дата                               - дата и время возникновения события
//  Момент               - Число                              - момет возникновения события в миллисекундах
//  ИдПервичный          - Строка                             - уникальный идентификатор первичного события
//                                                              (для трассировки)
//	ТипИсточника         - СправочникСсылка                   - тип источника возникновения события
//                         .ИдентификаторыОбъектовМетаданных,   (тип объекта системы)
//                         СправочникСсылка
//                         .ИдентификаторыОбъектовРасширений
//
// Возвращаемое значение:
//  Структура    - структура описание события (см. бир_События.СтруктураОписанияСобытия())
Функция СтруктураОписанияСобытия(ТочкаВозникновения = Неопределено,
                                 ИдСобытия = "",
                                 Источник = Неопределено,
                                 Событие = Неопределено,
                                 Дата = '00010101',
                                 Момент = 0,
                                 ИдПервичный = "",
                                 ТипИсточника = Неопределено) Экспорт

	Возврат бир_События.СтруктураОписанияСобытия(ТочкаВозникновения,
 	                                             ИдСобытия,
 	                                             Источник,
 	                                             Событие,
 	                                             Дата,
 	                                             Момент,
 	                                             ИдПервичный,
 	                                             ТипИсточника);

КонецФункции // СтруктураОписанияСобытия()

// Функция - получает описание события в виде структуры (для использования на клиенте)
//
// Параметры:
//  Событие    - СправочникСсылка.бир_События    - Элемент справочника "События", для которого получаем описание
// 
// Возвращаемое значение:
//  Структура  - Описание обработчика событий
//    *Ссылка                   - СправочникСсылка  - ссылка на элемент справочника
//    *Код                      - Строка            - код элемента справочника
//    *Наименование             - Строка            - наименование элемента справочника
//    *Ид                       - Строка            - идентификатор обработчика
//    *ОбработкаНастройки       - Структура         - настройки обработки обслуживания обработчика события
//    *ОбработкаВнешняя         - Булево            - Истина - обработка внешняя
//    *ОбработкаИмяВстроенной   - Строка            - имя объекта метаданных встроенной обработки
//
Функция ОписаниеСобытия(Событие) Экспорт
	
	ВремОбработка = Событие.Обработка.Получить();
	ОбработкаВнешняя = (НЕ ТипЗнч(ВремОбработка) = Тип("Строка"));
	
	ОписаниеСобытия = Новый Структура();
	ОписаниеСобытия.Вставить("Ссылка"                , Событие.Ссылка);
	ОписаниеСобытия.Вставить("Код"                   , Событие.Код);
	ОписаниеСобытия.Вставить("Наименование"          , Событие.Наименование);
	ОписаниеСобытия.Вставить("Ид"                    , Событие.Ид);
	ОписаниеСобытия.Вставить("ОбработкаНастройки"    , Событие.ОбработкаНастройки.Получить());
	ОписаниеСобытия.Вставить("ОбработкаВнешняя"      , ОбработкаВнешняя);
	ОписаниеСобытия.Вставить("ОбработкаИмяВстроенной", ?(ОбработкаВнешняя, "", ВремОбработка));
	
	Возврат ОписаниеСобытия;
	
КонецФункции // ОписаниеСобытия()

// Функция - получает описание обработчика событий в виде структуры (для использования на клиенте)
//
// Параметры:
//  Обработчик    - СправочникСсылка           - элемент справочника "Обработчики событий",
//                  .бир_СобытияОбработчики      для которого получаем описание
// 
// Возвращаемое значение:
//  Структура                                       - описание обработчика событий
//    *Ссылка                   - СправочникСсылка    - ссылка на элемент справочника
//    *Код                      - Строка              - код элемента справочника
//    *Наименование             - Строка              - наименование элемента справочника
//    *Ид                       - Строка              - идентификатор обработчика
//    *ОбработкаНастройки       - Структура           - настройки обработки обслуживания обработчика события
//    *ОбработкаВнешняя         - Булево              - Истина - обработка внешняя
//    *ОбработкаИмяВстроенной   - Строка              - имя объекта метаданных встроенной обработки
//
Функция ОписаниеОбработчикаСобытий(Обработчик) Экспорт
	
	ВремОбработка = Обработчик.Обработка.Получить();
	ОбработкаВнешняя = (НЕ ТипЗнч(ВремОбработка) = Тип("Строка"));
	
	ОписаниеОбработчика = Новый Структура();
	ОписаниеОбработчика.Вставить("Ссылка"                , Обработчик.Ссылка);
	ОписаниеОбработчика.Вставить("Код"                   , Обработчик.Код);
	ОписаниеОбработчика.Вставить("Наименование"          , Обработчик.Наименование);
	ОписаниеОбработчика.Вставить("Ид"                    , Обработчик.Ид);
	ОписаниеОбработчика.Вставить("ОбработкаНастройки"    , Обработчик.ОбработкаНастройки.Получить());
	ОписаниеОбработчика.Вставить("ОбработкаВнешняя"      , ОбработкаВнешняя);
	ОписаниеОбработчика.Вставить("ОбработкаИмяВстроенной", ?(ОбработкаВнешняя, "", ВремОбработка));
	
	Возврат ОписаниеОбработчика;
	
КонецФункции // ОписаниеОбработчикаСобытий()

// Функция - получает идентификатор объекта метаданных
//
// Параметры:
//  ОписаниеОбъектаМетаданных    - Тип, Строка, ОбъектМетаданных    - Описание объекта для получения идентификатора
// 
// Возвращаемое значение:
//  СправочникСсылка.ИдентификаторыОбъектовМетаданных,    - Элемент справочника, идентификатор объекта
//  СправочникСсылка.ИдентификаторыОбъектовРасширений
//
Функция ИдентификаторОбъектаМетаданных(ОписаниеОбъектаМетаданных) Экспорт
	
	Возврат бир_События.ИдентификаторОбъектаМетаданных(ОписаниеОбъектаМетаданных);
	
КонецФункции // ИдентификаторОбъектаМетаданных()

// Функция - получает текущего пользователя
//
// Возвращаемое значение:
//  СправочникСсылка.Пользователи    - элемент справочника "Пользователи", соответствующий текущему пользователю
//
Функция ТекущийПользователь() Экспорт
	
	Возврат бир_События.ТекущийПользователь();
	
КонецФункции // ТекущийПользователь()

#КонецОбласти // СлужебныйПрограммныйИнтерфейс
