
&НаКлиенте
Процедура ТипЗначенияПриИзменении(Элемент)
	
	УстановитьТипыЗначений();
	
КонецПроцедуры // ТипЗначенияПриИзменении()

&НаСервере
Процедура УстановитьТипыЗначений()
	
	Если Объект.Предопределенный Тогда
		Элементы.ТипЗначения.Доступность = Ложь;
	КонецЕсли;
	
	Объект.Значение = Объект.ТипЗначения.ПривестиЗначение(Объект.Значение);
	
	Для Каждого ТекСтрока Из Объект.Список Цикл
		ТекСтрока.Значение = Объект.ТипЗначения.ПривестиЗначение(ТекСтрока.Значение);
	КонецЦикла;
	
КонецПроцедуры // УстановитьТипыЗначений()

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьТипыЗначений();
	
КонецПроцедуры // ПриСозданииНаСервере()

&НаКлиенте
Процедура СписокПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные.Значение = Объект.ТипЗначения.ПривестиЗначение(ТекущиеДанные.Значение);
	
КонецПроцедуры
