////////////////////////////////////////////////////////////////////////////////
// Библиотека подключаемых обработок обслуживания. (Клиент)
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

#Область ОбработчикиСобытийЭлементаВыбораОбработкиВФорме

// Процедура - обработчик события "НачалоВыбора" элемента выбора обработки обслуживания в форме
//
// Параметры:
//  Элемент                              - ЭлементФормы        - (служебный) Необходимо передать значение
//                                                               параметра "Элемент" из вызывающей процедуры
//  ДанныеВыбора                         - СписокЗначений      - (служебный) Необходимо передать значение
//                                                               параметра "ДанныеВыбора" из вызывающей процедуры
//  СтандартнаяОбработка                 - Булево              - (служебный) Необходимо передать значение
//                                                               параметра "СтандартнаяОбработка" из вызывающей процедуры
//  Форма                                - УправляемаяФорма    - форма в которой выполняется выбор обработки обслуживания
//  ПутьКДаннымОбработкаАдресВХранилище  - Строка              - путь к реквизиту формы, в котором
//                                                               хранится адрес обработки во временном хранилище
//  ПутьКДаннымОбработкаПредставление    - Строка              - путь к реквизиту формы, в котором
//                                                               хранится представление обработки
//  ПутьКДаннымОбработкаНастройкиАдресВХранилище - Строка      - путь к реквизиту формы, в котором
//                                                               хранится адрес настроек обработки во временном хранилище
//  ПрефиксОбработки                     - Строка              - начало имени обработки для отбора обработок конфигурации
//  ИмяКонтрольнойПроцедуры              - Строка              - имя функции модуля объекта обработки,
//                                                               вызываемой для проверки,
//                                                               что обработка является обработкой обслуживания
//  ПараметрыКонтрольнойПроцедуры        - Массив              - парметры функции, вызываемой для проверки
//
Процедура ОбработкаОбслуживанияНачалоВыбора(Элемент,
                                            ДанныеВыбора,
                                            СтандартнаяОбработка,
                                            Форма,
                                            ПутьКДаннымОбработкаАдресВХранилище,
                                            ПутьКДаннымОбработкаПредставление,
                                            ПутьКДаннымОбработкаНастройкиАдресВХранилище,
                                            ПрефиксОбработки,
                                            ИмяКонтрольнойПроцедуры = Неопределено,
                                            ПараметрыКонтрольнойПроцедуры = Неопределено) Экспорт
	
	СтандартнаяОбработка = Ложь;
	
	Параметры = Новый Структура("Форма,
	                            |ПутьКДаннымОбработкаАдресВХранилище,
	                            |ПутьКДаннымОбработкаПредставление,
	                            |ПутьКДаннымОбработкаНастройкиАдресВХранилище,
	                            |ИмяКонтрольнойПроцедуры,
	                            |ПараметрыКонтрольнойПроцедуры",
	                            Форма,
	                            ПутьКДаннымОбработкаАдресВХранилище,
	                            ПутьКДаннымОбработкаПредставление,
	                            ПутьКДаннымОбработкаНастройкиАдресВХранилище,
	                            ИмяКонтрольнойПроцедуры,
	                            ПараметрыКонтрольнойПроцедуры);
								
	ОповещениеВыбораОбработкиОбслуживания = Новый ОписаниеОповещения("ОбработкаОбслуживанияНачалоВыбораОбработка",
	                                                                 бир_ОбработкиОбслуживанияКлиент,
	                                                                 Параметры);
	
	ВремМеню = бир_ОбработкиОбслуживанияВызовСервера.ПолучитьСписокОбработокОбслуживания(ПрефиксОбработки,
	                                                                                     ИмяКонтрольнойПроцедуры,
	                                                                                     ПараметрыКонтрольнойПроцедуры);
	ВремМеню.Добавить("ВыбратьИзФайла", "Выбрать из файла...");
	
	Форма.ПоказатьВыборИзМеню(ОповещениеВыбораОбработкиОбслуживания, ВремМеню, Элемент);
	
КонецПроцедуры // ОбработкаОбслуживанияНачалоВыбора()

// Процедура - продолжение обработчика события "НачалоВыбора" элемента выбора обработки обслуживания в форме
//             после выполнения выбора элемента из меню
//
// Параметры:
//  ВыбранныйЭлемент - ЭлементСпискаЗначений    - Выбранный пункт меню
//  Параметры        - Структура                - Параметры переданные из обработчика события "НачалоВыбора"
//
Процедура ОбработкаОбслуживанияНачалоВыбораОбработка(ВыбранныйЭлемент, Параметры) Экспорт
	
	Если ВыбранныйЭлемент = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Форма = Параметры.Форма;
	ПутьКДаннымОбработкаАдресВХранилище				= Параметры.ПутьКДаннымОбработкаАдресВХранилище;
	ПутьКДаннымОбработкаПредставление				= Параметры.ПутьКДаннымОбработкаПредставление;
	ПутьКДаннымОбработкаНастройкиАдресВХранилище	= Параметры.ПутьКДаннымОбработкаНастройкиАдресВХранилище;
	
	Если ВыбранныйЭлемент.Значение = "ВыбратьИзФайла" Тогда
		ОповещениеВыбораФайлаОбработкиОбслуживания = Новый ОписаниеОповещения("ОбработкаОбслуживанияНачалоВыбораОбработкаВыбораФайла", бир_ОбработкиОбслуживанияКлиент, Параметры);
		НачатьПомещениеФайла(ОповещениеВыбораФайлаОбработкиОбслуживания, , , Истина, Форма.УникальныйИдентификатор);
	Иначе
		Форма[ПутьКДаннымОбработкаАдресВХранилище]			= ПоместитьВоВременноеХранилище(ВыбранныйЭлемент.Значение, Форма.УникальныйИдентификатор);
		Форма[ПутьКДаннымОбработкаПредставление]			= ВыбранныйЭлемент.Представление;
		Форма[ПутьКДаннымОбработкаНастройкиАдресВХранилище] = ПоместитьВоВременноеХранилище(Новый Структура(), Форма.УникальныйИдентификатор);
		Форма.Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры // ОбработкаОбслуживанияНачалоВыбораОбработка()

// Процедура - продолжение обработчика события "НачалоВыбора" элемента выбора обработки обслуживания в форме
//             после выполнения выбора файла внешней обработки
//
// Параметры:
//  Результат            - Булево      - Истина - файл выбран
//  Адрес                - Строка      - адрес временного хранилища выбранного файла
//  ВыбранноеИмяФайла    - Строка      - имя файла
//  Параметры            - Структура   - параметры переданные из обработчика события "НачалоВыбора"
//
Процедура ОбработкаОбслуживанияНачалоВыбораОбработкаВыбораФайла(Результат, Адрес, ВыбранноеИмяФайла, Параметры) Экспорт
	
	Если НЕ Результат Тогда
		Возврат;
	КонецЕсли;
	
	Форма = Параметры.Форма;
	ПутьКДаннымОбработкаАдресВХранилище          = Параметры.ПутьКДаннымОбработкаАдресВХранилище;
	ПутьКДаннымОбработкаПредставление            = Параметры.ПутьКДаннымОбработкаПредставление;
	ПутьКДаннымОбработкаНастройкиАдресВХранилище = Параметры.ПутьКДаннымОбработкаНастройкиАдресВХранилище;
	ИмяКонтрольнойПроцедуры                      = Параметры.ИмяКонтрольнойПроцедуры;
	ПараметрыКонтрольнойПроцедуры                = Параметры.ПараметрыКонтрольнойПроцедуры;
	
	Если НЕ бир_ОбработкиОбслуживанияВызовСервера.ЭтоОбработкаОбслуживания(Адрес, ИмяКонтрольнойПроцедуры, ПараметрыКонтрольнойПроцедуры) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Выбранный файл не является обработкой обслуживания!");
		Возврат;
	КонецЕсли;
	
	ОписаниеОбработки = бир_ОбработкиОбслуживанияВызовСервера.ПолучитьОписаниеОбработкиОбслуживания(Адрес);
	
	Форма[ПутьКДаннымОбработкаАдресВХранилище]          = Адрес;
	Форма[ПутьКДаннымОбработкаПредставление]            = ОписаниеОбработки.ПредставлениеОбработки;
	Форма[ПутьКДаннымОбработкаНастройкиАдресВХранилище] = ПоместитьВоВременноеХранилище(Новый Структура(), Форма.УникальныйИдентификатор);
	Форма.Модифицированность = Истина;
	
КонецПроцедуры // ОбработкаОбслуживанияНачалоВыбораОбработкаВыбораФайла()

// Процедура - обработчик события "Очистка" элемента выбора обработки обслуживания в форме
//
// Параметры:
//  Элемент                              - ЭлементФормы      - (служебный) Необходимо передать значение
//                                                             параметра "Элемент" из вызывающей процедуры
//  СтандартнаяОбработка                 - Булево            - (служебный) Необходимо передать значение
//                                                             параметра "СтандартнаяОбработка" из вызывающей процедуры
//  Форма                                - УправляемаяФорма  - форма в которой выполняется выбор обработки обслуживания
//  ПутьКДаннымОбработкаАдресВХранилище  - Строка            - путь к реквизиту формы, в котором хранится
//                                                             адрес обработки во временном хранилище
//  ПутьКДаннымОбработкаПредставление    - Строка            - путь к реквизиту формы, в котором хранится
//                                                             представление обработки
//
Процедура ОбработкаОбслуживанияОчистка(Элемент,
                                       СтандартнаяОбработка,
                                       Форма,
                                       ПутьКДаннымОбработкаАдресВХранилище,
                                       ПутьКДаннымОбработкаПредставление) Экспорт
	
	СтандартнаяОбработка = Ложь;
	
	Форма[ПутьКДаннымОбработкаАдресВХранилище] = "";
	Форма[ПутьКДаннымОбработкаПредставление] = "";
	
КонецПроцедуры // ОбработкаОбслуживанияОчистка()

// Процедура - обработчик события "Открытие" элемента выбора обработки обслуживания в форме
//
// Параметры:
//  Элемент                                      - ЭлементФормы      - (служебный) Необходимо передать значение
//                                                                     параметра "Элемент" из вызывающей процедуры
//  СтандартнаяОбработка                         - Булево            - (служебный) Необходимо передать значение
//                                                                     параметра "СтандартнаяОбработка" из вызывающей процедуры
//  Форма                                        - УправляемаяФорма  - Форма в которой выполняется выбор обработки обслуживания
//  ПутьКДаннымОбработкаАдресВХранилище          - Строка            - Путь к реквизиту формы, в котором хранится
//                                                                     адрес обработки во временном хранилище
//  ПутьКДаннымОбработкаНастройкиАдресВХранилище - Строка            - Путь к реквизиту формы, в котором хранится
//                                                                     адрес настроек обработки во временном хранилище
//
Процедура ОбработкаОбслуживанияОткрытие(Элемент,
                                        СтандартнаяОбработка,
                                        Форма,
                                        ПутьКДаннымОбработкаАдресВХранилище,
                                        ПутьКДаннымОбработкаНастройкиАдресВХранилище) Экспорт
	СтандартнаяОбработка = Ложь;
	
	Если НЕ ЗначениеЗаполнено(Форма[ПутьКДаннымОбработкаАдресВХранилище]) Тогда
		Возврат;
	КонецЕсли; 
	
	ОписаниеОбработки = бир_ОбработкиОбслуживанияВызовСервера.ПолучитьОписаниеОбработкиОбслуживания(Форма[ПутьКДаннымОбработкаАдресВХранилище]);
	
	Если НЕ ЗначениеЗаполнено(ОписаниеОбработки.ИмяОбработки) Тогда
		Возврат;
	КонецЕсли; 
	
	Если НЕ ТипЗнч(ОписаниеОбработки.СписокДействийКнопкиОткрытия) = Тип("СписокЗначений") Тогда
		ОписаниеОбработки.СписокДействийКнопкиОткрытия = Новый СписокЗначений();
	КонецЕсли;
	
	ПервыйЭлемент = Неопределено;							
	Если ОписаниеОбработки.СписокДействийКнопкиОткрытия.Количество() = 0 Тогда
		ПервыйЭлемент = ОписаниеОбработки.СписокДействийКнопкиОткрытия.Добавить("ОткрытьФорму_Форма", "Открыть основную форму обработки");
	Иначе
		ПервыйЭлемент = ОписаниеОбработки.СписокДействийКнопкиОткрытия[0];
	КонецЕсли;
	
	Параметры = Новый Структура("Форма,
	                            |ОписаниеОбработки,
	                            |ПутьКДаннымОбработкаАдресВХранилище,
	                            |ПутьКДаннымОбработкаНастройкиАдресВХранилище",
	                            Форма,
	                            ОписаниеОбработки,
	                            ПутьКДаннымОбработкаАдресВХранилище,
	                            ПутьКДаннымОбработкаНастройкиАдресВХранилище);
								
	Если ОписаниеОбработки.СписокДействийКнопкиОткрытия.Количество() = 1 Тогда
		бир_ОбработкиОбслуживанияКлиент.ОбработкаОбслуживанияВыборДействияКнопкиОткрытия(ПервыйЭлемент, Параметры);
	Иначе
		ОповещениеВыбораДействияКнопкиОткрытия = Новый ОписаниеОповещения("ОбработкаОбслуживанияВыборДействияКнопкиОткрытия", бир_ОбработкиОбслуживанияКлиент, Параметры);
	
		Форма.ПоказатьВыборИзМеню(ОповещениеВыбораДействияКнопкиОткрытия, ОписаниеОбработки.СписокДействийКнопкиОткрытия, Элемент);
	КонецЕсли;
	
КонецПроцедуры // ОбработкаОбслуживанияОткрытие()

// Процедура - продолжение обработчика события "Открытие" элемента выбора обработки обслуживания в форме
//             после выполнения выбора элемента из меню
//
// Параметры:
//  ВыбранныйЭлемент - ЭлементСпискаЗначений    - выбранный пункт меню
//  Параметры        - Структура                - параметры переданные из обработчика события "Открытие"
//
Процедура ОбработкаОбслуживанияВыборДействияКнопкиОткрытия(ВыбранныйЭлемент, Параметры) Экспорт
	
	Если ВыбранныйЭлемент = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Форма                                        = Параметры.Форма;
	ОписаниеОбработки                            = Параметры.ОписаниеОбработки;
	ПутьКДаннымОбработкаАдресВХранилище          = Параметры.ПутьКДаннымОбработкаАдресВХранилище;
	ПутьКДаннымОбработкаНастройкиАдресВХранилище = Параметры.ПутьКДаннымОбработкаНастройкиАдресВХранилище;
	
	Если Лев(ВыбранныйЭлемент.Значение, 13) = "ОткрытьФорму_" Тогда
		
		ПараметрыОткрытия = Новый Структура("ОбработкаНастройкиАдресВХранилище", Форма[ПутьКДаннымОбработкаНастройкиАдресВХранилище]);
		
		ФормаОбработки = ФормаОбработкиОбслуживания(Форма[ПутьКДаннымОбработкаАдресВХранилище],
		                                            ОписаниеОбработки.ИмяОбработки,
		                                            Сред(ВыбранныйЭлемент.Значение, 14),
		                                            ПараметрыОткрытия,
		                                            Форма);
		
		Если ФормаОбработки = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		ФормаОбработки.РежимОткрытияОкна = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
		
		ФормаОбработки.Открыть();
		
	ИначеЕсли Лев(ВыбранныйЭлемент.Значение, 17) = "ВыполнитьКоманду_" Тогда
		
		ПараметрыОткрытия = Новый Структура("ОбработкаНастройкиАдресВХранилище", Форма[ПутьКДаннымОбработкаНастройкиАдресВХранилище]);
		
		ФормаОбработки = ФормаОбработкиОбслуживания(Форма[ПутьКДаннымОбработкаАдресВХранилище],
		                                            ОписаниеОбработки.ИмяОбработки,
		                                            ОписаниеОбработки.ФормаОбработчиковКоманд,
		                                            ПараметрыОткрытия,
		                                            Форма);
		
		Попытка
			Выполнить("ФормаОбработки." + Сред(ВыбранныйЭлемент.Значение, 18));
		Исключение
			ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		КонецПопытки;
		
	КонецЕсли;
	
КонецПроцедуры // ОбработкаОбслуживанияВыборДействияКнопкиОткрытия()

#КонецОбласти

#Область РаботаСФормамиОбработокОбслуживания

// Функция - получить форму обработки обслуживания
//
// Параметры:
//  АдресОбработки       - Строка               - имя встроенной обработки или адрес обработки во временном хранилище
//  ИмяОбработки         - Строка               - имя по которым будет подключена внешняя обработка
//  ИмяФормы             - Строка               - имя получаемой формы обработки обслуживания
//  ПараметрыОткрытия    - Структура            - параметры, передаваемые в форму обработки при создании
//  Владелец             - УправляемаяФорма,	- владелец формы обработки
//                         ЭлементФормы
// 
// Возвращаемое значение:
//  УправляемаяФорма    - созданная форма обработки обслуживания
//
Функция ФормаОбработкиОбслуживания(АдресОбработки, ИмяОбработки = "", ИмяФормы = "", ПараметрыОткрытия = Неопределено, Владелец = Неопределено) Экспорт
	
	ОписаниеОбработки = бир_ОбработкиОбслуживанияВызовСервера.ПолучитьОписаниеОбработкиОбслуживания(АдресОбработки, ИмяОбработки);
	
	ИмяФормы = ?(ИмяФормы = "", ОписаниеОбработки.ФормаОбработчиковКоманд, ИмяФормы);
	
	ПутьКФорме = ?(ОписаниеОбработки.ЭтоВнешняяОбработка, "ВнешняяОбработка.", "Обработка.") + ОписаниеОбработки.ИмяОбработки + "." + ИмяФормы;
	
	ФормаНастройки = Неопределено;
	Попытка
		ФормаНастройки = ПолучитьФорму(ПутьКФорме, ПараметрыОткрытия, Владелец);
	Исключение
		ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
	КонецПопытки;
	
	Возврат ФормаНастройки;
	
КонецФункции // ФормаОбработкиОбслуживания()

#КонецОбласти // РаботаСФормамиОбработокОбслуживания

#КонецОбласти // ПрограммныйИнтерфейс
