////////////////////////////////////////////////////////////////////////////////
// Подсистема "Обработка событий (EventHUB)". (Основной модуль)
//
////////////////////////////////////////////////////////////////////////////////


#Область ПрограммныйИнтерфейс

#Область РегистрацияСобытий

// Функция - получить обработчики событий
//
// Параметры:
//  Источник          - СправочникСсылка.ИдентификаторыОбъектовМетаданных, - источник возникновения события,
//                      СправочникСсылка.ИдентификаторыОбъектовРасширений,   либо тип объекта системы,
//                      СправочникСсылка.бир_СобытияТочкиВозникновения       либо внешний источник
//  События           - Массив из СправочникСсылка.бир_События             - массив событий для получения обработчиков,
//                                                                           если НЕОПРЕДЕЛЕНО, то возвращаются все события,
//                                                                           для которых были зарегистрированы обработчики
// Возвращаемое значение:
//  Соответствие                                                           - соответствие событий и их обработчиков
//    *Ключ         - СправочникСсылка.бир_События                           - событие
//    *Значение     - Массив Из СправочникСсылка.бир_СобытияОбработчики      - массив обработчиков события
//
Функция ПолучитьОбработчикиСобытий(Источник, События = Неопределено) Экспорт
	
	СобытияИОбработчики = Новый Соответствие();
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	СобытияНазначенныеОбработчики.Событие КАК Событие,
	                      |	СобытияНазначенныеОбработчики.ИсточникВозникновения,
	                      |	СобытияНазначенныеОбработчики.Обработчик,
	                      |	СобытияНазначенныеОбработчики.ОтложеннаяОбработка,
	                      |	СобытияНазначенныеОбработчики.РучнаяОбработка,
	                      |	СобытияНазначенныеОбработчики.ОжидатьЗавершения,
	                      |	СобытияНазначенныеОбработчики.ОбрабатыватьНаСервере,
	                      |	СобытияНазначенныеОбработчики.ОбрабатыватьНаКлиенте,
	                      |	СобытияНазначенныеОбработчики.Приоритет КАК Приоритет
	                      |ИЗ
	                      |	РегистрСведений.бир_СобытияНазначенныеОбработчики КАК СобытияНазначенныеОбработчики
	                      |ГДЕ
	                      |	СобытияНазначенныеОбработчики.ИсточникВозникновения = &Источник
	                      |	И (СобытияНазначенныеОбработчики.Событие В (&События)
	                      |			ИЛИ &ВсеСобытия = ИСТИНА)
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	Приоритет
	                      |ИТОГИ ПО
	                      |	Событие");
	
	МассивСобытий = Новый Массив();
	ВсеСобытия = Ложь;
	
	Если ТипЗнч(События) = Тип("Массив") Тогда
		МассивСобытий = События;
	ИначеЕсли ТипЗнч(События) = Тип("СправочникСсылка.бир_События") Тогда
		МассивСобытий.Добавить(События);
	Иначе
		ВсеСобытия = Истина;
	КонецЕсли; 
	
	Запрос.УстановитьПараметр("События"   , МассивСобытий);
	Запрос.УстановитьПараметр("ВсеСобытия", ВсеСобытия);
	Запрос.УстановитьПараметр("Источник"  , Источник);
	
	Попытка
		Результат = Запрос.Выполнить();
	Исключение
		ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());

		СобытияТекст = "для всех событий";
		Если МассивСобытий.Количество() = 1 Тогда
			СобытияТекст = СтрШаблон("события ""%1""", МассивСобытий[0]);
		ИначеЕсли МассивСобытий.Количество() > 1 Тогда
			Для Каждого ТекСобытие Из МассивСобытий Цикл
				СобытияТекст = СтрШаблон("%1%2%3",
				                         ?(СобытияТекст = "для всех событий", "", СобытияТекст),
				                         ?(СобытияТекст = "для всех событий", "", ", "),
				                         ТекСобытие);
			КонецЦикла;
			СобытияТекст = СтрШаблон("событий ""%1""", СобытияТекст);
		КонецЕсли;
		
		ТекстОшибки = СтрШаблон("При получении обработчиков %1 для источника ""%2"" произошла ошибка:%3%4",
		                        СобытияТекст,
								СокрЛП(Источник),
								Символы.ПС,
		                        ТекстОшибки);

		ЗаписьЖурналаРегистрации("Обработка событий.Получение обработчиков",
		                         УровеньЖурналаРегистрации.Ошибка,
								 Источник.Метаданные(),
								 Источник,
								 ТекстОшибки);
		Возврат СобытияИОбработчики;
	КонецПопытки;
	
	ВыборкаСобытий = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаСобытий.Следующий() Цикл
	
		МассивОбработчиков = Новый Массив();
		
		ВыборкаОбработчиков = ВыборкаСобытий.Выбрать();
		
		Пока ВыборкаОбработчиков.Следующий() Цикл
		
			ОбработчикСобытия = Новый Структура("Обработчик,
												|ОтложеннаяОбработка,
												|РучнаяОбработка,
												|ОжидатьЗавершения,
												|ОбрабатыватьНаСервере,
												|ОбрабатыватьНаКлиенте");
			ЗаполнитьЗначенияСвойств(ОбработчикСобытия, ВыборкаОбработчиков);
			
		    МассивОбработчиков.Добавить(ОбработчикСобытия);
			
		КонецЦикла; 
		
		СобытияИОбработчики.Вставить(ВыборкаСобытий.Событие, МассивОбработчиков);
		
	КонецЦикла; 
	
	Возврат СобытияИОбработчики;
	
КонецФункции // ПолучитьОбработчикиСобытий()

// Функция - выполняет проверку условий регистрации события
//
// Параметры:
//  Источник             - Объект, НаборЗаписей            - объект - источник возникновения события
//  Событие              - СправочникСсылка.бир_События    - проверяемое событие
//  ПараметрыПодписки    - Структура                       - параметры обработчика подписки на событие,
//                                                           в котором выполняется проверка
//  ПараметрыСобытия     - Структура                       - после выполнения содержит параметры, связанные с событием,
//                                                           установленные в обработке проверки
// 
// Возвращаемое значение:
//  Булево    - Истина - событие наступило, Ложь - в противном случае
//
Функция ПроверитьНаступлениеСобытия(Источник, Событие, ПараметрыПодписки, ПараметрыСобытия = Неопределено) Экспорт
	
	Результат = Ложь;
	
	Если ПараметрыПодписки.Свойство("Отказ") Тогда
		Если ПараметрыПодписки.Отказ Тогда
			Возврат Результат;
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ ТипЗнч(ПараметрыСобытия) = Тип("Структура") Тогда
		ПараметрыСобытия = Новый Структура();
		ПараметрыСобытия.Вставить("РезультатПроверки", "");
		ПараметрыСобытия.Вставить("ОшибкаПроверки", Ложь);
	КонецЕсли;
	
	ВремОбработка = Событие.Обработка.Получить();
	ВремОбработка = ?(ТипЗнч(ВремОбработка) = Тип("Строка"), ВремОбработка, ПолучитьНавигационнуюСсылку(Событие, "Обработка"));
	
	ОбработкаОбъект = бир_ОбработкиОбслуживания.ПолучитьОбработкуОбъект(ВремОбработка);
	
	Попытка
		УстановитьПривилегированныйРежим(Истина);
		Результат = ОбработкаОбъект.ПроверитьНаступлениеСобытия(Источник, Событие, ПараметрыПодписки, ПараметрыСобытия);
		УстановитьПривилегированныйРежим(Ложь);
	Исключение
		ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ТекстОшибки = СтрШаблон("При проверке возникновения события ""%1"" для источника ""%2""
		                        |в подписке ""%3"" произошла ошибка:%4%5",
		                        СокрЛП(Событие),
								СокрЛП(Источник),
								ПараметрыПодписки.МоментПроверки,
								Символы.ПС,
		                        ТекстОшибки);
								
		ЗаписьЖурналаРегистрации("Обработка событий.Проверка наступления события",
		                         УровеньЖурналаРегистрации.Ошибка,
								 Источник.Метаданные(),
								 СсылкаНаОбъект(Источник),
								 ТекстОшибки);
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции // ПроверитьНаступлениеСобытия()

// Функция - выполняет проверку условий регистрации событий и регистрирует события если условия выполняются,
//			 вызывается из обработчиков подписок на события
//
// Параметры:
//  Источник          - СправочникСсылка.ИдентификаторыОбъектовМетаданных, - источник возникновения события,
//                      СправочникСсылка.ИдентификаторыОбъектовРасширений,   либо тип объекта системы,
//                      СправочникСсылка.бир_СобытияТочкиВозникновения       либо внешний источник
//  ПараметрыПодписки - Структура                                          - параметры обработчика подписки на событие,
//                                                                           в котором которого выполняется проверка
//
Процедура ПроверитьЗарегистрироватьВозникшиеСобытия(Источник, ПараметрыПодписки)
	
	Если ПараметрыПодписки.Свойство("Отказ") Тогда
		Если ПараметрыПодписки.Отказ Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	ИдОбъектаМетаданных = Неопределено;
	//Оптимизация: Проверяем, был ли получен ранее идентификатор метаданных, если нет то получаем
	//и помещаем в доп. свойства объекта
	Если НЕ Источник.ДополнительныеСвойства.Свойство("бир_События_ИдОбъектаМетаданных", ИдОбъектаМетаданных) Тогда
		ИдОбъектаМетаданных = ИдентификаторОбъектаМетаданных(ТипЗнч(Источник));
		Источник.ДополнительныеСвойства.Вставить("бир_События_ИдОбъектаМетаданных", ИдОбъектаМетаданных);
	КонецЕсли;
	
	//Помещаем идентификатор метаданных в структуру параметров подписки для возможного использования в обработчике
	Если НЕ ТипЗнч(ПараметрыПодписки) = Тип("Структура") Тогда
		ПараметрыПодписки = Новый Структура();
	КонецЕсли;
	ПараметрыПодписки.Вставить("ИдОбъектаМетаданных", ИдОбъектаМетаданных);
	
	СобытияДляПроверки = Неопределено;
	//Оптимизация: Проверяем, был ли получен ранее список событий для проверки, если нет то получаем
	//и помещаем в доп. свойства объекта
	Если НЕ Источник.ДополнительныеСвойства.Свойство("бир_События_СобытияДляПроверки", СобытияДляПроверки) Тогда
		СобытияДляПроверки = ПолучитьОбработчикиСобытий(ИдОбъектаМетаданных);
		Источник.ДополнительныеСвойства.Вставить("бир_События_СобытияДляПроверки", СобытияДляПроверки);
	КонецЕсли;
	
	Для Каждого ТекСобытие Из СобытияДляПроверки Цикл
	
		ЕстьАктивныеОбработчики = Ложь;
		
		Для Каждого ТекОбработчик Из ТекСобытие.Значение Цикл
			Если ТекОбработчик.ОбрабатыватьНаСервере ИЛИ ТекОбработчик.ОбрабатыватьНаКлиенте Тогда
				ЕстьАктивныеОбработчики = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если НЕ ЕстьАктивныеОбработчики Тогда
			Продолжить;
		КонецЕсли;
		
		ПараметрыСобытия = Новый Структура();
		ПараметрыСобытия.Вставить("РезультатПроверки", "");
		ПараметрыСобытия.Вставить("ОшибкаПроверки", Ложь);
		
		//Передаем ссылку на источник события вместе с параметрами события, если он является ссылочным типом.
		//В обработчике проверки возникновения события ссылка может быть переопределена
		ПараметрыСобытия.Вставить("Источник", СсылкаНаОбъект(Источник));
		
		//Передаем текущего пользователя вместе с параметрами события.
		//В обработчике проверки возникновения события пользователь может быть переопределен
		ПараметрыСобытия.Вставить("Пользователь", ТекущийПользователь());
		
		РезультатПроверки = ПроверитьНаступлениеСобытия(Источник, ТекСобытие.Ключ, ПараметрыПодписки, ПараметрыСобытия);
		
		Если РезультатПроверки = Ложь И НЕ ПараметрыСобытия.ОшибкаПроверки Тогда
			Продолжить;
		КонецЕсли;
		
		ТочкаВозникновения = Справочники.бир_СобытияТочкиВозникновения.ЭтаИБ;
		ИдСобытия          = СокрЛП(Новый УникальныйИдентификатор());
		ДатаСобытия        = ТекущаяУниверсальнаяДата();
		МоментСобытия      = ТекущаяУниверсальнаяДатаВМиллисекундах();
		
		ОписаниеСобытия = СтруктураОписанияСобытия(ТочкаВозникновения,
		                                           ИдСобытия,
		                                           ПараметрыСобытия.Источник,
		                                           ТекСобытие.Ключ,
		                                           ДатаСобытия,
		                                           МоментСобытия,
		                                           ИдСобытия,
		                                           ИдОбъектаМетаданных);
		НачатьОбработкуСобытия(ОписаниеСобытия,
		                       ПараметрыСобытия.Пользователь,
		                       ТекСобытие.Значение,
		                       ПараметрыСобытия);
	КонецЦикла;
	
КонецПроцедуры // ПроверитьЗарегистрироватьВозникшиеСобытия()

#КонецОбласти // РегистрацияСобытий

#Область ОбработкаСобытий

// Процедура - регистрирует обработчики события и запускает их выполнение
//
// Параметры:
//  ОписаниеСобытия      - Структура              - описание события (см. СтруктураОписанияСобытия())
//  Пользователь         - СправочникСсылка       - пользователь, от имени которого регистрируется событие
//                         .Пользователи
//  Обработчики          - Массив из Структура    - массив описаний (структура) обработчиков события
//  ПараметрыСобытия     - Структура              - параметры, сформированные при возникновении события
//
Процедура НачатьОбработкуСобытия(ОписаниеСобытия, Пользователь, Обработчики, ПараметрыСобытия) Экспорт
	
	Если ПараметрыСобытия.Свойство("__Тип") И ПараметрыСобытия.__Тип = "Структура" Тогда
		СтруктураПараметров = ПараметрыСобытия;
	Иначе
		СтруктураПараметров = ПреобразованиеДанных().ЗначениеВСтруктуру(ПараметрыСобытия);
	КонецЕсли;

	//Регистрируем событие в регистре сведений бир_События
	НаборЗаписей = РегистрыСведений.бир_События.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ТочкаВозникновения.Установить(ОписаниеСобытия.ТочкаВозникновения);
	НаборЗаписей.Отбор.Ид.Установить(ОписаниеСобытия.ИдСобытия);
	
	Запись = НаборЗаписей.Добавить();
	Запись.ТочкаВозникновения = ОписаниеСобытия.ТочкаВозникновения;
	Запись.Ид                 = ОписаниеСобытия.ИдСобытия;
	Запись.Дата               = ОписаниеСобытия.Дата;
	Запись.Момент             = ОписаниеСобытия.Момент;
	Запись.Событие            = ОписаниеСобытия.Событие;
	Запись.ТипИсточника       = ОписаниеСобытия.ТипИсточника;
	Запись.Источник           = ОписаниеСобытия.Источник;
	Запись.ИдПервичный        = ОписаниеСобытия.ИдПервичный;
	Запись.Пользователь       = Пользователь;
	Запись.Параметры          = ПреобразованиеДанных().ЗаписатьОписаниеОбъектаВJSON(СтруктураПараметров);
	Запись.Ошибка             = ПараметрыСобытия.ОшибкаПроверки;
	Запись.РезультатПроверки  = ПараметрыСобытия.РезультатПроверки;
	
	Попытка
		НаборЗаписей.Записать();
	Исключение
		ПараметрыСобытия.ОшибкаПроверки = Истина;
		
		ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ТекстОшибки = СтрШаблон("При регистрации возникновения события ""%1"" для источника ""%2"" произошла ошибка:%3%4",
		                        ОписаниеСобытия.Событие,
		                        ОписаниеСобытия.Источник,
		                        Символы.ПС,
		                        ТекстОшибки);
		
		ЗаписьЖурналаРегистрации("Обработка событий.Регистрация наступления события",
		                         УровеньЖурналаРегистрации.Ошибка,
		                         ОписаниеСобытия.Источник.Метаданные(),
		                         ОписаниеСобытия.Источник,
		                         ТекстОшибки);
	КонецПопытки;
		
	//Если при проверке возникновения события возникла ошибка, прекращаем обработку
	Если ПараметрыСобытия.ОшибкаПроверки Тогда	
		Возврат;
	КонецЕсли;
	
	НаборЗаписей = РегистрыСведений.бир_СобытияОбработка.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ТочкаВозникновения.Установить(ОписаниеСобытия.ТочкаВозникновения);
	НаборЗаписей.Отбор.Ид.Установить(ОписаниеСобытия.ИдСобытия);
	
	НаборЗаписейНаКлиенте = РегистрыСведений.бир_СобытияОбработкаНаКлиенте.СоздатьНаборЗаписей();
	НаборЗаписейНаКлиенте.Отбор.ТочкаВозникновения.Установить(ОписаниеСобытия.ТочкаВозникновения);
	НаборЗаписейНаКлиенте.Отбор.Ид.Установить(ОписаниеСобытия.ИдСобытия);
	
	//Первый проход: Регистрируем обработчики событий для обработки
	Для Каждого ТекОбработчик Из Обработчики Цикл
	
		Если ТекОбработчик.ОбрабатыватьНаКлиенте Тогда
			МассивПользователей = ПолучитьПользователей(ОписаниеСобытия, ТекОбработчик.Обработчик, ПараметрыСобытия);
			
			Для Каждого ТекПользователь Из МассивПользователей Цикл
				Запись = НаборЗаписейНаКлиенте.Добавить();
				Запись.ТочкаВозникновения = ОписаниеСобытия.ТочкаВозникновения;
				Запись.Ид                 = ОписаниеСобытия.ИдСобытия;
				Запись.Событие            = ОписаниеСобытия.Событие;
				Запись.Обработчик         = ТекОбработчик.Обработчик;
				Запись.Пользователь       = ТекПользователь;
			КонецЦикла;
		КонецЕсли;
		
		Если ТекОбработчик.ОбрабатыватьНаСервере Тогда
			Запись = НаборЗаписей.Добавить();
			Запись.ТочкаВозникновения = ОписаниеСобытия.ТочкаВозникновения;
			Запись.Ид                 = ОписаниеСобытия.ИдСобытия;
			Запись.Событие            = ОписаниеСобытия.Событие;
			Запись.Обработчик         = ТекОбработчик.Обработчик;
			Запись.РучнаяОбработка    = ТекОбработчик.РучнаяОбработка;
		КонецЕсли;
		
	КонецЦикла;
		
	Если НаборЗаписей.Количество() > 0 Тогда
		НаборЗаписей.Записать();
	КонецЕсли;
		
	Если НаборЗаписейНаКлиенте.Количество() > 0 Тогда
		НаборЗаписейНаКлиенте.Записать();
	КонецЕсли;
	
	//Второй проход: Выполняем обработку событий на сервере
	Для Каждого ТекОбработчик Из Обработчики Цикл
		
		Если НЕ ТекОбработчик.ОбрабатыватьНаСервере Тогда
			Продолжить;
		КонецЕсли;
			
		Если ТекОбработчик.ОтложеннаяОбработка ИЛИ ТекОбработчик.РучнаяОбработка Тогда
			Продолжить;
		КонецЕсли;
			
		Если ТекОбработчик.ОжидатьЗавершения Тогда
			ВыполнитьОбработчикСобытия(ОписаниеСобытия, ТекОбработчик.Обработчик, ПараметрыСобытия);
		Иначе
			ВыполнитьОбработчикСобытияВФоне(ОписаниеСобытия, ТекОбработчик.Обработчик, ПараметрыСобытия);
		КонецЕсли;
		 
	КонецЦикла;
	
КонецПроцедуры // НачатьОбработкуСобытия()

// Функция - получает список пользователей, для которых будет выполнен обработчик события на клиенте
//
// Параметры:
//  ОписаниеСобытия     - Структура                  - описание события (см. бир_События.СтруктураОписанияСобытия())
//  Обработчик          - СправочникСсылка           - обработчик события
//                        .бир_СобытияОбработчики
//  ПараметрыСобытия    - Структура                  - параметры, сформированные при возникновении события//
//
// Возвращаемое значение:
//  Массив из СправочникСсылка.Пользователи    - список пользователей
//
Функция ПолучитьПользователей(ОписаниеСобытия, Обработчик, ПараметрыСобытия) Экспорт
	
	Если НЕ ТипЗнч(ОписаниеСобытия.ТочкаВозникновения) = Тип("СправочникСсылка.бир_СобытияТочкиВозникновения") Тогда
		ОписаниеСобытия.ТочкаВозникновения = Справочники.бир_СобытияТочкиВозникновения.ЭтаИБ;
	КонецЕсли;
	
	ВремОбработка = Обработчик.Обработка.Получить();
	ВремОбработка = ?(ТипЗнч(ВремОбработка) = Тип("Строка"), ВремОбработка, ПолучитьНавигационнуюСсылку(Обработчик, "Обработка"));
	
	ОбработкаОбъект = бир_ОбработкиОбслуживания.ПолучитьОбработкуОбъект(ВремОбработка);
	
	Попытка
		Результат = Новый Массив();
		УстановитьПривилегированныйРежим(Истина);
		Результат = ОбработкаОбъект.ПолучитьПользователей(ОписаниеСобытия, Обработчик, ПараметрыСобытия);
		УстановитьПривилегированныйРежим(Ложь);
	Исключение
		ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ТекстОшибки = СтрШаблон("При получении пользователей для обработки события ""%1"" для источника ""%2""
		                        |произошла ошибка:%3%4",
		                        СокрЛП(ОписаниеСобытия.Событие),
								СокрЛП(ОписаниеСобытия.Источник),
								Символы.ПС,
		                        ТекстОшибки);
		ПараметрыСобытия.Вставить("РезультатОбработки", ТекстОшибки);
								
		ЗаписьЖурналаРегистрации("Обработка событий.Получение пользователей",
		                         УровеньЖурналаРегистрации.Ошибка,
								 ОписаниеСобытия.Источник.Метаданные(),
								 СсылкаНаОбъект(ОписаниеСобытия.Источник),
								 ТекстОшибки);
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции // ПолучитьПользователей()

// Процедура - выполняет обработчик события
//
// Параметры:
//  ОписаниеСобытия     - Структура                 - описание события (см. бир_События.СтруктураОписанияСобытия())
//  Обработчик          - СправочникСсылка			- обработчик события
//                        .бир_СобытияОбработчики
//  ПараметрыСобытия    - Структура                 - параметры, сформированные при возникновении события
//
Процедура ВыполнитьОбработчикСобытия(ОписаниеСобытия, Обработчик, ПараметрыСобытия) Экспорт
	
	Если НЕ ТипЗнч(ОписаниеСобытия.ТочкаВозникновения) = Тип("СправочникСсылка.бир_СобытияТочкиВозникновения") Тогда
		ОписаниеСобытия.ТочкаВозникновения = Справочники.бир_СобытияТочкиВозникновения.ЭтаИБ;
	КонецЕсли;
	
	ПараметрыСобытия.Вставить("РезультатОбработки", "");
	ПараметрыСобытия.Вставить("ОшибкаОбработки", Ложь);
	
	ВремОбработка = Обработчик.Обработка.Получить();
	ВремОбработка = ?(ТипЗнч(ВремОбработка) = Тип("Строка"), ВремОбработка, ПолучитьНавигационнуюСсылку(Обработчик, "Обработка"));
	
	ОбработкаОбъект = бир_ОбработкиОбслуживания.ПолучитьОбработкуОбъект(ВремОбработка);
	
	Попытка
		УстановитьПривилегированныйРежим(Истина);
		Результат = ОбработкаОбъект.ОбработатьСобытие(ОписаниеСобытия, Обработчик, ПараметрыСобытия);
		УстановитьПривилегированныйРежим(Ложь);
	Исключение
		ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ТекстОшибки = СтрШаблон("При выполнении обработчика ""%1"" события ""%2"" для источника ""%3""
		                        |произошла ошибка:%4%5",
		                        СокрЛП(Обработчик),
		                        СокрЛП(ОписаниеСобытия.Событие),
		                        СокрЛП(ОписаниеСобытия.Источник),
		                        Символы.ПС,
		                        ТекстОшибки);
		ПараметрыСобытия.Вставить("РезультатОбработки", ТекстОшибки);
		ПараметрыСобытия.Вставить("ОшибкаОбработки", Истина);
	КонецПопытки;
	
	ЗаписатьРезультатОбработкиСобытия(ОписаниеСобытия,
	                                  Обработчик,
	                                  Результат,
	                                  ПараметрыСобытия.РезультатОбработки,
	                                  ПараметрыСобытия.ОшибкаОбработки);
	
КонецПроцедуры // ВыполнитьОбработчикСобытия()

// Процедура - запускает выполнение обработчика события в фоне
//
// Параметры:
//  ОписаниеСобытия     - Структура                 - описание события (см. бир_События.СтруктураОписанияСобытия())
//  Обработчик          - СправочникСсылка			- обработчик события
//                        .бир_СобытияОбработчики
//  ПараметрыСобытия    - Структура                 - параметры, сформированные при возникновении события
//
Процедура ВыполнитьОбработчикСобытияВФоне(ОписаниеСобытия, Обработчик, ПараметрыСобытия) Экспорт
	
	Если НЕ ТипЗнч(ОписаниеСобытия.ТочкаВозникновения) = Тип("СправочникСсылка.бир_СобытияТочкиВозникновения") Тогда
		ОписаниеСобытия.ТочкаВозникновения = Справочники.бир_СобытияТочкиВозникновения.ЭтаИБ;
	КонецЕсли;
	
	ПараметрыОбработчика = Новый Массив();
	ПараметрыОбработчика.Добавить(ОписаниеСобытия);
	ПараметрыОбработчика.Добавить(Обработчик);
	ПараметрыОбработчика.Добавить(ПараметрыСобытия);
	
	КлючЗадания         = СтрШаблон("%1_%2", ОписаниеСобытия.ИдСобытия, Обработчик.Ид);
	НаименованиеЗадания = СтрШаблон("%1 (%2) - %3",
	                                СокрЛП(ОписаниеСобытия.Событие),
	                                СокрЛП(ОписаниеСобытия.Источник),
	                                СокрЛП(Обработчик));

	ФоновыеЗадания.Выполнить("бир_События.ВыполнитьОбработчикСобытия",
	                         ПараметрыОбработчика,
	                         КлючЗадания,
	                         НаименованиеЗадания);
	
КонецПроцедуры // ВыполнитьОбработчикСобытияВФоне()

// Процедура - записывает результат обработки события
//
// Параметры:
//  ОписаниеСобытия     - Структура                 - описание события (см. бир_События.СтруктураОписанияСобытия())
//  Обработчик          - СправочникСсылка          - обработчик события
//                        .бир_СобытияОбработчики
//  Обработано          - Булево                    - Истина - Обработка события выполнена; Ложь - в противном случае
//  РезультатОбработки  - Строка                    - описание результата обработки или текст ошибки
//  ОшибкаОбработки     - Булево                    - Истина - В процессе выполнения обработки произошла ошибка;
//                                                    Ложь - в противном случае
//
Процедура ЗаписатьРезультатОбработкиСобытия(ОписаниеСобытия,
                                            Знач Обработчик,
                                            Знач Обработано = Неопределено,
                                            Знач РезультатОбработки = "",
                                            Знач ОшибкаОбработки = Ложь) Экспорт
	
	Если НЕ ТипЗнч(ОписаниеСобытия.ТочкаВозникновения) = Тип("СправочникСсылка.бир_СобытияТочкиВозникновения") Тогда
		ОписаниеСобытия.ТочкаВозникновения = Справочники.бир_СобытияТочкиВозникновения.ЭтаИБ;
	КонецЕсли;
	
	НаборЗаписей = РегистрыСведений.бир_СобытияОбработка.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ТочкаВозникновения.Установить(ОписаниеСобытия.ТочкаВозникновения);
	НаборЗаписей.Отбор.Ид.Установить(ОписаниеСобытия.ИдСобытия);
	НаборЗаписей.Отбор.Обработчик.Установить(Обработчик);
	
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() = 0 Тогда
		Запись = НаборЗаписей.Добавить();
	Иначе
		Запись = НаборЗаписей[0];
	КонецЕсли;
	
	Если НЕ ТипЗнч(Обработано) = Тип("Булево") Тогда
		Обработано = Запись.Обработано;
	КонецЕсли;

	Запись.ТочкаВозникновения = ОписаниеСобытия.ТочкаВозникновения;
	Запись.Ид                 = ОписаниеСобытия.ИдСобытия;
	Запись.Событие            = ?(ОписаниеСобытия.Событие = Неопределено, Запись.Событие, ОписаниеСобытия.Событие);
	Запись.Обработчик         = Обработчик;
	Запись.Обработано         = ?(ОшибкаОбработки, Истина, Обработано);
	Запись.РезультатОбработки = РезультатОбработки;
	Запись.Ошибка             = ОшибкаОбработки;

	НаборЗаписей.Записать(Истина);
	
	Если ОшибкаОбработки Тогда
		ТекстОшибки = СтрШаблон("Ошибка выполнения обработчика ""%1"" события ""%2"":%3%4",
		                        СокрЛП(Запись.Обработчик),
		                        СокрЛП(Запись.Событие),
		                        Символы.ПС,
		                        РезультатОбработки);
		ЗаписьЖурналаРегистрации("Обработка событий.Выполнение обработчика",
		                         УровеньЖурналаРегистрации.Ошибка,
								 ОписаниеСобытия.Источник.Метаданные(),
								 СсылкаНаОбъект(ОписаниеСобытия.Источник),
								 ТекстОшибки);
	КонецЕсли;

КонецПроцедуры // ЗаписатьРезультатОбработкиСобытия()

// Процедура - выполняет отложенное выполнение зарегистрированных обработчиков событий (регламентное задание)
//
Процедура СобытияОтложеннаяОбработка() Экспорт
	
	ЗапросОбработчиков = Новый Запрос("ВЫБРАТЬ
	                                  |	События.ТочкаВозникновения КАК ТочкаВозникновения,
	                                  |	События.Ид КАК Ид,
	                                  |	События.Дата КАК Дата,
	                                  |	События.Момент КАК Момент,
	                                  |	События.Событие КАК Событие,
	                                  |	События.Источник КАК Источник,
	                                  |	События.ИдПервичный КАК ИдПервичный,
	                                  |	События.Параметры КАК Параметры,
	                                  |	События.Пользователь КАК Пользователь,
	                                  |	НазначенныеОбработчики.Обработчик КАК Обработчик,
	                                  |	НазначенныеОбработчики.ОжидатьЗавершения КАК ОжидатьЗавершения
	                                  |ИЗ
	                                  |	РегистрСведений.бир_События КАК События
	                                  |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бир_СобытияНазначенныеОбработчики КАК НазначенныеОбработчики
	                                  |		ПО События.Событие = НазначенныеОбработчики.Событие
	                                  |			И (НЕ События.Ошибка)
	                                  |			И (События.ТипИсточника = НазначенныеОбработчики.ИсточникВозникновения
	                                  |				ИЛИ События.Источник = НазначенныеОбработчики.ИсточникВозникновения)
	                                  //|		И (НазначенныеОбработчики.ОтложеннаяОбработка) TODO: Тут вопрос, нужно ли проверять флаг отложенной обработки или обрабатывать все "не обработанное"
	                                  |			И (НазначенныеОбработчики.ОбрабатыватьНаСервере)
	                                  |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бир_СобытияОбработка КАК СобытияОбработка
	                                  |		ПО События.Ид = СобытияОбработка.Ид
	                                  |			И НЕ СобытияОбработка.РучнаяОбработка
	                                  |			И (НазначенныеОбработчики.Обработчик = СобытияОбработка.Обработчик)
	                                  |ГДЕ
	                                  |	НЕ(ЕСТЬNULL(СобытияОбработка.Обработано, ЛОЖЬ)
	                                  |				ИЛИ ЕСТЬNULL(СобытияОбработка.Ошибка, ЛОЖЬ))
	                                  |
	                                  |УПОРЯДОЧИТЬ ПО
	                                  |	События.Дата,
	                                  |	События.Момент,
	                                  |	События.Ид");
	  
	Результат = ЗапросОбработчиков.Выполнить();
	
	ВыборкаОбработчиков = Результат.Выбрать();
	
	Пока ВыборкаОбработчиков.Следующий() Цикл
		
		ОписаниеСобытия = СтруктураОписанияСобытия(ВыборкаОбработчиков.ТочкаВозникновения,
		                                           ВыборкаОбработчиков.Ид,
		                                           ВыборкаОбработчиков.Источник,
		                                           ВыборкаОбработчиков.Событие,
		                                           ВыборкаОбработчиков.Дата,
		                                           ВыборкаОбработчиков.Момент);
		
		ПараметрыСобытия = ПреобразованиеДанных().ПрочитатьОписаниеОбъектаИзJSON(ВыборкаОбработчиков.Параметры);
		ПараметрыСобытия = ПреобразованиеДанных().ЗначениеИзСтруктуры(ПараметрыСобытия, Истина, Ложь);
		
		Если ВыборкаОбработчиков.ОжидатьЗавершения Тогда
			ВыполнитьОбработчикСобытия(ОписаниеСобытия,
			                           ВыборкаОбработчиков.Обработчик,
			                           ПараметрыСобытия);
		Иначе
			ВыполнитьОбработчикСобытияВФоне(ОписаниеСобытия,
			                                ВыборкаОбработчиков.Обработчик,
			                                ПараметрыСобытия);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры // СобытияОтложеннаяОбработка()

// Процедура - выполняет удаление событий с истекшим временем жизни и их обработчиков из журналов (регламентное задание)
//
Процедура СобытияУдалениеОбработанных() Экспорт
	
	ЗапросУдаляемых = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	                               |	ЖурналСобытий.ТочкаВозникновения КАК ТочкаВозникновения,
	                               |	ЖурналСобытий.Ид КАК Ид
	                               |ИЗ
	                               |	РегистрСведений.бир_События КАК ЖурналСобытий
	                               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бир_События КАК События
	                               |		ПО ЖурналСобытий.Событие = События.Ссылка
	                               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	                               |			СобытияОбработка.ТочкаВозникновения КАК ТочкаВозникновения,
	                               |			СобытияОбработка.Ид КАК Ид,
	                               |			МАКСИМУМ(СобытияОбработка.Ошибка) КАК Ошибка
	                               |		ИЗ
	                               |			(ВЫБРАТЬ
	                               |				СобытияОбработка.ТочкаВозникновения КАК ТочкаВозникновения,
	                               |				СобытияОбработка.Ид КАК Ид,
	                               |				СобытияОбработка.Ошибка КАК Ошибка
	                               |			ИЗ
	                               |				РегистрСведений.бир_СобытияОбработка КАК СобытияОбработка
	                               |			ГДЕ
	                               |				СобытияОбработка.Ошибка
	                               |			
	                               |			ОБЪЕДИНИТЬ
	                               |			
	                               |			ВЫБРАТЬ
	                               |				СобытияОбработка.ТочкаВозникновения,
	                               |				СобытияОбработка.Ид,
	                               |				СобытияОбработка.Ошибка
	                               |			ИЗ
	                               |				РегистрСведений.бир_СобытияОбработкаНаКлиенте КАК СобытияОбработка) КАК СобытияОбработка
	                               |		ГДЕ
	                               |			СобытияОбработка.Ошибка
	                               |		
	                               |		СГРУППИРОВАТЬ ПО
	                               |			СобытияОбработка.ТочкаВозникновения,
	                               |			СобытияОбработка.Ид) КАК СобытияОбработка
	                               |		ПО ЖурналСобытий.ТочкаВозникновения = СобытияОбработка.ТочкаВозникновения
	                               |			И ЖурналСобытий.Ид = СобытияОбработка.Ид
	                               |ГДЕ
	                               |	ДОБАВИТЬКДАТЕ(ЖурналСобытий.Дата, СЕКУНДА, События.ВремяЖизни) < &ТекущаяДата
	                               |	И ЕСТЬNULL(События.ВремяЖизни, 0) > 0
	                               |	И (НЕ(ЖурналСобытий.Ошибка
	                               |					ИЛИ ЕСТЬNULL(СобытияОбработка.Ошибка, ЛОЖЬ))
	                               |			ИЛИ События.УдалятьСобытияСОшибками)");
									  
	ЗапросУдаляемых.УстановитьПараметр("ТекущаяДата", ТекущаяУниверсальнаяДата());
	
	Результат = ЗапросУдаляемых.Выполнить();
	
	ВыборкаУдаляемых = Результат.Выбрать();
	
	Пока ВыборкаУдаляемых.Следующий() Цикл
		
		НаборЗаписей = РегистрыСведений.бир_СобытияОбработкаНаКлиенте.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ТочкаВозникновения.Установить(ВыборкаУдаляемых.ТочкаВозникновения);
		НаборЗаписей.Отбор.Ид.Установить(ВыборкаУдаляемых.Ид);
		
		НаборЗаписей.Записать();
		
		НаборЗаписей = РегистрыСведений.бир_СобытияОбработка.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ТочкаВозникновения.Установить(ВыборкаУдаляемых.ТочкаВозникновения);
		НаборЗаписей.Отбор.Ид.Установить(ВыборкаУдаляемых.Ид);
		
		НаборЗаписей.Записать();
		
		НаборЗаписей = РегистрыСведений.бир_События.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ТочкаВозникновения.Установить(ВыборкаУдаляемых.ТочкаВозникновения);
		НаборЗаписей.Отбор.Ид.Установить(ВыборкаУдаляемых.Ид);
		
		НаборЗаписей.Записать();
		
	КонецЦикла;
	
КонецПроцедуры // СобытияУдалениеОбработанных()

// Функция - получает список обработчиков событий, которые необходимо выполнить на стороне клиента
// 
// Возвращаемое значение:
//  Массив из Структура    - список обработчиков событий
//
Функция ОбработчикиСобытийДляВыполненияНаКлиенте() Экспорт

	ЗапросОбработчиков = Новый Запрос("ВЫБРАТЬ
	                                  |	СобытияОбработка.Ид КАК Ид,
	                                  |	СобытияОбработка.ТочкаВозникновения КАК ТочкаВозникновения,
	                                  |	События.Источник,
	                                  |	События.Событие,
	                                  |	События.Дата КАК Дата,
	                                  |	События.Момент КАК Момент,
	                                  |	События.ТипИсточника,
	                                  |	События.ИдПервичный КАК ИдПервичный,
	                                  |	СобытияОбработка.Пользователь,
	                                  |	События.Параметры,
	                                  |	СобытияОбработка.Обработчик
	                                  |ИЗ
	                                  |	РегистрСведений.бир_СобытияОбработкаНаКлиенте КАК СобытияОбработка
	                                  |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бир_События КАК События
	                                  |		ПО СобытияОбработка.Ид = События.Ид
	                                  |ГДЕ
	                                  |	НЕ СобытияОбработка.Обработано
	                                  |	И СобытияОбработка.Пользователь = &ТекущийПользователь
	                                  |
	                                  |УПОРЯДОЧИТЬ ПО
	                                  |	Дата,
	                                  |	Момент,
	                                  |	Ид");
	ЗапросОбработчиков.УстановитьПараметр("ТекущийПользователь", Пользователи.ТекущийПользователь());
	
	Результат = ЗапросОбработчиков.Выполнить();
	
	МассивОбработчиков = Новый Массив();
	
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		СтруктураПараметров = ПреобразованиеДанных().ПрочитатьОписаниеОбъектаИзJSON(Выборка.Параметры);
		Параметры = ПреобразованиеДанных().ЗначениеИзСтруктуры(СтруктураПараметров, Истина, Ложь);
	
		ОписаниеОбработчика = СтруктураОписанияСобытия(Выборка.ТочкаВозникновения,
		                                               Выборка.Ид,
		                                               Выборка.Источник,
		                                               Выборка.Событие,
		                                               Выборка.Дата,
		                                               Выборка.Момент,
		                                               Выборка.ИдПервичный,
		                                               Выборка.ТипИсточника);
		ОписаниеОбработчика.Вставить("Пользователь", Выборка.Пользователь);
		ОписаниеОбработчика.Вставить("Обработчик"  , Выборка.Обработчик);
		Описаниеобработчика.Вставить("Параметры"   , Параметры);
		
		МассивОбработчиков.Добавить(ОписаниеОбработчика);
	КонецЦикла;
	
	Возврат МассивОбработчиков;
	
КонецФункции // ОбработчикиСобытийДляВыполненияНаКлиенте()

// Процедура - записывает результат обработки события на стороне клиента
//
// Параметры:
//  ОписаниеСобытия     - Структура                 - описание события (см. бир_События.СтруктураОписанияСобытия())
//  Обработчик          - СправочникСсылка          - обработчик события
//                        .бир_СобытияОбработчики
//  Пользователь        - СправочникСсылка          - пользователь для которого выполнялась обработка события
//                        .Пользователи
//  Обработано          - Булево                    - Истина - Обработка события выполнена; Ложь - в противном случае
//  РезультатОбработки  - Строка                    - описание результата обработки или текст ошибки
//  ОшибкаОбработки     - Булево                    - Истина - В процессе выполнения обработки произошла ошибка;
//                                                    Ложь - в противном случае
//
Процедура ЗаписатьРезультатОбработкиСобытияНаКлиенте(ОписаниеСобытия,
                                                     Знач Обработчик,
                                                     Знач Пользователь = Неопределено,
                                                     Знач Обработано = Неопределено,
                                                     Знач РезультатОбработки = "",
                                                     Знач ОшибкаОбработки = Ложь) Экспорт
	
	Если НЕ ТипЗнч(ОписаниеСобытия.ТочкаВозникновения) = Тип("СправочникСсылка.бир_СобытияТочкиВозникновения") Тогда
		ОписаниеСобытия.ТочкаВозникновения = Справочники.бир_СобытияТочкиВозникновения.ЭтаИБ;
	КонецЕсли;
	
	Если НЕ ТипЗнч(Пользователь) = Тип("СправочникСсылка.Пользователи") Тогда
		Пользователь = Пользователи.ТекущийПользователь();
	КонецЕсли;
	
	НаборЗаписей = РегистрыСведений.бир_СобытияОбработкаНаКлиенте.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ТочкаВозникновения.Установить(ОписаниеСобытия.ТочкаВозникновения);
	НаборЗаписей.Отбор.Ид.Установить(ОписаниеСобытия.ИдСобытия);
	НаборЗаписей.Отбор.Обработчик.Установить(Обработчик);
	НаборЗаписей.Отбор.Пользователь.Установить(Пользователь);
	
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() = 0 Тогда
		Запись = НаборЗаписей.Добавить();
	Иначе
		Запись = НаборЗаписей[0];
	КонецЕсли;
	
	Если НЕ ТипЗнч(Обработано) = Тип("Булево") Тогда
		Обработано = Запись.Обработано;
	КонецЕсли;

	Запись.ТочкаВозникновения = ОписаниеСобытия.ТочкаВозникновения;
	Запись.Ид                 = ОписаниеСобытия.ИдСобытия;
	Запись.Событие            = ?(ОписаниеСобытия.Событие = Неопределено, Запись.Событие, ОписаниеСобытия.Событие);
	Запись.Обработчик         = Обработчик;
	Запись.Пользователь       = Пользователь;
	Запись.Обработано         = ?(ОшибкаОбработки, Истина, Обработано);
	Запись.РезультатОбработки = РезультатОбработки;
	Запись.Ошибка             = ОшибкаОбработки;
	
	НаборЗаписей.Записать(Истина);

	Если ОшибкаОбработки Тогда
		ТекстОшибки = СтрШаблон("Ошибка выполнения обработчика ""%1"" события ""%2"":%3%4",
		                        СокрЛП(Запись.Обработчик),
		                        СокрЛП(Запись.Событие),
		                        Символы.ПС,
		                        РезультатОбработки);
		ЗаписьЖурналаРегистрации("Обработка событий.Выполнение обработчика на клиенте",
		                         УровеньЖурналаРегистрации.Ошибка,
								 ОписаниеСобытия.Источник.Метаданные(),
								 СсылкаНаОбъект(ОписаниеСобытия.Источник),
								 ТекстОшибки);
	КонецЕсли;

КонецПроцедуры // ЗаписатьРезультатОбработкиСобытияНаКлиенте()

#КонецОбласти // ОбработкаСобытий

#КонецОбласти // ПрограммныйИнтерфейс

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиПодписокНаСобытия

// Процедура - обработчик подписки на событие "ПриКопировании" для всех ссылочных объектов
//
// Параметры:
//  Источник             - ЛюбойОбъект    - объект в котором возникло событие
//  ОбъектКопирования    - ЛюбойОбъект    - исходный элемент, который является источником копирования
//
Процедура СобытияВсеОбъектыПриКопировании(Источник, ОбъектКопирования) Экспорт
	
	ПараметрыПодписки = Новый Структура();
	ПараметрыПодписки.Вставить("МоментПроверки"		, "ПриКопировании");
	ПараметрыПодписки.Вставить("ОбъектКопирования"	, ОбъектКопирования);
	
	ПроверитьЗарегистрироватьВозникшиеСобытия(Источник, ПараметрыПодписки);
	
КонецПроцедуры // СобытияВсеОбъектыПриКопировании()

// Процедура - обработчик подписки на событие "ПередЗаписью" для всех ссылочных объектов, кроме документов
//
// Параметры:
//  Источник    - ЛюбойОбъект    - объект в котором возникло событие
//  Отказ       - Булево         - Истина - отказ от продолжения обработки события;
//                                 Ложь - продолжить обработку события.
//
Процедура СобытияВсеОбъектыКромеДокументовПередЗаписью(Источник, Отказ) Экспорт
		
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыПодписки = Новый Структура();
	ПараметрыПодписки.Вставить("МоментПроверки"	, "ПередЗаписью");
	ПараметрыПодписки.Вставить("Отказ"			, Отказ);
	
	ПроверитьЗарегистрироватьВозникшиеСобытия(Источник, ПараметрыПодписки);
	
КонецПроцедуры // СобытияВсеОбъектыКромеДокументовПередЗаписью()

// Процедура - обработчик подписки на событие "ПередЗаписью" для документов
//
// Параметры:
//  Источник    - ДокументОбъект    - объект в котором возникло событие
//  Отказ       - Булево            - Истина - отказ от продолжения обработки события;
//                                    Ложь - продолжить обработку события.
//
Процедура СобытияДокументыПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
		
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыПодписки = Новый Структура();
	ПараметрыПодписки.Вставить("МоментПроверки"		, "ПередЗаписью");
	ПараметрыПодписки.Вставить("Отказ"				, Отказ);
	ПараметрыПодписки.Вставить("РежимЗаписи"		, РежимЗаписи);
	ПараметрыПодписки.Вставить("РежимПроведения"	, РежимПроведения);
	
	ПроверитьЗарегистрироватьВозникшиеСобытия(Источник, ПараметрыПодписки);
	
КонецПроцедуры // СобытияДокументыПередЗаписью()

// Процедура - обработчик подписки на событие "ПриЗаписи" для всех ссылочных объектов
//
// Параметры:
//  Источник    - ЛюбойОбъект    - объект в котором возникло событие
//  Отказ       - Булево         - Истина - отказ от продолжения обработки события;
//                                 Ложь - продолжить обработку события.
//
Процедура СобытияВсеОбъектыПриЗаписи(Источник, Отказ) Экспорт
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыПодписки = Новый Структура();
	ПараметрыПодписки.Вставить("МоментПроверки"	, "ПриЗаписи");
	ПараметрыПодписки.Вставить("Отказ"			, Отказ);
	
	ПроверитьЗарегистрироватьВозникшиеСобытия(Источник, ПараметрыПодписки);
	
КонецПроцедуры // СобытияВсеОбъектыПриЗаписи()

// Процедура - обработчик подписки на событие "ПередУдалением" для всех ссылочных объектов
//
// Параметры:
//  Источник    - ЛюбойОбъект    - объект в котором возникло событие
//  Отказ       - Булево         - Истина - отказ от продолжения обработки события;
//                                 Ложь - продолжить обработку события.
//
Процедура СобытияВсеОбъектыПередУдалением(Источник, Отказ) Экспорт
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыПодписки = Новый Структура();
	ПараметрыПодписки.Вставить("МоментПроверки"	, "ПередУдалением");
	ПараметрыПодписки.Вставить("Отказ"			, Отказ);
	
	ПроверитьЗарегистрироватьВозникшиеСобытия(Источник, ПараметрыПодписки);
	
КонецПроцедуры // СобытияВсеОбъектыПередУдалением()

// Процедура - обработчик подписки на событие "ОбработкаЗаполнения" для всех ссылочных объектов
//
// Параметры:
//  Источник             - ЛюбойОбъект   - объект в котором возникло событие
//  ДанныеЗаполнения     - Произвольный  - основание для заполнения
//  ТекстЗаполнения      - Строка        - текст для заполнения Наименования/Кода
//  СтандартнаяОбработка - Булево        - признак стандартной (системной) обработки события
//
Процедура СобытияВсеОбъектыОбработкаЗаполнения(Источник, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Экспорт
	
	ПараметрыПодписки = Новый Структура();
	ПараметрыПодписки.Вставить("МоментПроверки"			, "ОбработкаЗаполнения");
	ПараметрыПодписки.Вставить("ДанныеЗаполнения"		, ДанныеЗаполнения);
	ПараметрыПодписки.Вставить("ТекстЗаполнения"		, ТекстЗаполнения);
	ПараметрыПодписки.Вставить("СтандартнаяОбработка"	, СтандартнаяОбработка);
	
	ПроверитьЗарегистрироватьВозникшиеСобытия(Источник, ПараметрыПодписки);
	
КонецПроцедуры // СобытияВсеОбъектыОбработкаЗаполнения()

// Процедура - обработчик подписки на событие "ОбработкаПроверкиЗаполнения" для всех ссылочных объектов
//
// Параметры:
//  Источник             - ЛюбойОбъект    - объект в котором возникло событие
//  Отказ                - Булево         - Истина - отказ от продолжения обработки события;
//                                          Ложь - продолжить обработку события.
//  ПроверяемыеРеквизиты - Массив         - список путей к реквизитам, для которых будет выполнена проверка заполнения.
//
Процедура СобытияВсеОбъектыОбработкаПроверкиЗаполнения(Источник, Отказ, ПроверяемыеРеквизиты) Экспорт
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыПодписки = Новый Структура();
	ПараметрыПодписки.Вставить("МоментПроверки"			, "ОбработкаПроверкиЗаполнения");
	ПараметрыПодписки.Вставить("Отказ"					, Отказ);
	ПараметрыПодписки.Вставить("ПроверяемыеРеквизиты"	, ПроверяемыеРеквизиты);
	
	ПроверитьЗарегистрироватьВозникшиеСобытия(Источник, ПараметрыПодписки);
	
КонецПроцедуры // СобытияВсеОбъектыОбработкаПроверкиЗаполнения()

// Процедура - обработчик подписки на событие "ОбработкаПроведения" для документов
//
// Параметры:
//  Источник           - ДокументОбъект              - объект в котором возникло событие
//  Отказ              - Булево                      - Истина - отказ от продолжения обработки события;
//                                                     Ложь - продолжить обработку события.
//  РежимПроведения    - РежимПроведенияДокумента    - текущий режим проведения
//
Процедура СобытияДокументыОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт

	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыПодписки = Новый Структура();
	ПараметрыПодписки.Вставить("МоментПроверки"	, "ОбработкаПроведения");
	ПараметрыПодписки.Вставить("Отказ"			, Отказ);
	ПараметрыПодписки.Вставить("РежимПроведения", РежимПроведения);
	
	ПроверитьЗарегистрироватьВозникшиеСобытия(Источник, ПараметрыПодписки);
	
КонецПроцедуры // СобытияДокументыОбработкаПроведения()

// Процедура - обработчик подписки на событие "ОбработкаУдаленияПроведения" для документов
//
// Параметры:
//  Источник    - ДокументОбъект    - объект в котором возникло событие
//  Отказ       - Булево            - Истина - отказ от продолжения обработки события;
//                                    Ложь - продолжить обработку события.
//
Процедура СобытияДокументыОбработкаУдаленияПроведения(Источник, Отказ) Экспорт
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыПодписки = Новый Структура();
	ПараметрыПодписки.Вставить("МоментПроверки"	, "ОбработкаУдаленияПроведения");
	ПараметрыПодписки.Вставить("Отказ"			, Отказ);
	
	ПроверитьЗарегистрироватьВозникшиеСобытия(Источник, ПараметрыПодписки);
	
КонецПроцедуры // СобытияДокументыОбработкаУдаленияПроведения()

// Процедура - обработчик подписки на событие "ОбработкаИнтерактивнойАктивации" для бизнес-процессов и задач
//
// Параметры:
//  Источник             - БизнесПроцессОбъект,    - объект в котором возникло событие
//                         ЗадачаОбъект
//  СтандартнаяОбработка - Булево                  - признак стандартной (системной) обработки события
//
Процедура СобытияБизнессПроцессыЗадачиОбработкаИнтерактивнойАктивации(Источник, СтандартнаяОбработка) Экспорт
	
	ПараметрыПодписки = Новый Структура();
	ПараметрыПодписки.Вставить("МоментПроверки"			, "ОбработкаИнтерактивнойАктивации");
	ПараметрыПодписки.Вставить("СтандартнаяОбработка"	, СтандартнаяОбработка);
	
	ПроверитьЗарегистрироватьВозникшиеСобытия(Источник, ПараметрыПодписки);
	
КонецПроцедуры // СобытияБизнессПроцессыЗадачиОбработкаИнтерактивнойАктивации()

// Процедура - обработчик подписки на событие "ОбработкаПроверкиВыполнения" для задач
//
// Параметры:
//  Источник     - ЗадачаОбъект    - объект в котором возникло событие
//  Результат    - Булево          - Истина - задача выполнена
//
Процедура СобытияЗадачиОбработкаПроверкиВыполнения(Источник, Результат) Экспорт
	
	ПараметрыПодписки = Новый Структура();
	ПараметрыПодписки.Вставить("МоментПроверки"	, "ОбработкаПроверкиВыполнения");
	ПараметрыПодписки.Вставить("Результат"		, Результат);
	
	ПроверитьЗарегистрироватьВозникшиеСобытия(Источник, ПараметрыПодписки);
	
КонецПроцедуры // СобытияЗадачиОбработкаПроверкиВыполнения()

// Процедура - обработчик подписки на событие "ПередВыполнением" для задач
//
// Параметры:
//  Источник    - ЗадачаОбъект    - объект в котором возникло событие
//  Отказ       - Булево          - Истина - отказ от продолжения обработки события;
//                                  Ложь - продолжить обработку события.
//
Процедура СобытияЗадачиПередВыполнением(Источник, Отказ) Экспорт
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыПодписки = Новый Структура();
	ПараметрыПодписки.Вставить("МоментПроверки"	, "ПередВыполнением");
	ПараметрыПодписки.Вставить("Отказ"			, Отказ);
	
	ПроверитьЗарегистрироватьВозникшиеСобытия(Источник, ПараметрыПодписки);
	
КонецПроцедуры // СобытияЗадачиПередВыполнением()

// Процедура - обработчик подписки на событие "ПередИнтерактивнымВыполнением" для задач
//
// Параметры:
//  Источник    - ЗадачаОбъект    - объект в котором возникло событие
//  Отказ       - Булево          - Истина - отказ от продолжения обработки события;
//                                  Ложь - продолжить обработку события.
//
Процедура СобытияЗадачиПередИнтерактивнымВыполнением(Источник, Отказ) Экспорт
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыПодписки = Новый Структура();
	ПараметрыПодписки.Вставить("МоментПроверки"	, "ПередВыполнением");
	ПараметрыПодписки.Вставить("Отказ"			, Отказ);
	
	ПроверитьЗарегистрироватьВозникшиеСобытия(Источник, ПараметрыПодписки);
	
КонецПроцедуры // СобытияЗадачиПередИнтерактивнымВыполнением()

// Процедура - обработчик подписки на событие "ПриВыполнении" для задач
//
// Параметры:
//  Источник    - ЗадачаОбъект    - объект в котором возникло событие
//  Отказ       - Булево          - Истина - отказ от продолжения обработки события;
//                                  Ложь - продолжить обработку события.
//
Процедура СобытияЗадачиПриВыполнении(Источник, Отказ) Экспорт
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыПодписки = Новый Структура();
	ПараметрыПодписки.Вставить("МоментПроверки"	, "ПриВыполнении");
	ПараметрыПодписки.Вставить("Отказ"			, Отказ);
	
	ПроверитьЗарегистрироватьВозникшиеСобытия(Источник, ПараметрыПодписки);
	
КонецПроцедуры // СобытияЗадачиПриВыполнении()

// Процедура - обработчик подписки на событие "ОбработкаПроверкиЗаполнения" для всех наборов записей
//
// Параметры:
//  Источник             - НаборЗаписей     - набор записей регистра в котором возникло событие
//  Отказ                - Булево           - Истина - отказ от продолжения обработки события;
//                                            Ложь - продолжить обработку события.
//  ПроверяемыеРеквизиты - Массив           - Массив путей к реквизитам,
//                                            для которых будет выполнена проверка заполнения
//
Процедура СобытияВсеНаборыЗаписейОбработкаПроверкиЗаполнения(Источник, Отказ, ПроверяемыеРеквизиты) Экспорт
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыПодписки = Новый Структура();
	ПараметрыПодписки.Вставить("МоментПроверки"			, "ОбработкаПроверкиЗаполнения");
	ПараметрыПодписки.Вставить("Отказ"					, Отказ);
	ПараметрыПодписки.Вставить("ПроверяемыеРеквизиты"	, ПроверяемыеРеквизиты);
	
	ПроверитьЗарегистрироватьВозникшиеСобытия(Источник, ПараметрыПодписки);
	
КонецПроцедуры // СобытияВсеНаборыЗаписейОбработкаПроверкиЗаполнения()

// Процедура - обработчик подписки на событие "ПередЗаписью" для всех наборов записей, кроме регистров расчета
//
// Параметры:
//  Источник    - НаборЗаписей    - набор записей регистра в котором возникло событие
//  Отказ       - Булево          - Истина - отказ от продолжения обработки события;
//                                  Ложь - продолжить обработку события.
//  Замещение   - Булево          - Истина - заменить существующие данные;
//                                  Ложь - дополнить существующие данные
//
Процедура СобытияВсеНаборыЗаписейКромеРегистраРасчетовПередЗаписью(Источник, Отказ, Замещение) Экспорт
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыПодписки = Новый Структура();
	ПараметрыПодписки.Вставить("МоментПроверки"	, "ПередЗаписью");
	ПараметрыПодписки.Вставить("Отказ"			, Отказ);
	ПараметрыПодписки.Вставить("Замещение"		, Замещение);
	
	ПроверитьЗарегистрироватьВозникшиеСобытия(Источник, ПараметрыПодписки);
	
КонецПроцедуры // СобытияВсеНаборыЗаписейКромеРегистраРасчетовПередЗаписью()

// Процедура - обработчик подписки на событие "ПриЗаписи" для всех наборов записей, кроме регистров расчета
//
// Параметры:
//  Источник    - НаборЗаписей    - набор записей регистра в котором возникло событие
//  Отказ       - Булево          - Истина - отказ от продолжения обработки события;
//                                  Ложь - продолжить обработку события.
//  Замещение   - Булево          - Истина - заменить существующие данные;
//                                  Ложь - дополнить существующие данные
//
Процедура СобытияВсеНаборыЗаписейКромеРегистраРасчетовПриЗаписи(Источник, Отказ, Замещение) Экспорт
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыПодписки = Новый Структура();
	ПараметрыПодписки.Вставить("МоментПроверки"	, "ПриЗаписи");
	ПараметрыПодписки.Вставить("Отказ"			, Отказ);
	ПараметрыПодписки.Вставить("Замещение"		, Замещение);
	
	ПроверитьЗарегистрироватьВозникшиеСобытия(Источник, ПараметрыПодписки);
	
КонецПроцедуры // СобытияВсеНаборыЗаписейКромеРегистраРасчетовПриЗаписи()

// Процедура - События регистры сведений обработка заполнения
//
// Параметры:
//  Источник             - РегистрСведенийНаборЗаписей   - набор записей регистра в котором возникло событие
//  ДанныеЗаполнения     - Произвольный                  - основание для заполнения
//  СтандартнаяОбработка - Булево                        - признак стандартной (системной) обработки события
//
Процедура СобытияРегистрыСведенийОбработкаЗаполнения(Источник, ДанныеЗаполнения, СтандартнаяОбработка) Экспорт
	
	ПараметрыПодписки = Новый Структура();
	ПараметрыПодписки.Вставить("МоментПроверки"			, "ОбработкаЗаполнения");
	ПараметрыПодписки.Вставить("ДанныеЗаполнения"		, ДанныеЗаполнения);
	ПараметрыПодписки.Вставить("СтандартнаяОбработка"	, СтандартнаяОбработка);
	
	ПроверитьЗарегистрироватьВозникшиеСобытия(Источник, ПараметрыПодписки);
	
КонецПроцедуры // СобытияРегистрыСведенийОбработкаЗаполнения()

#КонецОбласти // ОбработчикиПодписокНаСобытия

#Область СлужебныеПроцедурыИФункции

// Функция - возвращает структуру описания события
//
// Параметры:
//  ТочкаВозникновения   - СправочникСсылка
//                         .бир_СобытияТочкиВозникновения     - точка (ИБ), где возникло событие
//  ИдСобытия            - Строка                             - уникальный идентификатор события
//  Источник             - ЛюбаяСсылка                        - источник возникновения события
//  Событие              - СправочникСсылка.бир_События       - возникшее событие
//  Дата                 - Дата                               - дата и время возникновения события
//  Момент               - Число                              - момет возникновения события в миллисекундах
//  ИдПервичный          - Строка                             - уникальный идентификатор первичного события
//                                                              (для трассировки)
//	ТипИсточника         - СправочникСсылка                   - тип источника возникновения события
//                         .ИдентификаторыОбъектовМетаданных,   (тип объекта системы)
//                         СправочникСсылка
//                         .ИдентификаторыОбъектовРасширений
//
// Возвращаемое значение:
//  Структура                                                  - структура описание события
//    *ТочкаВозникновения   - СправочникСсылка
//                            .бир_СобытияТочкиВозникновения     - точка (ИБ), где возникло событие
//    *ИдСобытия            - Строка                             - уникальный идентификатор события
//    *Источник             - ЛюбаяСсылка                        - источник возникновения события
//    *Событие              - СправочникСсылка.бир_События       - возникшее событие
//    *Дата                 - Дата                               - дата и время возникновения события
//    *Момент               - Число                              - момет возникновения события в миллисекундах
//    *ИдПервичный          - Строка                             - уникальный идентификатор первичного события
//                                                                (для трассировки)
//    *ТипИсточника         - СправочникСсылка                   - тип источника возникновения события
//                            .ИдентификаторыОбъектовМетаданных,   (тип объекта системы)
//                            СправочникСсылка
//                            .ИдентификаторыОбъектовРасширений
Функция СтруктураОписанияСобытия(ТочкаВозникновения = Неопределено,
                                 ИдСобытия = "",
                                 Источник = Неопределено,
                                 Событие = Неопределено,
                                 Дата = '00010101',
                                 Момент = 0,
                                 ИдПервичный = "",
                                 ТипИсточника = Неопределено) Экспорт

	Описание = Новый Структура();
	Описание.Вставить("ТочкаВозникновения", ТочкаВозникновения);
	Описание.Вставить("ИдСобытия"         , ИдСобытия);
	Описание.Вставить("Событие"           , Событие);
	Описание.Вставить("Источник"          , Источник);
	Описание.Вставить("Дата"              , Дата);
	Описание.Вставить("Момент"            , Момент);
	Описание.Вставить("ИдПервичный"       , ?(ЗначениеЗаполнено(ИдПервичный), ИдПервичный, ИдСобытия));
	Описание.Вставить("ТипИсточника"      , ТипИсточника);
	
	Возврат Описание;

КонецФункции // СтруктураОписанияСобытия()

// Функция - получает идентификатор объекта метаданных
//
// Параметры:
//  ОписаниеОбъектаМетаданных    - Тип, Строка, ОбъектМетаданных    - описание объекта для получения идентификатора
// 
// Возвращаемое значение:
//  СправочникСсылка.ИдентификаторыОбъектовМетаданных, - элемент справочника, идентификатор объекта
//  СправочникСсылка.ИдентификаторыОбъектовРаширений
//
Функция ИдентификаторОбъектаМетаданных(ОписаниеОбъектаМетаданных) Экспорт
	
	ТипОписанияОбъектаМетаданных = ТипЗнч(ОписаниеОбъектаМетаданных);
	Если ТипОписанияОбъектаМетаданных = Тип("Тип") Тогда
		
		ОбъектМетаданных = Метаданные.НайтиПоТипу(ОписаниеОбъектаМетаданных);
		Если ОбъектМетаданных = Неопределено Тогда
			Возврат Неопределено;
		Иначе
			ПолноеИмяОбъектаМетаданных = ОбъектМетаданных.ПолноеИмя();
		КонецЕсли;
		
	ИначеЕсли ТипОписанияОбъектаМетаданных = Тип("Строка") Тогда
		ПолноеИмяОбъектаМетаданных = ОписаниеОбъектаМетаданных;
	Иначе
		ПолноеИмяОбъектаМетаданных = ОписаниеОбъектаМетаданных.ПолноеИмя();
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ПолноеИмя", ПолноеИмяОбъектаМетаданных);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Идентификаторы.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ИдентификаторыОбъектовМетаданных КАК Идентификаторы
	|ГДЕ
	|	Идентификаторы.ПолноеИмя = &ПолноеИмя
	|	И НЕ Идентификаторы.ПометкаУдаления
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	Идентификаторы.Ссылка
	|ИЗ
	|	Справочник.ИдентификаторыОбъектовРасширений КАК Идентификаторы
	|ГДЕ
	|	Идентификаторы.ПолноеИмя = &ПолноеИмя
	|	И НЕ Идентификаторы.ПометкаУдаления";
	
	Результат = Запрос.Выполнить();
	
	Выгрузка = Результат.Выгрузить();
	
	Если Выгрузка.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат Выгрузка[0].Ссылка;
	
КонецФункции // ИдентификаторОбъектаМетаданных()

// Функция - получает текущего пользователя
//
// Возвращаемое значение:
//  СправочникСсылка.Пользователи - элемент справочника "Пользователи", соответствующий текущему пользователю
//
Функция ТекущийПользователь() Экспорт
	
	ТекущийПользователь = Неопределено;
	
	Попытка
		ТекущийПользователь = Вычислить("Пользователи.ТекущийПользователь()");
		Возврат ТекущийПользователь;
	Исключение
	КонецПопытки;
	
	Попытка
		ТекущийПользователь = Вычислить("ПользователиКлиентСервер.ТекущийПользователь()");
		Возврат ТекущийПользователь;
	Исключение
	КонецПопытки;
	
	Попытка
		ТекущийПользователь = Вычислить("ОбщегоНазначения.ТекущийПользователь()");
		Возврат ТекущийПользователь;
	Исключение
	КонецПопытки;
	
	Возврат ТекущийПользователь;
	
КонецФункции // ТекущийПользователь()

Функция СсылкаНаОбъект(Объект)

	СсылкаНаОбъект = Неопределено;
	Если ПреобразованиеДанных().ЭтоЗначениеСсылочногоТипа(Объект) Тогда
		СсылкаНаОбъект = Объект.Ссылка;
	КонецЕсли;
	
	Возврат СсылкаНаОбъект;

КонецФункции // СсылкаНаОбъект()

// Функция - Получает обработку сериализации значений
// 
// Возвращаемое значение:
//   ОбработкаОбъект    - обработка преобразования данных
//
Функция ПреобразованиеДанных()

	Возврат Обработки.бир_ПреобразованиеДанных.Создать(); 

КонецФункции // ПреобразованиеДанных()

#КонецОбласти // СлужебныеПроцедурыИФункции 

#КонецОбласти // СлужебныйПрограммныйИнтерфейс
