
&ИзменениеИКонтроль("ДобавитьСвойстваОбъектовМетаданных")
Процедура бир_ДобавитьСвойстваОбъектовМетаданных(Знач КоллекцияОбъектовМетаданных, Знач СвойстваКоллекции, Знач СвойстваОбъектовМетаданных, Знач ИдентификаторыКлючейРасширений, Знач ИменаПредопределенных, Знач ПолноеИмяРодителя, Знач ПолныйСинонимРодителя)


	ОбъектыРасширений = ИдентификаторыКлючейРасширений <> Неопределено;

	Для Каждого ОбъектМетаданных Из КоллекцияОбъектовМетаданных Цикл

		ПолноеИмя = ОбъектМетаданных.ПолноеИмя();
		Расширение = ОбъектМетаданных.РасширениеКонфигурации();
		ИмяРасширения           = ?(Расширение = Неопределено, "", Расширение.Имя);
		ИдентификаторРасширения = ?(Расширение = Неопределено, "", НРег(Расширение.УникальныйИдентификатор));
		ХешСуммаРасширения      = ?(Расширение = Неопределено, "", Base64Строка(Расширение.ХешСумма));
		Если ОбъектыРасширений И Расширение <> Неопределено Тогда
			КлючРасширения = НРег(ИмяРасширения) + " " + ХешСуммаРасширения;
			НовыйИдентификаторРасширения = ИдентификаторыКлючейРасширений.Получить(КлючРасширения);
			Если НовыйИдентификаторРасширения <> Неопределено
				И НовыйИдентификаторРасширения <> ИдентификаторРасширения Тогда
				ИдентификаторРасширения = НовыйИдентификаторРасширения;
			КонецЕсли;
		КонецЕсли;
		Если ЗначениеЗаполнено(ИмяРасширения) <> ОбъектыРасширений Тогда
			#Вставка
			Если СтрНайти(СвойстваКоллекции.ИмяВЕдЧисле, "Подсистема") <> 0 Тогда
				ДобавитьСвойстваОбъектовМетаданных(
					ОбъектМетаданных.Подсистемы,
					СвойстваКоллекции,
					СвойстваОбъектовМетаданных,
					ИдентификаторыКлючейРасширений,
					ИменаПредопределенных,
					ПолноеИмя,
					ОбъектМетаданных.Имя + ". ");
			КонецЕсли;
			#КонецВставки
			Продолжить;
		КонецЕсли;

		Если СтрНайти(СвойстваКоллекции.ИмяВЕдЧисле, "Подсистема") <> 0 Тогда
			МетаданныеНайтиПоПолномуИмени(ПолноеИмя);
		КонецЕсли;

		Если Не СвойстваКоллекции.БезДанных
			И Не СтандартныеПодсистемыСервер.ЭтоТаблицаРегистра(СвойстваКоллекции.ИмяВЕдЧисле)
			И СтрНайти(СвойстваКоллекции.ИмяВЕдЧисле, "Константа") = 0 Тогда

			ИмяТипаСсылки = СвойстваКоллекции.ИмяВЕдЧисле + "Ссылка." + ОбъектМетаданных.Имя;
			ОписаниеТипа = Новый ОписаниеТипов(ИмяТипаСсылки);
			ЗначениеПустойСсылки = ОписаниеТипа.ПривестиЗначение(Неопределено);
		Иначе
			ЗначениеПустойСсылки = Неопределено;
		КонецЕсли;

		#Вставка
		Если СвойстваОбъектовМетаданных.НайтиСтроки(Новый Структура("ПолноеИмя", ПолноеИмя)).Количество() > 0 Тогда
			Продолжить;
		КонецЕсли;
		#КонецВставки

		НоваяСтрока = СвойстваОбъектовМетаданных.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СвойстваКоллекции);
		НоваяСтрока.Родитель          = ИдентификаторКоллекции(СвойстваКоллекции.Идентификатор, ОбъектыРасширений);
		НоваяСтрока.Наименование      = ПредставлениеОбъектаМетаданных(ОбъектМетаданных, СвойстваКоллекции);
		НоваяСтрока.ПолноеИмя         = ПолноеИмя;
		НоваяСтрока.ПолноеИмяРодителя = ПолноеИмяРодителя;
		НоваяСтрока.Имя               = ОбъектМетаданных.Имя;

		НоваяСтрока.Синоним = ?(
		ЗначениеЗаполнено(ОбъектМетаданных.Синоним), ОбъектМетаданных.Синоним, ОбъектМетаданных.Имя);

		НоваяСтрока.ПолныйСиноним =
		ПолныйСинонимРодителя + СвойстваКоллекции.СинонимВЕдЧисле + ". " + НоваяСтрока.Синоним;

		НоваяСтрока.ЗначениеПустойСсылки    = ЗначениеПустойСсылки;
		НоваяСтрока.ОбъектМетаданных        = ОбъектМетаданных;
		НоваяСтрока.ИмяРасширения           = ИмяРасширения;
		НоваяСтрока.ИдентификаторРасширения = ИдентификаторРасширения;
		НоваяСтрока.ХешСуммаРасширения      = ХешСуммаРасширения;

		Если СвойстваКоллекции.Имя = "Подсистемы" Тогда
			ДобавитьСвойстваОбъектовМетаданных(
			ОбъектМетаданных.Подсистемы,
			СвойстваКоллекции,
			СвойстваОбъектовМетаданных,
			ИдентификаторыКлючейРасширений,
			ИменаПредопределенных,
			ПолноеИмя,
			НоваяСтрока.ПолныйСиноним + ". ");
		КонецЕсли;
		ИмяПредопределенного = СтрЗаменить(ПолноеИмя, ".", "");
		Если ИменаПредопределенных.Получить(ИмяПредопределенного) <> Неопределено Тогда
			НоваяСтрока.ИмяПредопределенныхДанных = ИмяПредопределенного;
			ИменаПредопределенных.Вставить(ИмяПредопределенного, Истина);
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры
