
// Функция - Обработчик запроса Get HTTP-сервиса EventsRegistered
//			возвращает список зарегистрированных событий
//
// Параметры:
//  Запрос	 - HTTP-запрос	 - Полученный HTTP-Запрос
// 
// Возвращаемое значение:
//  HTTP-ответ - Ответ сервиса, содержащий результат выполнения запроса
//
Функция ЗарегистрированныеСобытияGet(Запрос)
	
	МассивСобытий = бир_ВнешниеСобытияОбработкаЗапросов.ПолучитьСписокЗарегистрированныхСобытий();
	
	ЗаписьДанныхОтвета = Новый ЗаписьJSON();
	ЗаписьДанныхОтвета.УстановитьСтроку();
	
	НастройкиСериализации = Новый НастройкиСериализацииJSON();
	НастройкиСериализации.ВариантЗаписиДаты = ВариантЗаписиДатыJSON.УниверсальнаяДата;
	НастройкиСериализации.ФорматСериализацииДаты = ФорматДатыJSON.ISO;
	
	ЗаписатьJSON(ЗаписьДанныхОтвета, МассивСобытий, НастройкиСериализации);
	
	Ответ = Новый HTTPСервисОтвет(200);
	Ответ.Заголовки.Вставить("Content-Type", "application/json; charset=utf-8");
	Ответ.УстановитьТелоИзСтроки(ЗаписьДанныхОтвета.Закрыть());
	
	Возврат Ответ;
	
КонецФункции // ЗарегистрированныеСобытияGet()

// Функция - Обработчик запроса POST HTTP-сервиса Event
//			регистрирует переданные события и запускает обработку событий
//
// Параметры:
//  Запрос	 - HTTP-запрос	 - Полученный HTTP-Запрос
// 
// Возвращаемое значение:
//  HTTP-ответ - Ответ сервиса, содержащий результат выполнения запроса
//
Функция ЗарегистрироватьСобытиеPost(Запрос)
	
	ТекстЗапроса = Запрос.ПолучитьТелоКакСтроку();
	
	Попытка
		ПараметрыЗапросаHTTP = бир_ВнешниеИБОбработкаЗапросов.ПрочитатьПараметрыЗапросаHTTP(Запрос);
	Исключение
		ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ТекстОшибки = СтрШаблон("Ошибка чтения описаний событий:%1%2%1описания событий:%1%3",
		                        Символы.ПС,
								ТекстОшибки,
								ТекстЗапроса);
		Ответ = Новый HTTPСервисОтвет(400, ТекстОшибки);
		Ответ.Заголовки.Вставить("Content-Type", "application/html; charset=utf-8");
		Возврат Ответ;
	КонецПопытки;
	
	Если НЕ ТипЗнч(ПараметрыЗапросаHTTP.Тело.Параметры) = Тип("Массив") Тогда
		Ответ = Новый HTTPСервисОтвет(400, "Описание событий должно иметь тип ""Массив""!");
		Ответ.Заголовки.Вставить("Content-Type", "application/html; charset=utf-8");
		Возврат Ответ;
	КонецЕсли;
	
	ОписаниеОшибок = "";
	
	РезультатРегистрации = бир_ВнешниеСобытияОбработкаЗапросов.ЗарегистрироватьСобытия(ПараметрыЗапросаHTTP.Тело.Параметры, ОписаниеОшибок);
	
	Если НЕ РезультатРегистрации Тогда
		Ответ = Новый HTTPСервисОтвет(400, ОписаниеОшибок);
		Ответ.Заголовки.Вставить("Content-Type", "application/html; charset=utf-8");
		Возврат Ответ;
	КонецЕсли;
	
	Ответ = Новый HTTPСервисОтвет(200);
	
	Возврат Ответ;
	
КонецФункции // ЗарегистрироватьСобытиеPost()

// Функция - Обработчик запроса Get HTTP-сервиса EventPoints
//			возвращает список зарегистрированных точек возникновения событий
//
// Параметры:
//  Запрос	 - HTTP-запрос	 - Полученный HTTP-Запрос
// 
// Возвращаемое значение:
//  HTTP-ответ - Ответ сервиса, содержащий результат выполнения запроса
//
Функция ТочкиВозникновенияСобытийGet(Запрос)
	
	МассивТочек = бир_ВнешниеСобытияОбработкаЗапросов.ПолучитьСписокТочекВозникновенияСобытий();
	
	ЗаписьДанныхОтвета = Новый ЗаписьJSON();
	ЗаписьДанныхОтвета.УстановитьСтроку();
	
	НастройкиСериализации = Новый НастройкиСериализацииJSON();
	НастройкиСериализации.ВариантЗаписиДаты = ВариантЗаписиДатыJSON.УниверсальнаяДата;
	НастройкиСериализации.ФорматСериализацииДаты = ФорматДатыJSON.ISO;
	
	ЗаписатьJSON(ЗаписьДанныхОтвета, МассивТочек, НастройкиСериализации);
	
	Ответ = Новый HTTPСервисОтвет(200);
	Ответ.Заголовки.Вставить("Content-Type", "application/json; charset=utf-8");
	Ответ.УстановитьТелоИзСтроки(ЗаписьДанныхОтвета.Закрыть());
	
	Возврат Ответ;
	
КонецФункции // ТочкиВозникновенияСобытийGet()

// Функция - Обработчик запроса Get HTTP-сервиса ThisEventPoint
//			возвращает описание точки возникновения событий, соответствующее текущей ИБ
//
// Параметры:
//  Запрос	 - HTTP-запрос	 - Полученный HTTP-Запрос
// 
// Возвращаемое значение:
//  HTTP-ответ - Ответ сервиса, содержащий результат выполнения запроса
//
Функция ЭтаТочкаВозникновенияСобытийGet(Запрос)
	
	МассивТочек = бир_ВнешниеСобытияОбработкаЗапросов.ПолучитьСписокТочекВозникновенияСобытий(Истина);
	
	ЗаписьДанныхОтвета = Новый ЗаписьJSON();
	ЗаписьДанныхОтвета.УстановитьСтроку();
	
	НастройкиСериализации = Новый НастройкиСериализацииJSON();
	НастройкиСериализации.ВариантЗаписиДаты = ВариантЗаписиДатыJSON.УниверсальнаяДата;
	НастройкиСериализации.ФорматСериализацииДаты = ФорматДатыJSON.ISO;
	
	ЗаписатьJSON(ЗаписьДанныхОтвета, МассивТочек, НастройкиСериализации);
	
	Ответ = Новый HTTPСервисОтвет(200);
	Ответ.Заголовки.Вставить("Content-Type", "application/json; charset=utf-8");
	Ответ.УстановитьТелоИзСтроки(ЗаписьДанныхОтвета.Закрыть());
	
	Возврат Ответ;
	
КонецФункции // ЭтаТочкаВозникновенияСобытийGet()
