
#Область ОбработчикиСобытий

// Функция - метод GET http-сервиса GetQueriesList
// возвращает список запросов из справочника запросов
//
// Параметры:
//   Запрос    - HTTPСервисЗапрос    - http-запрос
//
// Возвращаемое значение:
//   HTTPСервисОтвет    - http-ответ
//
Функция ЗапросыGet(Запрос)
	
	Попытка
		ПараметрыЗапросаHTTP = бир_ВнешниеИБОбработкаЗапросов.ПрочитатьПараметрыЗапросаHTTP(Запрос);
	Исключение
		ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		Возврат бир_ВнешниеИБОбработкаЗапросов.ОтветОшибкаОбработкиHTTP(ТекстОшибки);
	КонецПопытки;

	Поля = ПараметрыЗапросаHTTP.Параметры.Получить("fields");

	Попытка
		Результат = бир_ВнешниеИБОбработкаЗапросов.Запросы(Поля);
	Исключение
		ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		Возврат бир_ВнешниеИБОбработкаЗапросов.ОтветОшибкаОбработкиHTTP(ТекстОшибки, Истина);
	КонецПопытки;

	Возврат бир_ВнешниеИБОбработкаЗапросов.ОтветРезультатОбработкиHTTP(Результат);

КонецФункции // ЗапросыGet()

// Функция - метод GET http-сервиса GetQueryDescription
// возвращает описание запроса
//
// Параметры:
//   Запрос    - HTTPСервисЗапрос    - http-запрос
//
// Возвращаемое значение:
//   HTTPСервисОтвет    - http-ответ
//
Функция ОписаниеЗапросаGet(Запрос)
	
	Попытка
		ПараметрыЗапросаHTTP = бир_ВнешниеИБОбработкаЗапросов.ПрочитатьПараметрыЗапросаHTTP(Запрос);
	Исключение
		ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		Возврат бир_ВнешниеИБОбработкаЗапросов.ОтветОшибкаОбработкиHTTP(ТекстОшибки);
	КонецПопытки;

	ИдЗапроса = ПараметрыЗапросаHTTP.Параметры.Получить("id");
	Если НЕ ЗначениеЗаполнено(ИдЗапроса) Тогда
		ТекстОшибки = "Не указан идентификатор запроса!";
		Возврат бир_ВнешниеИБОбработкаЗапросов.ОтветОшибкаОбработкиHTTP(ТекстОшибки);
	КонецЕсли;

	Поля = ПараметрыЗапросаHTTP.Параметры.Получить("fields");
	
	Попытка
		Результат = бир_ВнешниеИБОбработкаЗапросов.ОписаниеЗапроса(ИдЗапроса, Поля);
	Исключение
		ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		Возврат бир_ВнешниеИБОбработкаЗапросов.ОтветОшибкаОбработкиHTTP(ТекстОшибки, Истина);
	КонецПопытки;

	Возврат бир_ВнешниеИБОбработкаЗапросов.ОтветРезультатОбработкиHTTP(Результат);

КонецФункции // ОписаниеЗапросаGet()

// Функция - метод GET http-сервиса GetQueryResult
// возвращает результат выполнения переданного запроса без параметров
//
// Параметры:
//   Запрос    - HTTPСервисЗапрос    - http-запрос
//
// Возвращаемое значение:
//   HTTPСервисОтвет    - http-ответ
//
Функция РезультатЗапросаGet(Запрос)
	
	Попытка
		ПараметрыЗапросаHTTP = бир_ВнешниеИБОбработкаЗапросов.ПрочитатьПараметрыЗапросаHTTP(Запрос);
	Исключение
		ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		Возврат бир_ВнешниеИБОбработкаЗапросов.ОтветОшибкаОбработкиHTTP(ТекстОшибки);
	КонецПопытки;

	ИдЗапроса = ПараметрыЗапросаHTTP.Параметры.Получить("id");
	Если НЕ ЗначениеЗаполнено(ИдЗапроса) Тогда
		ТекстОшибки = "Не указан идентификатор запроса!";
		Возврат бир_ВнешниеИБОбработкаЗапросов.ОтветОшибкаОбработкиHTTP(ТекстОшибки);
	КонецЕсли;
	
	ПараметрыЗапроса = Новый Массив();

	Попытка
		Результат = бир_ВнешниеИБОбработкаЗапросов.РезультатЗапроса(ИдЗапроса, ПараметрыЗапроса);
	Исключение
		ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		Возврат бир_ВнешниеИБОбработкаЗапросов.ОтветОшибкаОбработкиHTTP(ТекстОшибки, Истина);
	КонецПопытки;

	Возврат бир_ВнешниеИБОбработкаЗапросов.ОтветРезультатОбработкиHTTP(Результат);

КонецФункции // РезультатЗапросаGet()

// Функция - метод POST http-сервиса GetQueryResult
// возвращает результат выполнения переданного запроса
//
// Параметры:
//   Запрос    - HTTPСервисЗапрос    - http-запрос
//
// Возвращаемое значение:
//   HTTPСервисОтвет    - http-ответ
//
Функция РезультатЗапросаPost(Запрос)

	Попытка
		ПараметрыЗапросаHTTP = бир_ВнешниеИБОбработкаЗапросов.ПрочитатьПараметрыЗапросаHTTP(Запрос);
	Исключение
		ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		Возврат бир_ВнешниеИБОбработкаЗапросов.ОтветОшибкаОбработкиHTTP(ТекстОшибки);
	КонецПопытки;

	ИдЗапроса = ПараметрыЗапросаHTTP.Параметры.Получить("id");
	Если НЕ ЗначениеЗаполнено(ИдЗапроса) И ПараметрыЗапросаHTTP.Тело.Свойство("Ид") Тогда
		ИдЗапроса = ПараметрыЗапросаHTTP.Тело.Ид;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(ИдЗапроса) Тогда
		ТекстОшибки = "Не указан идентификатор запроса!";
		Возврат бир_ВнешниеИБОбработкаЗапросов.ОтветОшибкаОбработкиHTTP(ТекстОшибки);
	КонецЕсли;

	ПараметрыЗапроса = Новый Массив();
	Если ПараметрыЗапросаHTTP.Тело.Свойство("Параметры") Тогда
		ПараметрыЗапроса = ПараметрыЗапросаHTTP.Тело.Параметры;
	КонецЕсли;
	ДополнительныеПараметры = Новый Структура();
	Если ПараметрыЗапросаHTTP.Тело.Свойство("ДополнительныеПараметры") Тогда
		ДополнительныеПараметры = ПараметрыЗапросаHTTP.Тело.ДополнительныеПараметры;
	КонецЕсли;

	Попытка
		Результат = бир_ВнешниеИБОбработкаЗапросов.РезультатЗапроса(ИдЗапроса, ПараметрыЗапроса, ДополнительныеПараметры);
	Исключение
		ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		Возврат бир_ВнешниеИБОбработкаЗапросов.ОтветОшибкаОбработкиHTTP(ТекстОшибки, Истина);
	КонецПопытки;

	Возврат бир_ВнешниеИБОбработкаЗапросов.ОтветРезультатОбработкиHTTP(Результат);

КонецФункции // РезультатЗапросаPost()

#КонецОбласти
