
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ОбработкаНастройкиАдресВХранилище") Тогда
		ОбработкаНастройкиАдресВХранилище = Параметры.ОбработкаНастройкиАдресВХранилище;
	
		Настройки = ПолучитьИзВременногоХранилища(ОбработкаНастройкиАдресВХранилище);
	
		Если ТипЗнч(Настройки) = Тип("Структура") Тогда
			Попытка
				СобытияВнешнихИБДляПередачи.Загрузить(Настройки.СобытияВнешнихИБДляПередачи);
			Исключение
				ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			КонецПопытки;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры // ПриСозданииНаСервере()

#КонецОбласти // ОбработчикиСобытийФормы

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СохранитьНастройку(Команда)
	
	СохранитьНастройкуНаСервере();
	
	Оповестить("ИзмененыНастройки", ЭтаФорма.ВладелецФормы, ЭтаФорма);
	
	Закрыть("ИзмененыНастройки");
	
КонецПроцедуры // СохранитьНастройку()

&НаСервере
Процедура СохранитьНастройкуНаСервере()
	
	Настройка = Новый Структура();
	Настройка.Вставить("СобытияВнешнихИБДляПередачи", СобытияВнешнихИБДляПередачи.Выгрузить());
	
	ПоместитьВоВременноеХранилище(Настройка, ОбработкаНастройкиАдресВХранилище);
	
КонецПроцедуры // СохранитьНастройкуНаСервере()

&НаКлиенте
Процедура ВнешниеИБДляПередачиСобытийСобытиеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;

	ТекущиеДанные = Элементы.СобытияВнешнихИБДляПередачи.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ТекущиеДанные.ВнешняяСистема) Тогда
		Возврат;
	КонецЕсли;
	
	ТекстОшибки = "";
	
	СтруктураНастроек = ПолучитьНастройкиСоединенияДляТочки(ТекущиеДанные.ВнешняяСистема);
	
	СписокСобытий = бир_СобытияВызовСервера.ПолучитьСписокСобытийВнешнейИБ(СтруктураНастроек);
	
	Если СписокСобытий.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	СписокВыбора = Новый СписокЗначений();
	
	Для Каждого ТекСобытие Из СписокСобытий Цикл
		СписокВыбора.Добавить(ТекСобытие.Ид, ТекСобытие.Наименование);
	КонецЦикла;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаВыбораВнешнегоСобытия", ЭтаФорма, ТекущиеДанные);
	
	ПоказатьВыборИзМеню(ОписаниеОповещения, СписокВыбора, Элемент);
	
КонецПроцедуры // ВнешниеИБДляПередачиСобытийСобытиеНачалоВыбора()

&НаКлиенте
Процедура ОбработкаВыбораВнешнегоСобытия(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
	
	Если НЕ ВыбранныйЭлемент = Неопределено Тогда
		ДополнительныеПараметры.ИдСобытия			= ВыбранныйЭлемент.Значение;
		ДополнительныеПараметры.НаименованиеСобытия	= ВыбранныйЭлемент.Представление;
	КонецЕсли;
	
КонецПроцедуры // ОбработкаВыбораВнешнегоСобытия()

&НаСервереБезКонтекста
Функция ПолучитьНастройкиСоединенияДляТочки(ТочкаПодключения)
	Возврат бир_ВнешниеИБПолучениеДанных.НастройкиПодключения(ТочкаПодключения.СервисСобытий_Адрес);
КонецФункции // ПолучитьНастройкиСоединенияДляТочки()

&НаСервере
Процедура ТестНаСервере()
	
	ИдСобытия = СокрЛП(Новый УникальныйИдентификатор);
    Дата = ТекущаяУниверсальнаяДата();
	Момент = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ПараметрыСобытия = Новый Структура("ТестовыйПараметр", "Тестовый параметр");
    ТочкаВозникновения = Справочники.бир_СобытияТочкиВозникновения.ЭтаИБ;
	
	Для Каждого ТекСтрока Из СобытияВнешнихИБДляПередачи Цикл
		
		МассивСобытий = Новый Массив();
		
		ОписаниеСобытия = бир_ВнешниеСобытияОбработкаЗапросов.ОписаниеВнешнегоСобытия();
		ОписаниеСобытия.ИдСобытия             = ИдСобытия;
		ОписаниеСобытия.Источник_Наименование = "Тестовое событие";
		ОписаниеСобытия.Источник_Ид           = СокрЛП(Справочники.бир_События.ПустаяСсылка().УникальныйИдентификатор());
		ОписаниеСобытия.Приемник_Наименование = ТекСтрока.НаименованиеСобытия;
		ОписаниеСобытия.Приемник_Ид           = ТекСтрока.ИдСобытия;
		ОписаниеСобытия.ИдТочки               = ТочкаВозникновения.Ид;
		ОписаниеСобытия.Дата                  = Дата;
		ОписаниеСобытия.Момент                = Момент;
		ОписаниеСобытия.Параметры             = ПараметрыСобытия;
		
		МассивСобытий.Добавить(ОписаниеСобытия);
		
		СтруктураНастроек = бир_ВнешниеИБПолучениеДанных.НастройкиПодключения(ТекСтрока.ВнешняяСистема.СервисСобытий_Адрес);
		
		бир_ВнешниеСобытияОтправкаЗапросов.ПередатьСобытиеВоВнешнююИБ(СтруктураНастроек, МассивСобытий);

	КонецЦикла;
	
КонецПроцедуры // ТестНаСервере()

&НаКлиенте
Процедура Тест(Команда)
	ТестНаСервере();
КонецПроцедуры // Тест()

#КонецОбласти // ОбработчикиКомандФормы
