
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТКА ЗАПРОСОВ К СЕРВИСУ IDBData
//

#Область ПрограммныйИнтерфейс

// Функция - возвращает список запросов из справочника запросов
//
// Параметры:
//   Поля    - Строка            - список получаемых полей, разделенный ","
//             Массив из Строка    или массив имен получаемых полей
//
// Возвращаемое значение:
//   Массив из Структура                         - список запросов из справочника запросов
//     *Ид                 - Строка                - идентификатор запроса
//     *Код                - Строка                - код элемента справочника запросов
//     *Наименование       - Строка                - наименование запроса
//     *Родитель           - СправочникОбъект      - родительская группа справочника запросов
//                           .бир_ЗапросыКДанным
//     *Предопределенный   - Булево                - флаг предопределенного элемента справочника
//     *ПометкаУдаления    - Булево                - пометка удаления
//     *Описание           - Строка                - описание запроса
//     *ТекстЗапроса       - Строка                - текст запроса
//     *Поля               - Массив из Структура   - описание полей запроса
//                                                   (см. Справочники.бир_ЗапросыКДанным.ПоляЗапроса())
//     *Параметры          - Массив из Структура   - описание параметров запроса
//                                                   (см. Справочники.бир_ЗапросыКДанным.ПараметрыЗапроса())
//
Функция Запросы(Знач Поля = "") Экспорт

	Попытка
		Результат = Справочники.бир_ЗапросыКДанным.Запросы(Поля);
	Исключение
		ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ТекстОшибки = СтрШаблон("Ошибка получения списка запросов!:%1%2",
		                        Символы.ПС,
		                        ТекстОшибки);
		ВызватьИсключение ТекстОшибки;
	КонецПопытки;
		
	Возврат ПреобразованиеДанных().ЗначениеВСтруктуру(Результат);

КонецФункции // Запросы()

// Функция - возвращает описание запроса из справочника запросов
//
// Параметры:
//   ИдЗапроса    - Строка            - идентификатор запроса в справочнике запросов
//   Поля         - Строка            - список получаемых полей, разделенный ","
//                  Массив из Строка    или массив имен получаемых полей
//
// Возвращаемое значение:
//   Структура                                   - описание указанного объекта запроса
//                                                 состав полей указазывается в апраметре "Поля"
//     *Ид                 - Строка                - идентификатор запроса
//     *Код                - Строка                - код элемента справочника запросов
//     *Наименование       - Строка                - наименование запроса
//     *Родитель           - СправочникОбъект      - родительская группа справочника запросов
//                           .бир_ЗапросыКДанным
//     *Предопределенный   - Булево                - флаг предопределенного элемента справочника
//     *ПометкаУдаления    - Булево                - пометка удаления
//     *Описание           - Строка                - описание запроса
//     *ТекстЗапроса       - Строка                - текст запроса
//     *Поля               - Массив из Структура   - описание полей запроса
//                                                   (см. Справочники.бир_ЗапросыКДанным.ПоляЗапроса())
//     *Параметры          - Массив из Структура   - описание параметров запроса
//                                                   (см. Справочники.бир_ЗапросыКДанным.ПараметрыЗапроса())
//
Функция ОписаниеЗапроса(ИдЗапроса, Знач Поля = "") Экспорт

	Попытка
		Результат = Справочники.бир_ЗапросыКДанным.ОписаниеЗапроса(ИдЗапроса, Поля);
	Исключение
		ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ТекстОшибки = СтрШаблон("Ошибка получения списка запросов!:%1%2",
		                        Символы.ПС,
		                        ТекстОшибки);
		ВызватьИсключение ТекстОшибки;
	КонецПопытки;
		
	Возврат ПреобразованиеДанных().ЗначениеВСтруктуру(Результат);

КонецФункции // ОписаниеЗапроса()

// Функция - возвращает результат выполнения переданного запроса
//
// Параметры:
//   ИдЗапроса                 - Строка                 - идентификатор запроса в справочнике запросов
//   ПараметрыЗапроса          - Массив из Структура    - список параметров запроса
//   ДополнительныеПараметры   - Структура              - Дополнительные параметры запроса
//
//
// Возвращаемое значение:
//   Массив из Структура    - результат выполнения запроса
//
Функция РезультатЗапроса(ИдЗапроса,
                         Знач ПараметрыЗапроса = Неопределено,
                         Знач ДополнительныеПараметры = Неопределено) Экспорт

	Ошибки = Новый Массив();

	Если НЕ ТипЗнч(ПараметрыЗапроса) = Тип("Массив") Тогда
		ПараметрыЗапроса = Новый Массив();
	КонецЕсли;
	Если НЕ ТипЗнч(ДополнительныеПараметры) = Тип("Структура") Тогда
		ДополнительныеПараметры = Новый Структура();
	КонецЕсли;

	Попытка
		ПроцессорЗапросов = Справочники.бир_ЗапросыКДанным.ПроцессорЗапросов(ИдЗапроса);
	Исключение
		ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ВызватьИсключение ТекстОшибки;
	КонецПопытки;
		
	Для Каждого ТекПараметрЗапроса Из ПараметрыЗапроса Цикл
		Попытка
			ЗначениеПараметра = ЗначениеПараметраЗапроса(ТекПараметрЗапроса);
			ПроцессорЗапросов.УстановитьПараметрЗапроса(ТекПараметрЗапроса.Имя, ЗначениеПараметра);
		Исключение
			ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			Ошибки.Добавить(ТекстОшибки);
		КонецПопытки;
	КонецЦикла;

	Если Ошибки.Количество() > 0 Тогда
		ТекстОшибки = СтрСоединить(Ошибки, Символы.ПС);
		ТекстОшибки = СтрШаблон("Ошибка чтения параметров запроса:%1%2", Символы.ПС, ТекстОшибки);
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;

	Попытка
		ПроцессорЗапросов.УстановитьДополнительныеПараметры(ДополнительныеПараметры);
	Исключение
		ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ТекстОшибки = СтрШаблон("Ошибка чтения дополнительных параметров выполнения запроса:%1%2", Символы.ПС, ТекстОшибки);
		ВызватьИсключение ТекстОшибки;
	КонецПопытки;

	ОграничениеВыборки = 0;
	Если ДополнительныеПараметры.Свойство("Первые") Тогда
		ОграничениеВыборки = ДополнительныеПараметры.Первые;
	КонецЕсли;

	Попытка
		Результат = ПроцессорЗапросов.ВыполнитьЗапрос(ОграничениеВыборки);
	Исключение
		ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ТекстОшибки = СтрШаблон("Ошибка выполнения запроса:%1%2", Символы.ПС, ТекстОшибки);
		ВызватьИсключение ТекстОшибки;
	КонецПопытки;

	Возврат ПреобразованиеДанных().ЗначениеВСтруктуру(Результат);

КонецФункции // РезультатЗапроса()

#КонецОбласти // ПрограммныйИнтерфейс

#Область СлужебныйПрограммныйИнтерфейс

Функция ТипыСодержимого() Экспорт

	ТипыСодержимого = Новый Структура();
	ТипыСодержимого.Вставить("Заголовок", "Content-Type");
	ТипыСодержимого.Вставить("HTML", "text/html; charset=utf-8");
	ТипыСодержимого.Вставить("JSON", "application/json; charset=utf-8");

	Возврат Новый ФиксированнаяСтруктура(ТипыСодержимого);

КонецФункции // ТипыСодержимого()

Функция КодыСостояния() Экспорт

	КодыСостояния = бир_КоннекторHTTP.КодыСостоянияHTTP();
	КодыСостояния.Вставить("Успешно_200", 200);

	Возврат Новый ФиксированнаяСтруктура(КодыСостояния);

КонецФункции // КодыСостояния()

//Функция - читает параметры из строки и тела HTTP-запроса
//
// Параметры:
//  Запрос    - HTTPСервисЗапрос    - HTTP-запрос
// 
// Возвращаемое значение:
//   Структура    - прочитанные параметры
//
Функция ПрочитатьПараметрыЗапросаHTTP(Запрос) Экспорт

	Результат = Новый Структура();
	Результат.Вставить("Тело"     , "");
	Результат.Вставить("Параметры", Новый Массив());
	
	ТелоЗапроса = Запрос.ПолучитьТелоКакСтроку();

	Если НЕ ПустаяСтрока(ТелоЗапроса) Тогда
		Попытка
			ТелоЗапроса = ПреобразованиеДанных().ПрочитатьОписаниеОбъектаИзJSON(ТелоЗапроса);
		Исключение
			ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ТекстОшибки = СтрШаблон("Некорректные данные в теле запроса:%1%2", Символы.ПС, ТекстОшибки);
			ВызватьИсключение ТекстОшибки;
		КонецПопытки;
	КонецЕсли;

	Результат.Тело      = ТелоЗапроса;
	Результат.Параметры = Запрос.ПараметрыЗапроса;
	
	Возврат Результат;

КонецФункции // ПрочитатьПараметрыЗапросаHTTP()

//Функция - Возвращает HTTP-ответ с результатом обработки данных
//
// Параметры:
//  Данные    - Строка    - результат обработки
// 
// Возвращаемое значение:
//   HTTPСервисОтвет    - HTTP-ответ с результатом обработки данных
//
Функция ОтветРезультатОбработкиHTTP(Знач Данные) Экспорт

	ТипыСодержимого = ТипыСодержимого();
	
	Ответ = Новый HTTPСервисОтвет(КодыСостояния().Успешно_200);
	Ответ.Заголовки.Вставить(ТипыСодержимого.Заголовок, ТипыСодержимого.JSON);
	Ответ.УстановитьТелоИзСтроки(ПреобразованиеДанных().ЗаписатьОписаниеОбъектаВJSON(Данные));
	
	Возврат Ответ;

КонецФункции // ОтветРезультатОбработкиHTTP()

//Функция - Возвращает HTTP-ответ с описанием возникшей ошибки
//
// Параметры:
//  ТекстОшибки        - Строка    - текстовое описание ошибки
//  ОшибкаОбработки    - Булево    - Истина - ошибка обработки запроса на сервере (500)
//                                   Ложь - ошибка в параметрах или теле запроса (400)
// 
// Возвращаемое значение:
//   HTTPСервисОтвет    - HTTP-ответ с описанием возникшей ошибки
//
Функция ОтветОшибкаОбработкиHTTP(Знач ТекстОшибки, Знач ОшибкаОбработки = Ложь) Экспорт

	ТипыСодержимого = ТипыСодержимого();
	КодыСостояния = КодыСостояния();

    Если ОшибкаОбработки Тогда
		КодСостояния = КодыСостояния.ВнутренняяОшибкаСервера_500;
		ЗаписьЖурналаРегистрации("ВнешниеИБ.ОбработкаЗапросов",
		                         УровеньЖурналаРегистрации.Ошибка,
								 Метаданные.HTTPСервисы.бир_ВнешниеИБОбработкаЗапросов,
								 "",
								 ТекстОшибки);
	Иначе
		КодСостояния = КодыСостояния.НеверныйЗапрос_400;
	КонецЕсли;

	ТекстОшибки = СтрЗаменить(ТекстОшибки, Символы.ПС, СтрШаблон("<br/>%1", Символы.ПС));

	Ответ = Новый HTTPСервисОтвет(КодСостояния);
	Ответ.Заголовки.Вставить(ТипыСодержимого.Заголовок, ТипыСодержимого.HTML);
	Ответ.УстановитьТелоИзСтроки(ТекстОшибки);

	Возврат Ответ;

КонецФункции // ОтветОшибкаОбработкиHTTP()

#КонецОбласти // СлужебныйПрограммныйИнтерфейс

#Область СлужебныеПроцедурыИФункции

// Функция - получает значение параметра запроса 1С из описания параметра
//
// Параметры:
//  ОписаниеПараметраЗапроса    - Структура    - текстовое описание ошибки
//    *Имя                        - Строка       - имя параметра запроса
//    *ТипЗначения                - Строка       - тип значения параметра запроса
//    *Значение                   - Строка       - описание значения параметра запроса
// 
// Возвращаемое значение:
//   Произвольный    - значение параметра
//
Функция ЗначениеПараметраЗапроса(ОписаниеПараметраЗапроса)

	Ошибки = Новый Массив();

	ЗначениеПараметра = Неопределено;

	Если Метаданные.НайтиПоТипу(Тип(ОписаниеПараметраЗапроса.ТипЗначения)) = Неопределено Тогда
		ЗначениеПараметра = ОписаниеПараметраЗапроса.Значение;
	Иначе
		Попытка
			МенеджерПараметра = Новый (Тип(СтрЗаменить(ОписаниеПараметраЗапроса.ТипЗначения, "Ссылка.", "Менеджер.")));
		Исключение
			ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ТекстОшибки = СтрШаблон("Ошибка получения менеджера значения параметра ""%1"" по типу ""%2"":%3%4",
			                        ОписаниеПараметраЗапроса.Имя,
			                        ОписаниеПараметраЗапроса.ТипЗначения,
			                        Символы.ПС,
			                        ТекстОшибки);
			Ошибки.Добавить(ТекстОшибки);
		КонецПопытки;

		ОписаниеПараметраЗапроса.Вставить("Менеджер", МенеджерПараметра);
		ТипЗначенияПараметра = ТипЗнч(ОписаниеПараметраЗапроса.Значение);
		
		Если ТипЗначенияПараметра = Тип("Массив") Тогда
			ЗначениеПараметра = Новый Массив();
			Для Каждого ТекЗначение Из ОписаниеПараметраЗапроса.Значение Цикл
				Попытка
					ТекЗначениеСсылки = ЗначениеСсылкиПараметраЗапроса(ОписаниеПараметраЗапроса, ТекЗначение);
					ЗначениеПараметра.Добавить(ТекЗначениеСсылки);
				Исключение
					ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
					ТекстОшибки = СтрШаблон("Ошибка получения значения ""%1"" параметра ""%2"":%3%4",
					                        ТекЗначение,
					                        ОписаниеПараметраЗапроса.Имя,
					                        Символы.ПС,
					                        ТекстОшибки);
					Ошибки.Добавить(ТекстОшибки);
				КонецПопытки;
			КонецЦикла;
		ИначеЕсли ТипЗначенияПараметра = Тип("Строка") Тогда
			Попытка
				ЗначениеПараметра = ЗначениеСсылкиПараметраЗапроса(ОписаниеПараметраЗапроса,
				                                                   ОписаниеПараметраЗапроса.Значение);
			Исключение
				ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
				ТекстОшибки = СтрШаблон("Ошибка получения значения ""%1"" параметра ""%2"":%3%4",
				                        ОписаниеПараметраЗапроса.Значение,
				                        ОписаниеПараметраЗапроса.Имя,
				                        Символы.ПС,
				                        ТекстОшибки);
				Ошибки.Добавить(ТекстОшибки);
			КонецПопытки;
		Иначе
			ТекстОшибки = СтрШаблон("Некорректный тип значения параметра ""%1""!
			                        |Ожидается ""Строка"" или ""Масив из Строка"".",
			                        ТипЗначенияПараметра);
			Ошибки.Добавить(ТекстОшибки);
		КонецЕсли;
	КонецЕсли;

	Если Ошибки.Количество() > 0 Тогда
		ТекстОшибки = СтрСоединить(Ошибки, Символы.ПС);
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;

	Возврат ЗначениеПараметра;

КонецФункции // ЗначениеПараметраЗапроса()

// Функция - получает ссылку на объект по описанию
// (по значению ссылки внутр, уникальному идентификатору или идентификатору предопределенного значения)
//
// Параметры:
//  ОписаниеПараметраЗапроса    - Структура    - описание параметра запроса
//    *Имя                        - Строка       - имя параметра запроса
//    *ТипЗначения                - Строка       - тип значения параметра запроса
//    *Значение                   - Строка       - значение ссылки внутр, уникальный идентификатор
//                                                 или идентификатор предопределенного значения
//    *Менеджер                   - Строка       - менеджер ссылочного объекта
//                                                 (например: СправочникМенеджер.Контрагенты)
//  СсылкаСтрокой                 - Строка       - строковое представление ссылки
// Возвращаемое значение:
//   ЛюбаяСсылка    - ссылка на объект
//
Функция ЗначениеСсылкиПараметраЗапроса(ОписаниеПараметраЗапроса, СсылкаСтрокой)

	ЗначениеПараметра = Неопределено;

	ДлинаУИД = 36;

	МенеджерПараметра = ОписаниеПараметраЗапроса.Менеджер;
	Попытка
		Если ОписаниеПараметраЗапроса.Предопределенное Тогда
			ЗначениеПараметра = МенеджерПараметра[СсылкаСтрокой];
		ИначеЕсли СтрДлина(СсылкаСтрокой) > ДлинаУИД Тогда
			ЗначениеПараметра = ЗначениеИзСтрокиВнутр(СсылкаСтрокой);
		Иначе
			ЗначениеПараметра =
				МенеджерПараметра.ПолучитьСсылку(Новый УникальныйИдентификатор(ОписаниеПараметраЗапроса.Значение));
		КонецЕсли;
	Исключение
		ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ТекстОшибки = СтрШаблон("Ошибка получения значения ""%1"" параметра ""%2"":%3%4",
		                        СсылкаСтрокой,
		                        ОписаниеПараметраЗапроса.ИмяПараметра,
		                        Символы.ПС,
		                        ТекстОшибки);
		ВызватьИсключение ТекстОшибки;
	КонецПопытки;

	Возврат ЗначениеПараметра;

КонецФункции // ЗначениеСсылкиПараметраЗапроса()

// Функция - Получает обработку сериализации значений
// 
// Возвращаемое значение:
//   ОбработкаОбъект    - обработка преобразования данных
//
Функция ПреобразованиеДанных()

	Возврат Обработки.бир_ПреобразованиеДанных.Создать(); 

КонецФункции // ПреобразованиеДанных()

#КонецОбласти // СлужебныеПроцедурыИФункции
