
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	СсылкаНаОбъект = Неопределено;
	Данные = Новый Массив();
	Если ТипЗнч(ПараметрКоманды) = Тип("Массив") Тогда
		Данные = ПараметрКоманды;
	Иначе
		Данные.Добавить(ПараметрКоманды);
	КонецЕсли;
	
	Если Данные.Количество() = 1 Тогда
		Попытка
			Если Данные[0] = ПараметрыВыполненияКоманды.Источник.Объект.Ссылка Тогда
				СсылкаНаОбъект = Данные[0];
			КонецЕсли;
		Исключение
			ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		КонецПопытки;
	КонецЕсли;

	Параметры = Новый Структура();
	Параметры.Вставить("СсылкаНаОбъект", СсылкаНаОбъект);
	
	бир_СохранениеВосстановлениеДанныхКлиент.ВыбратьФайлИСохранитьДанные(Данные,
	                                                                     Параметры,
	                                                                     ПараметрыВыполненияКоманды.Источник);

КонецПроцедуры // ОбработкаКоманды()

#КонецОбласти // ОбработчикиСобытий
