
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	СсылкаНаОбъект = Неопределено;
	Данные = Новый Массив();
	Если ТипЗнч(ПараметрКоманды) = Тип("Массив") Тогда
		Данные = ПараметрКоманды;
	Иначе
		Данные.Добавить(ПараметрКоманды);
	КонецЕсли;
	
	ПараметрыОбработки = Новый Структура();
	ПараметрыОбработки.Вставить("ОграничениеТипа"         , Новый ОписаниеТипов());
	ПараметрыОбработки.Вставить("ВыгружатьСвязанныеДанные", Истина);
	ПараметрыОбработки.Вставить("ВыгружатьДвижения"       , Истина);
	
	ФормаОбработки = ПолучитьФорму("Обработка.бир_СохранениеВосстановлениеДанных.Форма.Форма",
	                               ПараметрыОбработки,
	                               ПараметрыВыполненияКоманды.Источник);
	ФормаОбработки.ВыбратьФайлИСохранитьДанные(Данные);
	
КонецПроцедуры // ОбработкаКоманды()

#КонецОбласти // ОбработчикиСобытий
