
#Область ОписаниеПеременных

Перем ТекстЗапроса;            // - Строка                  - текст запроса
Перем ПараметрыЗапроса;        // - Структура из Структура  - параметры запроса 
                               //                             (см. ПараметрыЗапроса())
Перем МенеджерВременныхТаблиц; // - МенеджерВременныхТаблиц - менеджер временных таблиц запроса 
Перем ПроизвольныеВыражения;   // - Соответствие            - произвольные выражения для вычисления в запросе
                               //                             (см. ПроизвольныеВыражения())
Перем ДополнительныеПараметры; // - Структура               - дополнительные параметры для использования
                               //                             в произвольных выражениях (см. ДополнительныеПараметры())

#КонецОбласти // ОписаниеПеременных

#Область ПрограммныйИнтерфейс

// Функция - возвращает текст запроса
//
// Возвращаемое значение:
//   Строка    - текст запроса
//
Функция ТекстЗапроса() Экспорт
	
	Возврат ТекстЗапроса;

КонецФункции // ТекстЗапроса()

// Процедура - устанавливает текст запроса для выполнения
//
// Параметры:
//   НовоеЗначение    - Строка    - текст запроса для выполнения
//
Процедура УстановитьТекстЗапроса(НовоеЗначение) Экспорт
	
	ТекстЗапроса = НовоеЗначение;

КонецПроцедуры // УстановитьТекстЗапроса()

// Функция - возвращает параметры запроса
//
// Возвращаемое значение:
//   Структура из Структура              - параметры запроса
//    *Ключ             - Строка           - имя параметра запроса
//    *Значение
//      **Значение        - Произвольный     - значение параметра запроса
//                                             или имя произвольного выражения
//      **Выражение       - Булево           - Истина - для вычисления значения параметра
//                                             используется произвольное выражение
//
Функция ПараметрыЗапроса() Экспорт
	
	Возврат ПараметрыЗапроса;

КонецФункции // ПараметрыЗапроса()

// Процедура - устанавливает параметры запроса
//
// Параметры:
//   НовоеЗначение       - Структура Из Структура    - список устанавливаемых параметров
//    *Ключ                - Строка                    - имя параметра запроса
//    *Значение
//      **Значение         - Произвольный              - значение параметра запроса
//                                                       или имя произвольного выражения
//      **Выражение        - Булево                    - Истина - для вычисления значения параметра
//                                                       используется произвольное выражение
//
Процедура УстановитьПараметрыЗапроса(НовоеЗначение) Экспорт
	
	Если ТипЗнч(НовоеЗначение) = Тип("Структура") Тогда
		ПараметрыЗапроса = НовоеЗначение;
	ИначеЕсли ТипЗнч(НовоеЗначение) = Тип("Массив") ИЛИ ТипЗнч(НовоеЗначение) = Тип("ТаблицаЗначений") Тогда
		ПараметрыЗапроса = Новый Структура();
		Для Каждого ТекПараметр Из НовоеЗначение Цикл
			НовыйПараметр = Новый Структура("Значение, Выражение");
			ЗаполнитьЗначенияСвойств(НовыйПараметр, ТекПараметр);
			Если ТекПараметр.Свойство("СпособЗаполнения") Тогда
				НовыйПараметр.Выражение = (ТекПараметр.СпособЗаполнения = "ВЫРАЖЕНИЕ");
			КонецЕсли;
			ПараметрыЗапроса.Вставить(ТекПараметр.Имя, НовыйПараметр);
		КонецЦикла;
	Иначе
		ВызватьИсключение СтрШаблон("Некорректный тип списка параметров запроса ""%1"",
		                            |ожидается ""Структура"", ""Массив"" или ""ТаблицаЗначений""",
		                            ТипЗнч(НовоеЗначение));
	КонецЕсли;

КонецПроцедуры // УстановитьПараметрыЗапроса()

// Процедура - устанавливает значение указанного параметра запроса
//
// Параметры:
//   ИмяПараметра         - Строка          - имя параметра запроса
//   ЗначениеПараметра    - Произвольный    - значение параметра запроса
//   Выражение            - Булево          - Истина - для вычисления значения параметра
//                                            используется произвольное выражение
//
Процедура УстановитьПараметрЗапроса(ИмяПараметра, ЗначениеПараметра, Выражение = Ложь) Экспорт
	
	Если НЕ ТипЗнч(ПараметрыЗапроса) = Тип("Структура") Тогда
		ПараметрыЗапроса = Новый Структура();
	КонецЕсли;

	НовыйПараметр = Новый Структура("Значение,
	                                |Выражение",
		                            ЗначениеПараметра,
		                            Выражение);
	ПараметрыЗапроса.Вставить(ИмяПараметра, НовыйПараметр);

КонецПроцедуры // УстановитьПараметрЗапроса()

// Функция - возвращает менеджер временных таблиц запроса
//
// Возвращаемое значение:
//   МенеджерВременныхТаблиц    - менеджер временных таблиц запроса
//
Функция МенеджерВременныхТаблиц() Экспорт
	
	Возврат МенеджерВременныхТаблиц;

КонецФункции // МенеджерВременныхТаблиц()

// Процедура - устанавливает менеджер временных таблиц запроса
//
// Параметры:
//   НовоеЗначение    - МенеджерВременныхТаблиц    - менеджер временных таблиц запроса
//
Процедура УстановитьМенеджерВременныхТаблиц(НовоеЗначение) Экспорт
	
	МенеджерВременныхТаблиц = НовоеЗначение;

КонецПроцедуры // УстановитьМенеджерВременныхТаблиц()

// Функция - возвращает произвольные выражения
//
// Возвращаемое значение:
//   Соответствие               - произвольные выражения для вычисления в запросе
//    *Ключ          - Строка     - имя произвольного выражения
//    *Значение      - Строка     - код произвольного выражения
//
Функция ПроизвольныеВыражения() Экспорт
	
	Возврат ПроизвольныеВыражения;

КонецФункции // ПроизвольныеВыражения()

// Процедура - устанавливает список произвольных выражений
//
// Параметры:
//   НовоеЗначение       - Соответствие    - список устанавливаемых параметров
//    *Ключ                - Строка          - имя произвольного выражения
//    *Значение            - Строка          - код произвольного выражения
//
Процедура УстановитьПроизвольныеВыражения(НовоеЗначение) Экспорт
	
	Если ТипЗнч(НовоеЗначение) = Тип("Соответствие") ИЛИ ТипЗнч(НовоеЗначение) = Тип("Структура") Тогда
		ПроизвольныеВыражения = Новый Соответствие();
		Для Каждого ТекЭлемент Из НовоеЗначение Цикл
			ПроизвольныеВыражения.Вставить(ВРег(СокрЛП(ТекЭлемент.Ключ)), ТекЭлемент.Значение);
		КонецЦикла;
	ИначеЕсли ТипЗнч(НовоеЗначение) = Тип("Массив") ИЛИ ТипЗнч(НовоеЗначение) = Тип("ТаблицаЗначений") Тогда
		ПроизвольныеВыражения = Новый Соответствие();
		Для Каждого ТекВыражение Из НовоеЗначение Цикл
			ПроизвольныеВыражения.Вставить(ВРег(СокрЛП(ТекВыражение.Имя)), ТекВыражение.Код);
		КонецЦикла;
	Иначе
		ВызватьИсключение СтрШаблон("Некорректный тип списка произвольных выражений ""%1"",
		                            |ожидается ""Структура"", ""Соответствие"", ""Массив"" или ""ТаблицаЗначений""",
		                            ТипЗнч(НовоеЗначение));
	КонецЕсли;

КонецПроцедуры // УстановитьПроизвольныеВыражения()

// Процедура - устанавливает произвольное выражение по имени
//
// Параметры:
//   ИмяВыражения    - Строка    - имя произвольного выражения
//   КодВыражения    - Строка    - код произвольного выражения
//
Процедура УстановитьПроизвольноеВыражение(ИмяВыражения, КодВыражения) Экспорт
	
	Если НЕ ТипЗнч(ПроизвольныеВыражения) = Тип("Соответствие") Тогда
		ПроизвольныеВыражения = Новый Соответствие();
	КонецЕсли;

	ПроизвольныеВыражения.Вставить(ВРег(СокрЛП(ИмяВыражения)), КодВыражения);

КонецПроцедуры // УстановитьПроизвольноеВыражение()

// Функция - возвращает дополнительные параметры произвольных выражений
//
// Возвращаемое значение:
//   Структура               - дополнительные параметры произвольных выражений
//    *Ключ        - Строка    - имя дополнительного параметра
//    *Значение    - Строка    - значение дополнительного параметра
//
Функция ДополнительныеПараметры() Экспорт
	
	Возврат ДополнительныеПараметры;

КонецФункции // ДополнительныеПараметры()

// Процедура - дополнительные параметры произвольных выражений
//
// Параметры:
//   НовоеЗначение    - Структура     - список устанавливаемых параметров
//    *Ключ             - Строка        - имя дополнительного параметра
//    *Значение         - Строка        - значение дополнительного параметра
//
Процедура УстановитьДополнительныеПараметры(НовоеЗначение) Экспорт
	
	Если ТипЗнч(НовоеЗначение) = Тип("Структура") Тогда
		ДополнительныеПараметры = НовоеЗначение;
	Иначе
		ВызватьИсключение СтрШаблон("Некорректный тип списка дополнительных параметров ""%1"",
		                            |ожидается ""Структура""",
		                            ТипЗнч(НовоеЗначение));
	КонецЕсли;

КонецПроцедуры // УстановитьДополнительныеПараметры()

// Процедура - устанавливает значение дополнительного параметра произвольных выражений
//
// Параметры:
//   ИмяПараметра         - Строка          - имя дополнительного параметра
//   ЗначениеПараметра    - Произвольный    - значение дополнительного параметра
//
Процедура УстановитьДополнительныйПараметр(ИмяПараметра, ЗначениеПараметра) Экспорт
	
	Если НЕ ТипЗнч(ДополнительныеПараметры) = Тип("Структура") Тогда
		ДополнительныеПараметры = Новый Структура();
	КонецЕсли;

	ДополнительныеПараметры.Вставить(ИмяПараметра, ЗначениеПараметра);

КонецПроцедуры // УстановитьДополнительныйПараметр()

// Функция - выполняет переданный запрос
//
// Параметры:
//   ОграничениеВыборки           - Число               - Количество строк в результате запроса (0 - без ограничений)
//   ВозвращатьТаблицуЗначений    - Булево              - Истина - возвращать ТаблицуЗначений
//                                                        Ложь - возвращать РезультатЗапроса
//
// Возвращаемое значение:
//   РезультатЗапроса, ТаблицаЗначений    - Результат выполнения запроса
//
Функция ВыполнитьЗапрос(ОграничениеВыборки = 0, ВозвращатьТаблицуЗначений = Истина) Экспорт

	Если ОграничениеВыборки = Неопределено ИЛИ ОграничениеВыборки = 0 Тогда
		ИсполняемыйТекстЗапроса = ТекстЗапроса;
	Иначе

		Схема = Новый СхемаЗапроса();
		Попытка
			Схема.УстановитьТекстЗапроса(ТекстЗапроса);
		Исключение
			ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ТекстОшибки = СтрШаблон("Ошибка чтения текста запроса:%1%2", Символы.ПС, ТекстОшибки);
			ВызватьИсключение ТекстОшибки;
		КонецПопытки;

		Запрос = Неопределено;
		Для Каждого ТекЗапрос Из Схема.ПакетЗапросов Цикл

			Если ТипЗнч(ТекЗапрос) = Тип("ЗапросУничтоженияТаблицыСхемыЗапроса") Тогда
				Продолжить;
			КонецЕсли;
			Если ЗначениеЗаполнено(ТекЗапрос.ТаблицаДляПомещения) Тогда
				Продолжить;
			КонецЕсли;
			
			Запрос = ТекЗапрос;
		КонецЦикла;

		Если НЕ ТипЗнч(Запрос) = Тип("ЗапросВыбораСхемыЗапроса") Тогда
			ТекстОшибки = "Не обнаружен тест основного запроса!";
			ВызватьИсключение ТекстОшибки;
		КонецЕсли;

		Для Каждого ТекОператор Из Запрос.Операторы Цикл
			ТекОператор.КоличествоПолучаемыхЗаписей = ОграничениеВыборки;
		КонецЦикла;

		ИсполняемыйТекстЗапроса = Схема.ПолучитьТекстЗапроса();

	КонецЕсли;

	Запрос = Новый Запрос(ИсполняемыйТекстЗапроса);

	Для Каждого ТекПараметр Из ПараметрыЗапроса Цикл
		Если ТекПараметр.Значение.Выражение Тогда
			РезультатВычисленияВыражения = ВычислитьВыражение(ТекПараметр.Значение.Значение);
			Запрос.УстановитьПараметр(ТекПараметр.Ключ, РезультатВычисленияВыражения);
		Иначе
			Запрос.УстановитьПараметр(ТекПараметр.Ключ, ТекПараметр.Значение.Значение);
		КонецЕсли;
	КонецЦикла;

	Если ТипЗнч(МенеджерВременныхТаблиц) = Тип("МенеджерВременныхТаблиц") Тогда
		Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	КонецЕсли;

	Попытка
		Результат = Запрос.Выполнить();
	Исключение
		ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ТекстОшибки = СтрШаблон("Ошибка выполнения запроса запроса:%1%2", Символы.ПС, ТекстОшибки);
		ВызватьИсключение ТекстОшибки;
	КонецПопытки;

	Если ВозвращатьТаблицуЗначений Тогда
		Возврат Результат.Выгрузить();
	КонецЕсли;

	Возврат Результат;

КонецФункции // ВыполнитьЗапрос()

// Функция - вычислить выражение
//
// Параметры:
//   КодВыражения    - Строка    - программный код выражения для вычисления
//
// Возвращаемое значение:
//   Произвольный    - результат вычисления выражения
//
Функция ВычислитьВыражение(ИмяВыражения) Экспорт

	Результат = Неопределено;
	Параметры = КонтекстПроизвольныхВыражений();
	КодВыражения = Неопределено;
	Если ТипЗнч(ПроизвольныеВыражения) = Тип("Соответствие") Тогда
		КодВыражения = ПроизвольныеВыражения.Получить(ВРег(СокрЛП(ИмяВыражения)));
	КонецЕсли;
	
	Если НЕ КодВыражения = Неопределено Тогда
		Попытка
			Выполнить(КодВыражения);
		Исключение
			ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ТекстОшибки = СтрШаблон("Ошибка вычисления выражения ""%1"":%2%3", ИмяВыражения, Символы.ПС, ТекстОшибки);
			ВызватьИсключение ТекстОшибки;
		КонецПопытки;
	Иначе
		ТекстОшибки = СтрШаблон("Не указан текст выражения ""%1"" для вычисления!", ИмяВыражения);
		Возврат Неопределено;
	КонецЕсли;

	Возврат Результат;

КонецФункции // ВычислитьВыражение()

#КонецОбласти // ПрограммныйИнтерфейс

#Область СлужебныеПроцедурыИФункции

// Процедура - инициализирует переменные модуля
// 
Процедура Инициализация()

	ТекстЗапроса            = "";
	ПараметрыЗапроса        = Новый Структура();
	ПроизвольныеВыражения   = Новый Соответствие();
	ДополнительныеПараметры = Новый Структура();

КонецПроцедуры // Инициализация()

// Функция - структуру доступных параметров для произвольных выражений
// 
// Возвращаемое значение:
// 	Структура - доступные параметры для произвольных выражений
//
Функция КонтекстПроизвольныхВыражений()
	
	Контекст = Новый Структура();
	
	Для Каждого ТекЭлемент Из ПараметрыЗапроса Цикл
		Если ТекЭлемент.Значение.Выражение Тогда
			Продолжить;
		КонецЕсли;
		Контекст.Вставить(ТекЭлемент.Ключ, ТекЭлемент.Значение.Значение);
	КонецЦикла;
	
	Для Каждого ТекЭлемент Из ДополнительныеПараметры Цикл
		Контекст.Вставить(ТекЭлемент.Ключ, ТекЭлемент.Значение);
	КонецЦикла;
	
	Возврат Контекст
	
КонецФункции // КонтекстПроизвольныхВыражений()

// Функция - возвращает версию обработчика
// 
// Возвращаемое значение:
// 	Строка - ВерсияОбработки обработчика
//
Функция Версия() Экспорт
	
	Возврат ЭтотОбъект.ПолучитьМакет("ВерсияОбработки").ПолучитьТекст();
	
КонецФункции // ВерсияОбработки()

#КонецОбласти // СлужебныеПроцедурыИФункции

#Область Инициализация

Инициализация();

#КонецОбласти
