////////////////////////////////////////////////////////////////////////////////
// Подсистема "Обработка событий (EventHUB)". (Клиент)
//
////////////////////////////////////////////////////////////////////////////////


#Область ПрограммныйИнтерфейс

// Функция - получает форму обработки обслуживания обработчика события
//
// Параметры:
//  Обработчик           - СправочникСсылка           - элемент справочника "Обработчики событий", для которого получаем форму обработки
//                         .бир_СобытияОбработчики
//  ИмяФормы             - Строка                     - имя получаемой формы обработки обслуживания
//  ПараметрыОткрытия    - Структура                  - параметры, передаваемые в форму обработки при создании
//  Владелец             - УправляемаяФорма,          - владелец формы обработки
//                         ЭлементФормы
// 
// Возвращаемое значение:
//  УправляемаяФорма    - созданная форма обработки обслуживания
//
Функция ФормаОбработчикаСобытия(Обработчик, ИмяФормы = "", ПараметрыОткрытия = Неопределено, Владелец = Неопределено) Экспорт
	
	ОписаниеОбработчика = бир_СобытияВызовСервера.ОписаниеОбработчикаСобытий(Обработчик);
	
	ИмяОбработки = СтрШаблон("ОбработкаСобытия_%1", СтрЗаменить(ОписаниеОбработчика.Ид, "-", "_"));
	
	АдресОбработки = ?(ОписаниеОбработчика.ОбработкаВнешняя,
					   ПолучитьНавигационнуюСсылку(Обработчик, "Обработка"),
					   ОписаниеОбработчика.ОбработкаИмяВстроенной);
	
	Возврат бир_ОбработкиОбслуживанияКлиент.ФормаОбработкиОбслуживания(АдресОбработки,
	                                                                   ИмяОбработки,
	                                                                   ИмяФормы,
	                                                                   ПараметрыОткрытия,
	                                                                   Владелец);
	
КонецФункции // ФормаОбработчикаСобытия()
	
#КонецОбласти // ПрограммныйИнтерфейс

#Область СлужебныеПроцедурыИФункции

Процедура ПриНачалеРаботыСистемы() Экспорт
	
	//Раскомментировать если нужно обрабатывать события на клиенте
	//ПодключитьОбработчикОжидания("ОбработкаОжиданияСобытийНаКлиенте", 10, Ложь);
	ПодключитьОбработчикОповещения("ОбработкаСобытийНаКлиенте");
	
КонецПроцедуры // ПриНачалеРаботыСистемы()

#КонецОбласти // СлужебныеПроцедурыИФункции
