
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	СсылкаНаОбъект = Неопределено;
	Данные = Новый Массив();
	Если ТипЗнч(ПараметрКоманды) = Тип("Массив") Тогда
		Данные = ПараметрКоманды;
	Иначе
		Данные.Добавить(ПараметрКоманды);
	КонецЕсли;
	
	ПараметрыОбработки = Новый Структура();
	ПараметрыОбработки.Вставить("РезервноеКопирование"         , Ложь);
	ПараметрыОбработки.Вставить("ВосстанавливатьВТранзакции"   , Истина);
	ПараметрыОбработки.Вставить("ПоказатьДиалогВыбора"         , Истина);
	ПараметрыОбработки.Вставить("ВыполнятьОбработчикиПриЗаписи", Ложь);
	
	ФормаОбработки = ПолучитьФорму("Обработка.бир_СохранениеВосстановлениеДанных.Форма.Форма",
	                               ПараметрыОбработки,
	                               ПараметрыВыполненияКоманды.Источник);
	ФормаОбработки.ВыбратьФайлИВосстановитьДанные();
	
КонецПроцедуры // ОбработкаКоманды()

#КонецОбласти // ОбработчикиСобытий
