
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)

	СсылкаНаОбъект = Неопределено;
	Данные = Новый Массив();
	Если ТипЗнч(ПараметрКоманды) = Тип("Массив") Тогда
		Данные = ПараметрКоманды;
	Иначе
		Данные.Добавить(ПараметрКоманды);
	КонецЕсли;
	
	Если Данные.Количество() = 1 Тогда
		Попытка
			Если Данные[0] = ПараметрыВыполненияКоманды.Источник.Объект.Ссылка Тогда
				СсылкаНаОбъект = Данные[0];
			КонецЕсли;
		Исключение
			ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		КонецПопытки;
	КонецЕсли;

	ОграничениеТипа = ОграничениеТипа(ПараметрКоманды);

	Параметры = Новый Структура();
	Параметры.Вставить("ОграничениеТипа", ОграничениеТипа);
	Параметры.Вставить("РезервноеКопирование", Ложь);
	Параметры.Вставить("ПоказатьДиалогВыбора", Истина);
	Параметры.Вставить("СсылкаНаОбъект"      , СсылкаНаОбъект);
	
	бир_СохранениеВосстановлениеДанныхКлиент.ВыбратьФайлИВосстановитьДанные(Параметры,
	                                                                        ПараметрыВыполненияКоманды.Источник);

КонецПроцедуры // ОбработкаКоманды()

#КонецОбласти // ОбработчикиСобытий

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Функция ОграничениеТипа(Знач ПараметрКоманды)

	ОграничениеТипа = Новый Массив();
	Если ТипЗнч(ПараметрКоманды) = Тип("Массив") Тогда
		Для Каждого ТекСсылка Из ПараметрКоманды Цикл
			ТекТип = ТипЗнч(ТекСсылка);
			Если НЕ ОграничениеТипа.Найти(ТекТип) = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			ОграничениеТипа.Добавить(ТекТип);
		КонецЦикла;
	Иначе
		ОграничениеТипа.Добавить(ТипЗнч(ПараметрКоманды));
	КонецЕсли;
	
	Возврат Новый ОписаниеТипов(ОграничениеТипа);

КонецФункции // ОграничениеТипа()

#КонецОбласти // СлужебныеПроцедурыИФункции
