Перем ПреобразованиеДанных;

#Область ПрограммныйИнтерфейс

// Функция - Подтверждает, что обработка является обработкой обслуживания
// 
// Возвращаемое значение:
//  Булево - Истина
//
Функция ЭтоОбработкаПроверкиСобытия() Экспорт
	
	Возврат Истина;
	
КонецФункции // ЭтоОбработкаПроверкиСобытия()

// Функция - Получает форму обработчиков команд, где расположены процедуры-обработчики команд
// 			 из списка действий кнопки открытия поля выбора обработки обслуживания
// 
// Возвращаемое значение:
//  Строка - Имя формы обработчиков комманд
//
Функция ПолучитьФормуОбработчиковКоманд() Экспорт
	
	Возврат "Форма";
	
КонецФункции // ПолучитьФормуОбработчиковКоманд()

// Функция - Получает список действий кнопки открытия поля выбора обработки обслуживания
// 
// Возвращаемое значение:
//  СписокЗначений - Список действий
//
Функция ПолучитьСписокДействийКнопкиОткрытия() Экспорт
	
	СписокДействий = Новый СписокЗначений();
	
	Возврат СписокДействий;
	
КонецФункции // ПолучитьСписокДействийКнопкиОткрытия()

// Функция - Выполняет проверку условий регистрации события
//
// Параметры:
//  Источник			 - Объект, НаборЗаписей						- Объект - источник возникновения события
//  Событие				 - СправочникСсылка.бир_События				- Проверяемое событие
//  ПараметрыПодписки	 - Структура								- Параметры обработчика подписки на событие, в котором выполняется проверка
//  ПараметрыСобытия	 - Структура								 - Параметры события для сохранения
// 
// Возвращаемое значение:
//  Булево - Истина - событие произошло (проверка выполнена успешно)
//
Функция ПроверитьНаступлениеСобытия(Источник, Событие, ПараметрыПодписки, ПараметрыСобытия) Экспорт
	
	МоментПроверки = Неопределено;
	ПараметрыПодписки.Свойство("МоментПроверки", МоментПроверки);
	
	ИдОбъектаМетаданных = Неопределено;
	ПараметрыПодписки.Свойство("ИдОбъектаМетаданных", ИдОбъектаМетаданных);
	
	Если МоментПроверки = "ПередЗаписью" Тогда
		
		Настройка = Событие.ОбработкаНастройки.Получить();
		Если НЕ Настройка.Свойство("Запрос_ИменаТаблиц")
			ИЛИ Настройка.Запрос_ИменаТаблиц.Найти(ИдОбъектаМетаданных.ПолноеИмя) = Неопределено Тогда
			
			Возврат Ложь;
		
		КонецЕсли;
		
		Если ПреобразованиеДанных().ЭтоНаборЗаписейРегистра(Источник) Тогда
			СтрокиСвязанныхДанных = Настройка.СвязанныеДанные.НайтиСтроки(Новый Структура("Использование, ОбъектСистемы", Истина, ИдОбъектаМетаданных));
			Если СтрокиСвязанныхДанных.Количество() > 0 И Источник.Количество() > 0 Тогда
				СсылкаОсновногоОбъект = Источник[0][СтрокиСвязанныхДанных[0].Поле];
			Иначе
				Возврат Ложь;
			КонецЕсли;
		Иначе
			СсылкаОсновногоОбъект = Источник.Ссылка;
		КонецЕсли;
		
		ПередатьДляОбработки = Ложь;
		Если Настройка.Свойство("ПередатьДляОбработки") Тогда
			ПередатьДляОбработки = Настройка.ПередатьДляОбработки;
		КонецЕсли;
		Источник.ДополнительныеСвойства.Вставить("бир_События_ПередатьДляОбработки", ПередатьДляОбработки);
		
		РезультатыПроизвольныхДанных = Неопределено;
		
		Если НЕ Источник.ДополнительныеСвойства.Свойство("бир_События_ТаблицыПроизвольныхДанных", РезультатыПроизвольныхДанных) Тогда
			РезультатыПроизвольныхДанных = Новый Соответствие;
		КонецЕсли;
		
		РезультатЗапроса = ПолучитьРезультатЗапроса(Настройка, СсылкаОсновногоОбъект);
		
		РезультатыПроизвольныхДанных.Вставить(Событие, РезультатЗапроса);
		
		ЗаполнитьИсточникВПараметрахСобытия(ПараметрыСобытия, Настройка, РезультатЗапроса);
		
		Источник.ДополнительныеСвойства.Вставить("бир_События_ЕстьПроизвольныеИзменения", Ложь);
		Источник.ДополнительныеСвойства.Вставить("бир_События_РезультатыПроизвольныхДанных", РезультатыПроизвольныхДанных);
		
		Возврат Ложь;
		
	ИначеЕсли МоментПроверки = "ПриЗаписи" Тогда
		
		Настройка = Событие.ОбработкаНастройки.Получить();
		Если НЕ Настройка.Свойство("Запрос_ИменаТаблиц")
			ИЛИ Настройка.Запрос_ИменаТаблиц.Найти(ИдОбъектаМетаданных.ПолноеИмя) = Неопределено Тогда
			
			Возврат Ложь;
		
		КонецЕсли;
		
		Если ПреобразованиеДанных().ЭтоНаборЗаписейРегистра(Источник) Тогда
			СтрокиСвязанныхДанных = Настройка.СвязанныеДанные.НайтиСтроки(Новый Структура("Использование, ОбъектСистемы", Истина, ИдОбъектаМетаданных));
			Если СтрокиСвязанныхДанных.Количество() > 0 И Источник.Количество() > 0 Тогда
				СсылкаОсновногоОбъект = Источник[0][СтрокиСвязанныхДанных[0].Поле];
			Иначе
				Возврат Ложь;
			КонецЕсли;
		Иначе
			СсылкаОсновногоОбъект = Источник.Ссылка;
		КонецЕсли;
		
		РезультатыПроизвольныхДанных = Неопределено;
		Источник.ДополнительныеСвойства.Свойство("бир_События_РезультатыПроизвольныхДанных", РезультатыПроизвольныхДанных);
		
		ПередатьДляОбработки = Ложь;
		Источник.ДополнительныеСвойства.Свойство("бир_События_ПередатьДляОбработки", ПередатьДляОбработки);
		
		Если РезультатыПроизвольныхДанных = Неопределено Тогда
			
			РезультатыПроизвольныхДанных = Новый Соответствие;
			
		КонецЕсли;
		
		РезультатЗапросаСтарый = РезультатыПроизвольныхДанных.Получить(Событие);
		
		РезультатЗапроса = ПолучитьРезультатЗапроса(Настройка, СсылкаОсновногоОбъект);
		
		ИзмененныеРеквизитыСписок = Неопределено;
		
		РезультатыРазличны = РезультатыЗапросаРазличны(РезультатЗапросаСтарый, РезультатЗапроса, ИзмененныеРеквизитыСписок);
		
		ЗаполнитьИсточникВПараметрахСобытия(ПараметрыСобытия, Настройка, РезультатЗапроса);
		
		Если РезультатыРазличны Тогда
			
			ПараметрыСобытия.Вставить("ИзмененныеРеквизиты", ИзмененныеРеквизитыСписок);
			
			Если ПередатьДляОбработки = Истина Тогда
				
				ОписаниеОбъекта = Новый Структура();
				Для Каждого ТекКолонка Из РезультатЗапроса.Колонки Цикл
					Если ТекКолонка.Имя = Настройка.ОсновнойОбъект Тогда
						ОписаниеОбъекта.Вставить("Ссылка");
						Продолжить;
					КонецЕсли;
					ОписаниеОбъекта.Вставить(ТекКолонка.Имя);
				КонецЦикла;
				Если НЕ ЗначениеЗаполнено(РезультатЗапроса) Тогда
					РезультатЗапроса.Добавить();
				КонецЕсли;
				ЗаполнитьЗначенияСвойств(ОписаниеОбъекта, РезультатЗапроса[0]);
				ОписаниеОбъекта.Ссылка = РезультатЗапроса[0][Настройка.ОсновнойОбъект];
				
				СериализованныйОбъект = СериализоватьОбъект(ОписаниеОбъекта);
				Если СериализованныйОбъект.Свойство("__Тип") И СериализованныйОбъект.Свойство("Ссылка") Тогда
					СериализованныйОбъект.__Тип = СтрЗаменить(СериализованныйОбъект.Ссылка.__Тип, "Ссылка.", "Объект.");
				КонецЕсли;
				ПараметрыСобытия.Вставить("ДанныеОбъекта", СериализованныйОбъект);
				
			КонецЕсли;
			
			ИзмененныеРеквизитыТекст = "отсутствуют";
			Для Каждого ТекЭлемент Из ИзмененныеРеквизитыСписок Цикл
				ИзмененныеРеквизитыТекст = СтрШаблон("%1%2%3",
				                                     ?(ИзмененныеРеквизитыТекст = "отсутствуют", "", ИзмененныеРеквизитыТекст),
													 ?(ИзмененныеРеквизитыТекст = "отсутствуют", "", ", "),
				                                     ТекЭлемент.Ключ);
			КонецЦикла;
			ПараметрыСобытия.Вставить("РезультатПроверки",
			                          СтрШаблон("Зарегистрировано изменение данных ""%1"" изменены реквизиты ""%2""",
									            ОписаниеОбъекта.Ссылка,
									            ИзмененныеРеквизитыТекст));
		КонецЕсли;
		
		Возврат РезультатыРазличны;

	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции // ПроверитьНаступлениеСобытия()

#КонецОбласти

#Область СлужебныеПроцедуры

// Функция - Выполняет запрос из переваемого параметра и возвращает результат в виде таблицы значений
//
// Параметры:
//  Настройка	 			Структура	- Структура произвольного запроса
// 
// Возвращаемое значение:
//   ТаблицаЗнчений 
//
Функция ПолучитьРезультатЗапроса(Настройка, Источник)
	
	ОбработкаЗапросов = Обработки.бир_ПроцессорЗапросов.Создать();
	
	Запрос_Текст = Неопределено;
	Запрос_Параметры = Неопределено;
	ПроизвольныеВыражения = Неопределено;
	Настройка.Свойство("Запрос_Текст", Запрос_Текст);
	Настройка.Свойство("Запрос_Параметры", Запрос_Параметры);
	Настройка.Свойство("ПроизвольныеВыражения", ПроизвольныеВыражения);
	
	ПараметрыВыражений = Новый Структура("Источник", Источник);
	
	ОбработкаЗапросов.УстановитьТекстЗапроса(Запрос_Текст);
	ОбработкаЗапросов.УстановитьПараметрыЗапроса(Запрос_Параметры);
	ОбработкаЗапросов.УстановитьПроизвольныеВыражения(ПроизвольныеВыражения);
	ОбработкаЗапросов.УстановитьДополнительныеПараметры(ПараметрыВыражений);

	Возврат ОбработкаЗапросов.ВыполнитьЗапрос();	
	
КонецФункции // ПолучитьРезультатЗапроса()

// Функция - Сверяет таблицы значений как результаты запросов на различия
//
// Параметры:
//  ТаблицаРезультатаСтарая	 - 	ТаблицаЗначений - Таблица результата запроса до записи объекта
//  ТаблицаРезультата		 - 	ТаблицаЗначений - Таблица результата запроса при записи объекта
// 
// Возвращаемое значение:
//   Булево - Истина - Есть различия в таблицах значений
//
Функция РезультатыЗапросаРазличны(ТаблицаРезультатаСтарая, ТаблицаРезультата, ИзмененныеРеквизитыСписок)
	
	Возврат НЕ ДанныеСовпадают(ТаблицаРезультатаСтарая, ТаблицаРезультата, ИзмененныеРеквизитыСписок);
	
КонецФункции // РезультатыЗапросаРазличны()

// Сравнивает данные сложной структуры с учетом вложенности.
//
// Параметры:
//  Данные1 - Структура,    ФиксированнаяСтруктура -
//          - Соответствие, ФиксированноеСоответствие -
//          - Массив,       ФиксированныйМассив - 
//          - ХранилищеЗначения, ТаблицаЗначений - сложные типы для сравнения.
//          - Строка, Число, Булево - простые типы, которые можно сравнивать на равно.
//
//  Данные2 - Произвольный - те же типы, что и для параметра Данные1.
//
// Возвращаемое значение:
//  Булево.
//
Функция ДанныеСовпадают(Данные1, Данные2, ИзмененныеРеквизитыСписок = Неопределено)
	
	
	Если ТипЗнч(Данные1) <> ТипЗнч(Данные2) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если ТипЗнч(Данные1) = Тип("Структура")
	 ИЛИ ТипЗнч(Данные1) = Тип("ФиксированнаяСтруктура") Тогда
		
		Если Данные1.Количество() <> Данные2.Количество() Тогда
			Возврат Ложь;
		КонецЕсли;
		
		Для каждого КлючИЗначение Из Данные1 Цикл
			СтароеЗначение = Неопределено;
			
			Если НЕ Данные2.Свойство(КлючИЗначение.Ключ, СтароеЗначение)
			 ИЛИ НЕ ДанныеСовпадают(КлючИЗначение.Значение, СтароеЗначение) Тогда
			
				Возврат Ложь;
			КонецЕсли;
		КонецЦикла;
		
		Возврат Истина;
		
	ИначеЕсли ТипЗнч(Данные1) = Тип("Соответствие")
	      ИЛИ ТипЗнч(Данные1) = Тип("ФиксированноеСоответствие") Тогда
		
		Если Данные1.Количество() <> Данные2.Количество() Тогда
			Возврат Ложь;
		КонецЕсли;
		
		КлючиНовогоСоответствия = Новый Соответствие;
		
		Для каждого КлючИЗначение Из Данные1 Цикл
			КлючиНовогоСоответствия.Вставить(КлючИЗначение.Ключ, Истина);
			СтароеЗначение = Данные2.Получить(КлючИЗначение.Ключ);
			
			Если НЕ ДанныеСовпадают(КлючИЗначение.Значение, СтароеЗначение) Тогда
				Возврат Ложь;
			КонецЕсли;
		КонецЦикла;
		
		Для каждого КлючИЗначение Из Данные2 Цикл
			Если КлючиНовогоСоответствия[КлючИЗначение.Ключ] = Неопределено Тогда
				Возврат Ложь;
			КонецЕсли;
		КонецЦикла;
		
		Возврат Истина;
		
	ИначеЕсли ТипЗнч(Данные1) = Тип("Массив")
	      ИЛИ ТипЗнч(Данные1) = Тип("ФиксированныйМассив") Тогда
		
		Если Данные1.Количество() <> Данные2.Количество() Тогда
			Возврат Ложь;
		КонецЕсли;
		
		Индекс = Данные1.Количество()-1;
		Пока Индекс >= 0 Цикл
			Если НЕ ДанныеСовпадают(Данные1.Получить(Индекс), Данные2.Получить(Индекс)) Тогда
				Возврат Ложь;
			КонецЕсли;
			Индекс = Индекс - 1;
		КонецЦикла;
		
		Возврат Истина;
		
	ИначеЕсли ТипЗнч(Данные1) = Тип("ТаблицаЗначений") Тогда
		
		ИзмененныеРеквизитыСписок = Новый Соответствие;
		
		Если Данные1.Количество() <> Данные2.Количество() Тогда
			Возврат Ложь;
		КонецЕсли;
		
		Если Данные1.Колонки.Количество() <> Данные2.Колонки.Количество() Тогда
			Возврат Ложь;
		КонецЕсли;
		ЕстьОтличия = Ложь;
		Индекс = 0;
		Для Каждого СтрокаДанных Из Данные1 Цикл
			Для каждого Колонка Из Данные1.Колонки Цикл
				
				Если Данные2.Колонки.Найти(Колонка.Имя) = Неопределено Тогда
					Возврат Ложь;
				КонецЕсли;
				
				Если НЕ ДанныеСовпадают(СтрокаДанных[Колонка.Имя], Данные2[Индекс][Колонка.Имя]) Тогда
					ЕстьОтличия = Истина;
					ИзмененныеРеквизитыСписок.Вставить(Колонка.Имя + "_" + (Индекс + 1), Новый Структура("СтароеЗначение, НовоеЗначение", СтрокаДанных[Колонка.Имя], Данные2[Индекс][Колонка.Имя]));
				КонецЕсли;
			КонецЦикла;
			Индекс = Индекс + 1;
		КонецЦикла;
		Возврат НЕ ЕстьОтличия;
		
	ИначеЕсли ТипЗнч(Данные1) = Тип("ХранилищеЗначения") Тогда
	
		Если НЕ ДанныеСовпадают(Данные1.Получить(), Данные2.Получить()) Тогда
			Возврат Ложь;
		КонецЕсли;
		
		Возврат Истина;
	КонецЕсли;
	
	Возврат Данные1 = Данные2;
	
КонецФункции // ДанныеСовпадают()

// Процедура - Заполняет значение "Источник" в параметрах события по значению основного поля
//
// Параметры:
//  ПараметрыСобытия	 - Структура	- Параметры события для сохранения
//  Настройка	 			Структура	- Структура произвольного запроса
//  РезультатЗапроса - ТаблицаЗначений	 - Результат выполнения запроса в виде таблицы значений
//
Процедура ЗаполнитьИсточникВПараметрахСобытия(ПараметрыСобытия, Настройка, РезультатЗапроса)
	
	ЗначениеОсновногоОбъекта = Неопределено;
	
	Если Настройка.Свойство("ОсновнойОбъект")
		И ЗначениеЗаполнено(Настройка.ОсновнойОбъект)
		И РезультатЗапроса.Колонки.Найти(Настройка.ОсновнойОбъект) <> Неопределено Тогда
		
		МассивЗначенийОсновногоОбъекта = РезультатЗапроса.ВыгрузитьКолонку(Настройка.ОсновнойОбъект);
		
		Если МассивЗначенийОсновногоОбъекта.Количество() > 0 Тогда 
			ЗначениеОсновногоОбъекта = МассивЗначенийОсновногоОбъекта[0];
		КонецЕсли;
		
	КонецЕсли;
	
	ПараметрыСобытия.Вставить("Источник", ЗначениеОсновногоОбъекта);		
	
КонецПроцедуры // ЗаполнитьИсточникВПараметрахСобытия()

// Функция - Получает объект, серриализованный в XML
//
// Параметры:
//  Источник			 - Объект, НаборЗаписей			 - Объект - источник возникновения события
// 
// Возвращаемое значение:
//  Строка - Объект, серриализованный в XML
//
Функция СериализоватьОбъект(Источник)
	
	ДанныеОбъекта = ПреобразованиеДанных().ЗначениеВСтруктуру(Источник);
	
	Возврат ДанныеОбъекта;
	
КонецФункции // СериализоватьОбъект()

Функция ПреобразованиеДанных()
	
	Если ПреобразованиеДанных = Неопределено Тогда 
		ПреобразованиеДанных = Обработки.бир_ПреобразованиеДанных.Создать();
	КонецЕсли;
	
	Возврат ПреобразованиеДанных;
	
КонецФункции // ПреобразованиеДанных()

#КонецОбласти
