
#Область ОписаниеПеременных

&НаКлиенте
Перем ФормаРедактированияЗапроса Экспорт; // ФормаКлиентскогоПриложения   - хранит ссылку на форму редактора запросов
&НаСервере
Перем ПреобразованиеДанных;               // ОбработкаОбъект              - обработка преобразования данных

#КонецОбласти // ОписаниеПеременных

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ОбработкаНастройкиАдресВХранилище") Тогда
		
		ОбработкаНастройкиАдресВХранилище = Параметры.ОбработкаНастройкиАдресВХранилище;
	
		Настройки = ПолучитьИзВременногоХранилища(ОбработкаНастройкиАдресВХранилище);
		
		Если ТипЗнч(Настройки) = Тип("Структура") Тогда
			
			Настройки.Свойство("ОсновнойОбъект"      , ОсновнойОбъект);
			Настройки.Свойство("ТипОсновногоОбъекта" , ТипОсновногоОбъекта);
			Настройки.Свойство("ПередатьДляОбработки", ПередатьДляОбработки);
			
			Если Настройки.Свойство("СвязанныеДанные") Тогда
				ЗначениеВРеквизитФормы(ПреобразованиеДанных().ЗначениеИзСтруктуры(Настройки.СвязанныеДанные), "СвязанныеДанные");
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры // ПриСозданииНаСервере()

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ФормаРедактированияЗапроса();
	
	ЗаполнитьСписокОсновногоОбъекта();
	ЗаполнитьСвязанныеДанные();		

КонецПроцедуры // ПриОткрытии()

&НаКлиенте
Процедура ОсновнойОбъектПриИзменении(Элемент)
	
	ЗаполнитьСписокОсновногоОбъекта();
	ЗаполнитьСвязанныеДанные();		
	
КонецПроцедуры // ОсновнойОбъектПриИзменении()

&НаКлиенте
Процедура СвязанныеДанныеПолеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.СвязанныеДанные.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеВыбора = ТекущиеДанные.ДоступныеПоля;
	
КонецПроцедуры // СвязанныеДанныеПолеНачалоВыбора()

&НаКлиенте
Процедура СвязанныеДанныеПолеОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.СвязанныеДанные.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные.Поле = ВыбранноеЗначение;
	
КонецПроцедуры // СвязанныеДанныеПолеОбработкаВыбора()

#КонецОбласти // ОбработчикиСобытийФормы

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СохранитьНастройку(Команда)
	
	ДополнительныеНастройки = ФормаРедактированияЗапроса().ПолучитьЗапросСПараметрами();
	
	СохранитьНастройкуНаСервере(ДополнительныеНастройки);
	
	Оповестить("ИзмененыНастройки", ЭтаФорма.ВладелецФормы, ЭтаФорма);
	
КонецПроцедуры // СохранитьНастройку()

// Процедура - Серверная процедура, сформировывает настройку и помещает во временное хранилище для передачи владельцу
//
// Параметры:
//  ДополнительныеНастройки	 - Структура - Данные из редактора запроса
//
&НаСервере
Процедура СохранитьНастройкуНаСервере(ДополнительныеНастройки = Неопределено)
	
	Настройка = Новый Структура();
	
	Если ТипЗнч(ДополнительныеНастройки) = Тип("Структура") Тогда
		
		МассивТаблиц  = Новый Массив;
		СхемаЗапроса = Новый СхемаЗапроса();
		СхемаЗапроса.УстановитьТекстЗапроса(ДополнительныеНастройки.Запрос_Текст);
		Для Каждого ТекНастройка Из ДополнительныеНастройки Цикл
			Настройка.Вставить(ТекНастройка.Ключ, ТекНастройка.Значение);
		КонецЦикла;
		
		Для Каждого ЗапросИзПакета Из СхемаЗапроса.ПакетЗапросов Цикл
			Для Каждого Оператор Из ЗапросИзПакета.Операторы Цикл
				
				Для Каждого Источник Из Оператор.Источники Цикл
					
					ИмяТаблицы = Источник.Источник.ИмяТаблицы;
					ИмяМетаданных = ОпределитьИмяМетаданныхПоТаблице(ИмяТаблицы);
					Если МассивТаблиц.Найти(ИмяМетаданных) = Неопределено Тогда
						МассивТаблиц.Добавить(ИмяМетаданных);
					КонецЕсли;
					
				КонецЦикла;
				
			КонецЦикла;
			
		КонецЦикла;
		
		Настройка.Вставить("Запрос_ИменаТаблиц", МассивТаблиц);
		
	КонецЕсли;
	
	Настройка.Вставить("ОсновнойОбъект"      , ОсновнойОбъект);
	Настройка.Вставить("ТипОсновногоОбъекта" , ТипОсновногоОбъекта);
	Настройка.Вставить("ПередатьДляОбработки", ПередатьДляОбработки);
	Настройка.Вставить("СвязанныеДанные"     , ПреобразованиеДанных().ЗначениеВСтруктуру(РеквизитФормыВЗначение("СвязанныеДанные")));
	
	ПоместитьВоВременноеХранилище(Настройка, ОбработкаНастройкиАдресВХранилище);
	
КонецПроцедуры // СохранитьНастройкуНаСервере()

&НаКлиенте
Процедура СохранитьНастройкуИЗакрыть(Команда)
	
	СохранитьНастройку(Команда);
	
	Закрыть("ИзмененыНастройки");
	
КонецПроцедуры // СохранитьНастройкуИЗакрыть()

#КонецОбласти // ОбработчикиКомандФормы

#Область СлужебныеПроцедуры

// Функция - Получает список реквизитов заказа клиента
// 
// Возвращаемое значение:
//   СписокЗначений - Список реквизитов заказа клиента
//

&НаКлиенте
Процедура РедактироватьЗапрос(Команда)
	
	ФормаРедактированияЗапроса.Открыть();
	
КонецПроцедуры // РедактироватьЗапрос()

// Процедура - Получает структуру настроек из формы редактирования запроса
//			   и вызывает серверную функцию ЗаполнитьСписокОсновногоОбъектаНаСервере
//
&НаКлиенте
Процедура ЗаполнитьСписокОсновногоОбъекта()
	
	ДополнительныеНастройки = ФормаРедактированияЗапроса().ПолучитьЗапросСПараметрами();
		
	ЗаполнитьСписокОсновногоОбъектаНаСервере(ДополнительныеНастройки);
		
КонецПроцедуры // ЗаполнитьСписокОсновногоОбъекта()

&НаСервере
// Процедура - Заполняет список выбора реквизита Основной объект
//
// Параметры:
//  ДополнительныеНастройки	 - Структура	 -  Структура настроек из формы редактирования запроса
//
Процедура ЗаполнитьСписокОсновногоОбъектаНаСервере(ДополнительныеНастройки)
	
	Элементы.ОсновнойОбъект.СписокВыбора.Очистить();
	
	Если НЕ ЗначениеЗаполнено(ДополнительныеНастройки.Запрос_Текст) Тогда
		Возврат;
	КонецЕсли;
	
	СхемаЗапроса = Новый СхемаЗапроса();
	Попытка
		СхемаЗапроса.УстановитьТекстЗапроса(ДополнительныеНастройки.Запрос_Текст);
	Исключение
		ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		Сообщить("Ошибка получения текста запроса: " + Символы.ПС + ТекстОшибки);
	КонецПопытки;
	
	Для Каждого ЗапросИзПакета Из СхемаЗапроса.ПакетЗапросов Цикл
		Для Каждого Колонка Из ЗапросИзПакета.Колонки Цикл
			Если ОсновнойОбъект = Колонка.Псевдоним Тогда
				ТипОсновногоОбъекта = Колонка.ТипЗначения;
			КонецЕсли;
			Элементы.ОсновнойОбъект.СписокВыбора.Добавить(Колонка.Псевдоним, Колонка.Псевдоним);
		КонецЦикла;
	
	КонецЦикла;
		
КонецПроцедуры // ЗаполнитьСписокОсновногоОбъектаНаСервере()

// Процедура - Получает структуру настроек из формы редактирования запроса
//			   и вызывает серверную функцию ЗаполнитьСвязанныеДанныеНаСервере
//
&НаКлиенте
Процедура ЗаполнитьСвязанныеДанные()
	
	ДополнительныеНастройки = ФормаРедактированияЗапроса().ПолучитьЗапросСПараметрами();
		
	ЗаполнитьСвязанныеДанныеНаСервере(ДополнительныеНастройки);
		
КонецПроцедуры // ЗаполнитьСвязанныеДанные()

&НаСервере
// Процедура - таблицу связанных данных
//
// Параметры:
//  ДополнительныеНастройки	 - Структура	 -  Структура настроек из формы редактирования запроса
//
Процедура ЗаполнитьСвязанныеДанныеНаСервере(ДополнительныеНастройки)
	
	Если НЕ ЗначениеЗаполнено(ДополнительныеНастройки.Запрос_Текст) Тогда
		Возврат;
	КонецЕсли;
	
	СхемаЗапроса = Новый СхемаЗапроса();
	Попытка
		СхемаЗапроса.УстановитьТекстЗапроса(ДополнительныеНастройки.Запрос_Текст);
	Исключение
		ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ВызватьИсключение СтрШаблон("Ошибка получения текста запроса:%1%2", Символы.ПС, ТекстОшибки);
	КонецПопытки;
	
	ДоступныеТаблицы = Новый Соответствие();
	
	Для Каждого ЗапросПакета Из СхемаЗапроса.ПакетЗапросов Цикл
		Если ТипЗнч(ЗапросПакета) = Тип("ЗапросУничтоженияТаблицыСхемыЗапроса") Тогда
			Продолжить;
		КонецЕсли;
		
		Для Каждого ТекОператор Из ЗапросПакета.Операторы Цикл
			Для Каждого ТекИсточник Из ТекОператор.Источники Цикл
				ТаблицыИсточника = ПолучитьТаблицыИсточникаЗапроса(ТекИсточник);
				Для Каждого ТекТаблица Из ТаблицыИсточника Цикл
					Если ДоступныеТаблицы[ТекТаблица.Ключ] = Неопределено Тогда
						ДоступныеТаблицы.Вставить(ТекТаблица.Ключ, ТекТаблица.Значение);
					КонецЕсли;
				КонецЦикла;
			КонецЦикла;
		КонецЦикла;
	
	КонецЦикла;
	
	ТекСвязанныеДанные = РеквизитФормыВЗначение("СвязанныеДанные");
	
	СвязанныеДанные.Очистить();
	
	Для Каждого ТекТаблица Из ДоступныеТаблицы Цикл
		НоваяСтрока = СвязанныеДанные.Добавить();
		НоваяСтрока.ДоступныеПоля = ТекТаблица.Значение;
		СуществующиеСтроки = ТекСвязанныеДанные.НайтиСтроки(Новый Структура("ОбъектСистемы", ТекТаблица.Ключ));
		Если СуществующиеСтроки.Количество() = 0 Тогда
			НоваяСтрока.ОбъектСистемы = ТекТаблица.Ключ;
		Иначе
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СуществующиеСтроки[0]);
			Если ЗначениеЗаполнено(НоваяСтрока.Поле) И НоваяСтрока.ДоступныеПоля.НайтиПоЗначению(НоваяСтрока.Поле) = Неопределено Тогда
				НоваяСтрока.Поле = "";
			КонецЕсли;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(НоваяСтрока.Поле) И НоваяСтрока.ДоступныеПоля.Количество() = 1 Тогда
			НоваяСтрока.Поле = НоваяСтрока.ДоступныеПоля[0].Значение;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры // ЗаполнитьСвязанныеДанныеНаСервере()

&НаСервере
Функция ПолучитьТаблицыИсточникаЗапроса(Источник)
	
	ДоступныеТаблицы = Новый Соответствие();

	Если ТипЗнч(Источник.Источник) = Тип("ТаблицаСхемыЗапроса") Тогда
		ТекТаблица = ОпределитьИмяМетаданныхПоТаблице(Источник.Источник.ИмяТаблицы);
		ТекТаблица = бир_События.ИдентификаторОбъектаМетаданных(ТекТаблица);
		
		Если ЗначениеЗаполнено(ТекТаблица) Тогда
			ДоступныеПоля = ПолучитьДоступныеПоляТаблицы(Источник.Источник.ДоступныеПоля);
			ДоступныеТаблицы.Вставить(ТекТаблица, ДоступныеПоля);
		КонецЕсли;
		
		Для Каждого ТекСоединение Из Источник.Соединения Цикл
			ТаблицыСоединения = ПолучитьТаблицыИсточникаЗапроса(ТекСоединение.Источник);
			Для Каждого ТекТаблица Из ТаблицыСоединения Цикл
				Если ДоступныеТаблицы[ТекТаблица.Ключ] = Неопределено Тогда
					ДоступныеТаблицы.Вставить(ТекТаблица.Ключ, ТекТаблица.Значение);
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
	ИначеЕсли ТипЗнч(Источник.Источник) = Тип("ВложенныйЗапросСхемыЗапроса") Тогда
		Для Каждого ТекОператор Из Источник.Источник.Запрос.Операторы Цикл
			Для Каждого ТекИсточник Из ТекОператор.Источники Цикл
				ТаблицыСоединения = ПолучитьТаблицыИсточникаЗапроса(ТекИсточник);
				Для Каждого ТекТаблица Из ТаблицыСоединения Цикл
					Если ДоступныеТаблицы[ТекТаблица.Ключ] = Неопределено Тогда
						ДоступныеТаблицы.Вставить(ТекТаблица.Ключ, ТекТаблица.Значение);
					КонецЕсли;
				КонецЦикла;
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
	
	Возврат ДоступныеТаблицы;
	
КонецФункции // ПолучитьТаблицыИсточникаЗапроса()

&НаСервере
Функция ПолучитьДоступныеПоляТаблицы(Поля)
	
	ДоступныеПоля = Новый СписокЗначений();
	
	Для Каждого ТекПоле Из Поля Цикл
		Если ТипЗнч(ТекПоле) = Тип("ДоступноеПолеСхемыЗапроса") Тогда
			ДобавлятьПоле = Ложь;
			Для Каждого ТекТип Из ТекПоле.ТипЗначения.Типы() Цикл
				Если ТипОсновногоОбъекта.СодержитТип(ТекТип) Тогда
					ДобавлятьПоле = Истина;
				КонецЕсли;
			КонецЦикла;
			Если НЕ ДобавлятьПоле Тогда
				Продолжить;
			КонецЕсли;
			Если ДоступныеПоля.НайтиПоЗначению(ТекПоле.Имя) = Неопределено Тогда
				ДоступныеПоля.Добавить(ТекПоле.Имя, ТекПоле.Имя); 
			КонецЕсли;
		ИначеЕсли ТипЗнч(ТекПоле) = Тип("ДоступнаяВложеннаяТаблицаСхемыЗапроса") Тогда
			ВложенныеПоля = ПолучитьДоступныеПоляТаблицы(ТекПоле.Поля);
			Для Каждого ТекВложенноеПоле Из ВложенныеПоля Цикл
				Если ДоступныеПоля.НайтиПоЗначению(ТекПоле.Имя) = Неопределено Тогда
					ДоступныеПоля.Добавить(ТекПоле.Имя, ТекПоле.Имя); 
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ДоступныеПоля;
	
КонецФункции // ПолучитьДоступныеПоляТаблицы()

// Функция - Получает обработку сериализации значений
//
// Возвращаемое значение:
//   ВнешняяОбработкаОбъект    - обработка преобразования данных
//
&НаСервере
Функция ПреобразованиеДанных() Экспорт

	Если ПреобразованиеДанных = Неопределено Тогда
		ПреобразованиеДанных = Обработки.бир_ПреобразованиеДанных.Создать();
	КонецЕсли;

	Возврат ПреобразованиеДанных; 

КонецФункции // ПреобразованиеДанных()

// Функция - Получает форму редактирования запросов
// 
// Возвращаемое значение:
//		УправляемаяФорма - Форма редактирования запроса
//
&НаКлиенте
Функция ФормаРедактированияЗапроса() Экспорт
	
	Если ФормаРедактированияЗапроса = Неопределено Тогда
		СтруктураПараметров = Новый Структура("Запрос_Текст, Запрос_Параметры, ПроизвольныеВыражения, Запрос_ИменаТаблиц", "", Неопределено, Неопределено, Новый Массив);
		
		Попытка
			Настройки = ПолучитьИзВременногоХранилища(ОбработкаНастройкиАдресВХранилище);
		Исключение
			ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			Настройки = Новый Структура();
		КонецПопытки;
		
		Если ТипЗнч(Настройки) = Тип("Структура") Тогда
			
			Если Настройки.Свойство("Запрос_Текст") Тогда
				СтруктураПараметров.Запрос_Текст = Настройки.Запрос_Текст;
			КонецЕсли;
				
			Если Настройки.Свойство("Запрос_Параметры") Тогда
				СтруктураПараметров.Запрос_Параметры = Настройки.Запрос_Параметры;
			КонецЕсли;
			
			Если Настройки.Свойство("ПроизвольныеВыражения") Тогда
				СтруктураПараметров.ПроизвольныеВыражения = Настройки.ПроизвольныеВыражения;
			КонецЕсли;
			
		КонецЕсли;
		
		ФормаРедактированияЗапроса = ПолучитьФорму("Обработка.бир_ПроцессорЗапросов.Форма.Форма", СтруктураПараметров, ЭтаФорма);
		ФормаРедактированияЗапроса.ОписаниеОповещенияОЗакрытии =
			Новый ОписаниеОповещения("ФормаРедактированияЗапросаЗакрытие", ЭтотОбъект);
	КонецЕсли;
	
	Возврат ФормаРедактированияЗапроса;
	
КонецФункции // ФормаРедактированияЗапроса()

// Процедура - обработчик события закрытия формы редактирования запроса
//
// Параметры:
//   РезультатЗакрытия          - Строка       - данные, возвращенные при закрытии формы
//   ДополнительныеПараметры    - Структура    - параметры обработки
//
&НаКлиенте
Процедура ФормаРедактированияЗапросаЗакрытие(РезультатЗакрытия, ДополнительныеПараметры) Экспорт

	Если РезультатЗакрытия = "ИзмененыНастройки" Тогда
		ЗаполнитьСписокОсновногоОбъекта();
		ЗаполнитьСвязанныеДанные();		
	КонецЕсли;

КонецПроцедуры // ФормаРедактированияЗапросаЗакрытие()

// Функция - Определяет имя метаданных по имени таблицы, необходимо для отсечения 
//
// Параметры:
//  ИмяТаблицы	 - Строка	 - Например, "Справочник.Контрагенты.КонтактнаяИнформация"
// 
// Возвращаемое значение:
//  Строка - имя метаданных, например, "Справочник.Контрагенты"
//
&НаСервереБезКонтекста
Функция ОпределитьИмяМетаданныхПоТаблице(ИмяТаблицы)
	
	МассивСлов = СтрРазделитьСтар(ИмяТаблицы, ".", Ложь);
	
	Если МассивСлов.Количество() > 2 Тогда
		Возврат МассивСлов[0] + "." + МассивСлов[1];
	КонецЕсли;
	
	Возврат ИмяТаблицы;
	
КонецФункции // ОпределитьИмяМетаданныхПоТаблице()

// Функция "расщепляет" строку на подстроки, используя заданныйразделитель.
// (используется для режима совместимости с версиями < 8.3.6)
//
//	Параметры: 
//		Стр            -    строка, которую необходимо разложить на подстроки. 
//		                    Параметр передается по значению.
//		Разделитель    -    строка-разделитель, по умолчанию - запятая.
//		ВключатьПустые -    Указывает необходимость включать в результат пустые строки.
//
//
//	Возвращаемое значение:
//		массив значений, элементы которого - подстроки
//
&НаСервереБезКонтекста
Функция СтрРазделитьСтар(Знач Стр, Разделитель = ",", ВключатьПустые = Истина) Экспорт
	
	МассивСтрок = Новый Массив();
	Если Разделитель = " " Тогда
		Стр = СокрЛП(Стр);
		Пока Истина Цикл
			Поз = Найти(Стр, Разделитель);
			Если Поз = 0 Тогда
				МассивСтрок.Добавить(Стр);
				Возврат МассивСтрок;
			КонецЕсли;
			МассивСтрок.Добавить(Лев(Стр, Поз - 1));
			Стр = СокрЛ(Сред(Стр, Поз));
		КонецЦикла;
	Иначе
		ДлинаРазделителя = СтрДлина(Разделитель);
		Пока Истина Цикл
			Поз = Найти(Стр, Разделитель);
			Если Поз = 0 Тогда
				МассивСтрок.Добавить(Стр);
				Возврат МассивСтрок;
			КонецЕсли;
			Значение = Лев(Стр, Поз - 1);
			Если НЕ ПустаяСтрока(Значение) ИЛИ ВключатьПустые Тогда
				МассивСтрок.Добавить(Значение);
			КонецЕсли;
			Стр = Сред(Стр, Поз + ДлинаРазделителя);
		КонецЦикла;
	КонецЕсли;
	
КонецФункции // СтрРазделитьСтар()

#КонецОбласти // СлужебныеПроцедуры
