
&НаСервереБезКонтекста
Процедура СписокПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	
	Для Каждого ТекСтрока Из Строки Цикл
		
		Если ТекСтрока.Ключ.ЭтоГруппа Тогда
			Продолжить;
		КонецЕсли;
		Если ЗначениеЗаполнено(ТекСтрока.Ключ.Значение) Тогда
			Продолжить;
		КонецЕсли;
		
		Если ТекСтрока.Ключ.Список.Количество() = 0 Тогда
			ТекСтрока.Значение.Оформление["Значение"].УстановитьЗначениеПараметра("Текст", "<не заполнено>");
		КонецЕсли;
		
		ТекстЗначения = "";
		Для Каждого ТекСтрокаЗначения Из ТекСтрока.Ключ.Список Цикл
			ТекстЗначения = ТекстЗначения + ?(ТекстЗначения = "", "", ", ") + СокрЛП(ТекСтрокаЗначения.Значение);
		КонецЦикла;
		
		ТекСтрока.Значение.Оформление["Значение"].УстановитьЗначениеПараметра("Текст", ТекстЗначения);
		
	КонецЦикла;
	
КонецПроцедуры // СписокПриПолученииДанныхНаСервере()
