#Область ОписаниеПеременных

&НаСервере
Перем ЭтаОбработка;               // ОбработкаОбъект.бир_СохранениеВосстановлениеДанных - объект текущей обработки

&НаСервере
Перем ПреобразованиеДанных;       // ОбработкаОбъект.бир_ПреобразованиеДанных - объект обработки преобразование данных

&НаКлиенте
Перем ФормаРедактированияЗапроса; // ФормаКлиентскогоПриложения - форма редактора запроса

#КонецОбласти // ОписаниеПеременных

#Область ОбработчикиСобытийФормы

// Процедура - обработчик события "ПриСозданииНаСервере" формы
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.ВерсияОбработкиПреобразованияДанных.Заголовок =
	    СтрШаблон("SerLib1C v. %1", ПреобразованиеДанных().Версия());
	
	Параметры.Свойство("РезервноеКопирование"         , РезервноеКопирование);
	Параметры.Свойство("ПоказатьДиалогВыбора"         , ПоказатьДиалогВыбора);
	Параметры.Свойство("ВыполнятьОбработчикиПриЗаписи", ВыполнятьОбработчикиПриЗаписи);
	
	ВосстанавливатьВТранзакции = Истина;
	Если Параметры.Свойство("ВосстанавливатьВТранзакции") Тогда
		ВосстанавливатьВТранзакции = Параметры.ВосстанавливатьВТранзакции;
	КонецЕсли;
	
	ПоказатьДиалогВыбора = Истина;
	Если Параметры.Свойство("ПоказатьДиалогВыбора") Тогда
		ПоказатьДиалогВыбора = Параметры.ПоказатьДиалогВыбора;
	КонецЕсли;
	
	ВыгружатьСвязанныеДанные = Истина;
	Если Параметры.Свойство("ВыгружатьСвязанныеДанные") Тогда
		ВыгружатьСвязанныеДанные = Параметры.ВыгружатьСвязанныеДанные;
	КонецЕсли;
	
КонецПроцедуры // ПриСозданииНаСервере()

// Процедура - обработчик события "ПриОткрытии" формы
//
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ФормаРедактированияЗапроса();
	
	ОбновитьСписокКолонокЗапроса();
	
КонецПроцедуры // ПриОткрытии()

#КонецОбласти // ОбработчикиСобытийФормы

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Процедура - обработчик события "ПриИзменении" элемента формы "СписокОбъектовТипЗначения"
//
&НаКлиенте
Процедура СписокОбъектовТипЗначенияПриИзменении(Элемент)
	
	Элементы.СписокОбъектовПодбор.Видимость = (СписокОбъектов.ТипЗначения.Типы().Количество() = 1);
	
КонецПроцедуры // СписокОбъектовТипЗначенияПриИзменении()

// Процедура - обработчик события "ПриИзменении" элемента формы "СписокОбъектов"
//
&НаКлиенте
Процедура СписокОбъектовПриИзменении(Элемент)
	
	УстановитьФлагВыгрузкиДвижений();
	
КонецПроцедуры // СписокОбъектовПриИзменении()

#КонецОбласти // ОбработчикиСобытийЭлементовШапкиФормы

#Область ОбработчикиКомандФормы

// Процедура - обработчик команды "РедактироватьЗапрос"
//
&НаКлиенте
Процедура РедактироватьЗапрос(Команда)
	
	ФормаРедактированияЗапроса().Открыть();
	
КонецПроцедуры // РедактироватьЗапрос()

// Процедура - обработчик команды "ЗаполнитьСписокОбъектов"
//
&НаКлиенте
Процедура ЗаполнитьСписокОбъектов(Команда)
	
	НастройкиПолученияДанных = ФормаРедактированияЗапроса().ПолучитьЗапросСПараметрами();
	
	ЗаполнитьСписокОбъектовНаСервере(НастройкиПолученияДанных);
	
КонецПроцедуры // ЗаполнитьСписокОбъектов()

// Процедура - заполняет список объектов по указанным настройкам процессора запрососв
//
// Параметры:
//  НастройкиПолученияДанных   - Структура             - настройки процессора запросов
//    *Запрос_Текст               - Строка               - текст запроса
//    *Запрос_Параметры           - Массив из Структура  - таблица параметров запроса
//    *ПроизвольныеВыражения      - Массив из Структура  - таблица произвольных функций
//
&НаСервере
Процедура ЗаполнитьСписокОбъектовНаСервере(Знач НастройкиПолученияДанных)
	
	СписокОбъектов.Очистить();
	
	ПроцессорЗапросов = Обработки.бир_ПроцессорЗапросов.Создать();
	ПроцессорЗапросов.УстановитьТекстЗапроса(НастройкиПолученияДанных.Запрос_Текст);
	ПроцессорЗапросов.УстановитьПараметрыЗапроса(НастройкиПолученияДанных.Запрос_Параметры);
	ПроцессорЗапросов.УстановитьПроизвольныеВыражения(НастройкиПолученияДанных.ПроизвольныеВыражения);
	
	Попытка
		РезультатЗапроса = ПроцессорЗапросов.ВыполнитьЗапрос(0, Ложь);
	Исключение
		ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ТекстОшибки = СтрШаблон("Ошибка выполнения запроса 1С:%1%2", Символы.ПС, ТекстОшибки);
		ВызватьИсключение ТекстОшибки;
	КонецПопытки;
	
	Если РезультатЗапроса.Пустой() Тогда
		ОбщегоНазначения.СообщитьПользователю("Запрос не вернул результатов!");
		Возврат;
	КонецЕсли;
	
	ТипыОбъектов = Новый Массив();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ТекСсылка = СписокОбъектов.ТипЗначения.ПривестиЗначение(Выборка[КолонкаЗапроса]);
		Если НЕ ЗначениеЗаполнено(ТекСсылка) Тогда
			Продолжить;
		КонецЕсли;
		СписокОбъектов.Добавить(Выборка[КолонкаЗапроса]);
		ТипСсылки = ТипЗнч(Выборка[КолонкаЗапроса]);
		Если ТипыОбъектов.Найти(ТипСсылки) = Неопределено Тогда
			ТипыОбъектов.Добавить(ТипСсылки);
		КонецЕсли;
	КонецЦикла;
	
	Если ТипыОбъектов.Количество() > 0 Тогда
		СписокОбъектов.ТипЗначения = Новый ОписаниеТипов(ТипыОбъектов);
	КонецЕсли;
	
	Элементы.СписокОбъектовПодбор.Видимость = (СписокОбъектов.ТипЗначения.Типы().Количество() = 1);
	УстановитьФлагВыгрузкиДвижений();
	
КонецПроцедуры // ЗаполнитьСписокОбъектовНаСервере()

// Процедура - обработчик команды "СохранитьСписокОбъектов"
//
&НаКлиенте
Процедура СохранитьСписокОбъектов(Команда)
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	
	Диалог.Фильтр = "Файл списка объектов (*.json)|*.json";
	Диалог.Заголовок = "Файл списка объектов";
	
	ЗавершениеВыбораФайла = Новый ОписаниеОповещения("СохранитьСписокОбъектовЗавершение", ЭтотОбъект);
	
	Диалог.Показать(ЗавершениеВыбораФайла);
	
КонецПроцедуры // СохранитьСписокОбъектов()

// Процедура - завершение обработки команды "СохранитьСписокОбъектов"
//
// Параметры:
//   ВыбранныеФайлы             - Массив из Строка           - массив выбранных файлов
//   ДополнительныеПараметры    - Структура                  - параметры обработки
//
&НаКлиенте
Процедура СохранитьСписокОбъектовЗавершение(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	Если НЕ ТипЗнч(ВыбранныеФайлы) = Тип("Массив") Тогда
		Возврат;
	КонецЕсли;
	
	Если ВыбранныеФайлы.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Текст = Новый ТекстовыйДокумент();
	Текст.УстановитьТекст(ПолучитьСписокОбъектовДляСохранения());
	Текст.НачатьЗапись(, ВыбранныеФайлы[0], "UTF-8");
	
КонецПроцедуры // СохранитьСписокОбъектовЗавершение()

// Процедура - обработчик команды "ВосстановитьСписокОбъектов"
//
&НаКлиенте
Процедура ВосстановитьСписокОбъектов(Команда)
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	
	Диалог.Фильтр = "Файл списка документов (*.json)|*.json";
	Диалог.Заголовок = "Файл списка документов";
	
	ЗавершениеВыбораФайла = Новый ОписаниеОповещения("ВосстановитьСписокОбъектовПродолжение", ЭтотОбъект);
	Диалог.Показать(ЗавершениеВыбораФайла);
	
КонецПроцедуры // ВосстановитьСписокОбъектов()

// Процедура - продолжение обработки команды "ВосстановитьСписокОбъектов"
//
// Параметры:
//   ВыбранныеФайлы             - Массив из Строка           - массив выбранных файлов
//   ДополнительныеПараметры    - Структура                  - параметры обработки
//
&НаКлиенте
Процедура ВосстановитьСписокОбъектовПродолжение(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	Если НЕ ТипЗнч(ВыбранныеФайлы) = Тип("Массив") Тогда
		Возврат;
	КонецЕсли;
	
	Если ВыбранныеФайлы.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Данные = Новый ТекстовыйДокумент();
	ДопПараметры = Новый Структура("Данные", Данные);
	
	ОбработкаЧтенияФайла = Новый ОписаниеОповещения("ВосстановитьСписокОбъектовЗавершение", ЭтотОбъект, ДопПараметры);
	Данные.НачатьЧтение(ОбработкаЧтенияФайла, ВыбранныеФайлы[0], "UTF-8");
	
КонецПроцедуры // ВосстановитьСписокОбъектовПродолжение()

// Процедура - завершение обработки команды "ВосстановитьСписокОбъектов"
//
// Параметры:
//   ДополнительныеПараметры    - Структура                  - параметры обработки
//     *Данные                    - Массив из ЛюбаяСсылка      - массив ссылок на сохраняемые данные
//
&НаКлиенте
Процедура ВосстановитьСписокОбъектовЗавершение(ДополнительныеПараметры) Экспорт
	
	ДанныеJSON  = ДополнительныеПараметры.Данные.ПолучитьТекст();
	АдресДанных = ПоместитьВоВременноеХранилище(ДанныеJSON);
	
	ВосстановитьСписокОбъектовНаСервере(АдресДанных);
	
КонецПроцедуры // ВосстановитьСписокОбъектовЗавершение()

// Процедура - обработчик команды "СохранитьДанные"
//
&НаКлиенте
Процедура СохранитьДанные(Команда)
	
	Данные = Новый Массив();
	
	Для Каждого ТекЭлемент Из СписокОбъектов Цикл
		Если НЕ ТекЭлемент.Пометка Тогда
			Продолжить;
		КонецЕсли;
		Данные.Добавить(ТекЭлемент.Значение);
	КонецЦикла;
	
	ВыбратьФайлИСохранитьДанные(Данные);
	
КонецПроцедуры // СохранитьДанные()

// Процедура - обработчик команды "ВосстановитьДанные"
//
&НаКлиенте
Процедура ВосстановитьДанные(Команда)
	
	ВыбратьФайлИВосстановитьДанные();
	
КонецПроцедуры // ВосстановитьДанные()

#КонецОбласти // ОбработчикиКомандФормы

#Область ПрограммныйИнтерфейс

// Процедура - открывает диалог выбора файла и сохраняет данные в выбранный файл
//
// Параметры:
//   Данные    - Массив из ЛюбаяСсылка    - массив ссылок на сохраняемые данные
//
&НаКлиенте
Процедура ВыбратьФайлИСохранитьДанные(Данные) Экспорт
	
	ДопПараметры = Новый Структура();
	ДопПараметры.Вставить("Данные", Данные);
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	
	Диалог.Фильтр    = "Файл данных (*.json)|*.json";
	Диалог.Заголовок = "Файл данных";
	
	ЗавершениеВыбораФайла = Новый ОписаниеОповещения("ВыбратьФайлИСохранитьДанныеЗавершение",
	                                                 ЭтотОбъект,
	                                                 ДопПараметры);
	Диалог.Показать(ЗавершениеВыбораФайла);
	
КонецПроцедуры // ВыбратьФайлИСохранитьДанные()

// Процедура - обработчик выбора файла процедуры "ВыбратьФайлИСохранитьДанные"
//
// Параметры:
//   ВыбранныеФайлы             - Массив из Строка           - массив выбранных файлов
//   ДополнительныеПараметры    - Структура                  - параметры обработки
//     *Данные                    - Массив из ЛюбаяСсылка      - массив ссылок на сохраняемые данные
//
&НаКлиенте
Процедура ВыбратьФайлИСохранитьДанныеЗавершение(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	Если НЕ ТипЗнч(ВыбранныеФайлы) = Тип("Массив") ИЛИ ВыбранныеФайлы.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	Если НЕ (ТипЗнч(ДополнительныеПараметры) = Тип("Структура") И ДополнительныеПараметры.Свойство("Данные")) Тогда
		Возврат;
	КонецЕсли;
	
	ПутьКФайлу  = ВыбранныеФайлы[0];
	
	СохранитьДанныеВФайл(ДополнительныеПараметры.Данные, ПутьКФайлу);
	
КонецПроцедуры // ВыбратьФайлИСохранитьДанныеЗавершение()

// Процедура - выполняет сохранение данных в файл
//
// Параметры:
//   Данные        - Массив из ЛюбаяСсылка    - массив ссылок на сохраняемые данные
//   ПутьКФайлу    - Строка                   - путь к файлу для сохранения
//
&НаКлиенте
Процедура СохранитьДанныеВФайл(Данные, ПутьКФайлу) Экспорт
	
	АдресДанных = ПолучитьДанныеДляСохраненияНаСервере(Данные);
	Данные = ПолучитьИзВременногоХранилища(АдресДанных);
	
	Текст = Новый ТекстовыйДокумент();
	Текст.УстановитьТекст(Данные);
	Текст.НачатьЗапись( , ПутьКФайлу, "UTF-8");
	
КонецПроцедуры // СохранитьДанныеВФайл()

// Процедура - открывает диалог выбора файла и загружает данные из выбранного файла
//
&НаКлиенте
Процедура ВыбратьФайлИВосстановитьДанные() Экспорт
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	
	Диалог.Фильтр    = "Файл данных (*.json)|*.json";
	Диалог.Заголовок = "Файл данных";
	
	ЗавершениеВыбораФайла = Новый ОписаниеОповещения("ВыбратьФайлИВосстановитьДанныеЗавершение", ЭтотОбъект);
	Диалог.Показать(ЗавершениеВыбораФайла);
	
КонецПроцедуры // ВыбратьФайлИВосстановитьДанные()

// Процедура - обработчик выбора файла процедуры "ВыбратьФайлИВосстановитьДанные"
//
// Параметры:
//   ВыбранныеФайлы             - Массив из Строка    - массив выбранных файлов
//   ДополнительныеПараметры    - Структура           - параметры обработки
//
&НаКлиенте
Процедура ВыбратьФайлИВосстановитьДанныеЗавершение(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	Если НЕ ТипЗнч(ВыбранныеФайлы) = Тип("Массив") ИЛИ ВыбранныеФайлы.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ПутьКФайлу = ВыбранныеФайлы[0];
	
	ВосстановитьДанныеИзФайла(ПутьКФайлу);
	
КонецПроцедуры // ВыбратьФайлИВосстановитьДанныеЗавершение()

// Процедура - выполняет загрузку данных из файла
//
// Параметры:
//   ПутьКФайлу              - Строка           - путь к файлу для сохранения
//
&НаКлиенте
Процедура ВосстановитьДанныеИзФайла(ПутьКФайлу) Экспорт
	
	ФайлДанных = Новый Файл(ПутьКФайлу);
	Если НЕ ФайлДанных.Существует() Тогда
		Возврат;
	КонецЕсли;
	
	Данные = Новый ТекстовыйДокумент();
	
	ДополнительныеПараметры = Новый Структура();
	ДополнительныеПараметры.Вставить("Данные"    , Данные);
	ДополнительныеПараметры.Вставить("ПутьКФайлу", ПутьКФайлу);
	
	ОбработкаЧтенияФайла = Новый ОписаниеОповещения("ВосстановитьДанныеИзФайлаЗавершение",
	                                                ЭтотОбъект,
	                                                ДополнительныеПараметры);
	Данные.НачатьЧтение(ОбработкаЧтенияФайла, ПутьКФайлу, "UTF-8");
	
КонецПроцедуры // ВосстановитьДанныеИзФайла()

// Процедура - обработчик чтения файла процедуры "ВосстановитьДанныеИзФайла"
//
// Параметры:
//   ДополнительныеПараметры  - Структура               - параметры обработки
//     *Данные                  - Массив из ЛюбаяСсылка   - массив ссылок на сохраняемые данные
//     *ПутьКФайлу              - Строка                  - путь к файлу с данными
//
&НаКлиенте
Процедура ВосстановитьДанныеИзФайлаЗавершение(ДополнительныеПараметры) Экспорт
	
	ДанныеJSON  = ДополнительныеПараметры.Данные.ПолучитьТекст();
	АдресДанных = ПоместитьВоВременноеХранилище(ДанныеJSON, ЭтотОбъект.УникальныйИдентификатор);
	
	Если ПоказатьДиалогВыбора Тогда
		ПараметрыВыбора = Новый Структура();
		ПараметрыВыбора.Вставить("АдресДанных"         , АдресДанных);
		ПараметрыВыбора.Вставить("ПутьКФайлу"          , ДополнительныеПараметры.ПутьКФайлу);
		ПараметрыВыбора.Вставить("РезервноеКопирование", РезервноеКопирование);
		
		Если ЭтотОбъект.ВладелецФормы = Неопределено Тогда
			Владелец = ЭтотОбъект;
		Иначе
			Владелец = ЭтотОбъект.ВладелецФормы;
		КонецЕсли;
		
		ОповещениеВыбора = Новый ОписаниеОповещения("ФормаВыбораДанныхЗакрытие", ЭтотОбъект, ПараметрыВыбора);
		ФормаВыбораДанных = ОткрытьФорму("Обработка.бир_СохранениеВосстановлениеДанных.Форма.ФормаВыбораДанных",
		                                 ПараметрыВыбора,
		                                 Владелец,
		                                 ,
		                                 ,
		                                 ,
		                                 ОповещениеВыбора);
	Иначе
		ВосстановитьДанныеНаСервере(АдресДанных);
	КонецЕсли;
	
КонецПроцедуры // ВосстановитьДанныеИзФайлаЗавершение()

// Процедура - обработчик события закрытия формы выбора данных
//
// Параметры:
//   РезультатЗакрытия          - Структура    - данные, возвращенные при закрытии формы
//                                Строка
//     *АдресДанных               - Строка       - адрес хранилища данных
//   ДополнительныеПараметры    - Структура    - параметры обработки
//
&НаКлиенте
Процедура ФормаВыбораДанныхЗакрытие(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(РезультатЗакрытия) = Тип("Структура")
	   И РезультатЗакрытия.Свойство("АдресДанных") Тогда
		ВосстановитьДанныеНаСервере(РезультатЗакрытия.АдресДанных);
		
		Если НЕ ЭтотОбъект.ВладелецФормы = Неопределено Тогда
			ЭтотОбъект.ВладелецФормы.Прочитать();
			ЭтотОбъект.ВладелецФормы.ОбновитьОтображениеДанных();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры // ФормаВыбораДанныхЗакрытие()

#КонецОбласти // ПрограммныйИнтерфейс

#Область СлужебныеПроцедурыИФункции

#Область ПроцедурыСохраненияВосстановленияДанных

// Функция - возвращает список объектов в формате JSON
//
&НаСервере
Функция ПолучитьСписокОбъектовДляСохранения()
	
	СписокДляСохранения = ПреобразованиеДанных().ЗначениеВСтруктуру(СписокОбъектов);
	
	Возврат ПреобразованиеДанных().ЗаписатьОписаниеОбъектаВJSON(СписокДляСохранения);
	
КонецФункции // ПолучитьСписокОбъектовДляСохранения()

// Процедура - выполняет загрузку списка объектов из формата JSON
//
// Параметры:
//  АдресДанных    - Строка    - адрес хранилища данных
//
&НаСервере
Процедура ВосстановитьСписокОбъектовНаСервере(АдресДанных)
	
	ДанныеJSON = ПолучитьИзВременногоХранилища(АдресДанных);
	
	СписокДляВосстановления = ПреобразованиеДанных().ПрочитатьОписаниеОбъектаИзJSON(ДанныеJSON);
	СписокДляВосстановления = ПреобразованиеДанных().ЗначениеИзСтруктуры(СписокДляВосстановления);
	
	СписокОбъектов.Очистить();
	
	Для Каждого ТекЭлемент Из СписокДляВосстановления Цикл
		СписокОбъектов.Добавить(ТекЭлемент.Значение, ТекЭлемент.Представление, ТекЭлемент.Пометка);
	КонецЦикла;
	
	УстановитьФлагВыгрузкиДвижений();
	
КонецПроцедуры // ВосстановитьСписокОбъектовНаСервере()

// Функция - выполняет получение сохраняемых данных и возвращает адрес временного хранилища
//
// Параметры:
//   Данные    - Массив из ЛюбаяСсылка    - массив ссылок на сохраняемые данные
//
// Возвращаемое значение:
//   Строка    - адрес временного хранилища данных
//
&НаСервере
Функция ПолучитьДанныеДляСохраненияНаСервере(Данные)
	
	ИсключаемыеСвойства = Неопределено;
	Если НЕ ВыгружатьДвижения Тогда
		ИсключаемыеСвойства = "Движения";
	КонецЕсли;
	
	ЭтаОбработка().УстановитьОтборДанныхДляСохранения(Данные);
	ЭтаОбработка().УстановитьВыгружатьСвязанныеДанные(ВыгружатьСвязанныеДанные);
	ЭтаОбработка().УстановитьВыгружатьДвижения(ВыгружатьДвижения);
	
	ДанныеДляСохранения = ЭтаОбработка().ДанныеДляСохраненияJSON();
	
	Возврат ПоместитьВоВременноеХранилище(ДанныеДляСохранения, ЭтотОбъект.УникальныйИдентификатор);
	
КонецФункции // ПолучитьДанныеДляСохраненияНаСервере()

// Процедура - выполняет восстановление данных из массива или из формата JSON по указанному адресу хранилища
//
// Параметры:
//   АдресДанных    - Строка    - адрес хранилища данных
//
&НаСервере
Процедура ВосстановитьДанныеНаСервере(АдресДанных)
	
	ЭтаОбработка().УстановитьДанныеДляВосстановления(АдресДанных, Истина);
	ЭтаОбработка().УстановитьВыполнятьОбработчикиПриЗаписи(ВыполнятьОбработчикиПриЗаписи);
	ЭтаОбработка().УстановитьВосстанавливатьВТранзакции(ВосстанавливатьВТранзакции);
	
	ЭтаОбработка().ВосстановитьДанные();
	
КонецПроцедуры // ВосстановитьДанныеНаСервере()

#КонецОбласти // ПроцедурыСохраненияВосстановленияДанных

#Область РедактированиеЗапросаДанных

// Функция - Получает форму редактирования запросов
// 
// Возвращаемое значение:
//   УправляемаяФорма    - форма редактирования запроса
//
&НаКлиенте
Функция ФормаРедактированияЗапроса()
	
	Если ФормаРедактированияЗапроса = Неопределено Тогда
		//@skip-warning
		ФормаРедактированияЗапроса = ПолучитьФорму("Обработка.бир_ПроцессорЗапросов.Форма.Форма", , ЭтотОбъект);
		ФормаРедактированияЗапроса.ОписаниеОповещенияОЗакрытии =
			Новый ОписаниеОповещения("ФормаРедактированияЗапросаЗакрытие", ЭтотОбъект);
	КонецЕсли;
	
	Возврат ФормаРедактированияЗапроса;
	
КонецФункции // ФормаРедактированияЗапроса()

// Процедура - обработчик события закрытия формы редактирования запроса
//
// Параметры:
//   РезультатЗакрытия          - Строка       - данные, возвращенные при закрытии формы
//   ДополнительныеПараметры    - Структура    - параметры обработки
//
&НаКлиенте
Процедура ФормаРедактированияЗапросаЗакрытие(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если РезультатЗакрытия = "ИзмененыНастройки" Тогда
		ОбновитьСписокКолонокЗапроса();
	КонецЕсли;
	
КонецПроцедуры // ФормаРедактированияЗапросаЗакрытие()

// Процедура - Обновляет список колонок запроса для выбора
//
&НаКлиенте
Процедура ОбновитьСписокКолонокЗапроса()
	
	Элементы.КолонкаЗапроса.СписокВыбора.Очистить();
	
	КолонкиЗапроса = ФормаРедактированияЗапроса().ПолучитьКолонкиЗапроса();
	
	Для Каждого ТекКолонка Из КолонкиЗапроса Цикл
		Элементы.КолонкаЗапроса.СписокВыбора.Добавить(ТекКолонка.Имя);
	КонецЦикла;
	
КонецПроцедуры // ОбновитьСписокКолонокЗапроса()

#КонецОбласти // РедактированиеЗапросаДанных

// Процедура - проверяет наличие документов в списке объектов
// и устанавливает видимость флага выгрузки движений документов
//
&НаСервере
Процедура УстановитьФлагВыгрузкиДвижений()
	
	ЕстьДокументыВСписке = Ложь;
	Для Каждого ТекЭлемент Из СписокОбъектов Цикл
		Попытка
			МетаОбъект = ТекЭлемент.Значение.Метаданные();
		Исключение
			Продолжить;
		КонецПопытки;
		Если НЕ Метаданные.Документы.Найти(МетаОбъект.Имя) = Неопределено Тогда
			ЕстьДокументыВСписке = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Элементы.ВыгружатьДвижения.Видимость = ЕстьДокументыВСписке;
	Если НЕ ЕстьДокументыВСписке Тогда
		ВыгружатьДвижения = Ложь;
	КонецЕсли;
	
КонецПроцедуры // УстановитьФлагВыгрузкиДвижений()

// Функция - получает объект обработки преобразования данных
// 
// Возвращаемое значение:
//   ОбработкаОбъект.бир_ПреобразованиеДанных    - объект обработки преобразования данных
//
&НаСервере
Функция ПреобразованиеДанных()
	
	Если ПреобразованиеДанных = Неопределено Тогда 
		ПреобразованиеДанных = ЭтаОбработка().ПреобразованиеДанных();
	КонецЕсли;
	
	Возврат ПреобразованиеДанных;
	
КонецФункции // ПреобразованиеДанных()

// Функция - получает объект текущей обработки сохранения/восстановления данных
// 
// Возвращаемое значение:
//   ОбработкаОбъект.бир_СохранениеВосстановлениеДанных    - объект обработки сохранения/восстановления данных
//
&НаСервере
Функция ЭтаОбработка()
	
	Если ЭтаОбработка = Неопределено Тогда 
		ЭтаОбработка = РеквизитФормыВЗначение("Объект");
	КонецЕсли;
	
	Возврат ЭтаОбработка;
	
КонецФункции // ЭтаОбработка()

#КонецОбласти // СлужебныеПроцедурыИФункции
