&НаСервере
Перем ПреобразованиеДанных;

#Область ОписаниеПеременных

&НаКлиенте
Перем ФормаРедактированияЗапроса;    // УправляемаяФорма - форма редактора запроса

#КонецОбласти // ОписаниеПеременных

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Элементы.ВерсияОбработкиПреобразованияДанных.Заголовок =
		СтрШаблон("SerLib1C v. %1", ПреобразованиеДанных().Версия());

	Если Параметры.Свойство("ОграничениеТипа") Тогда
		ОграничениеТипа      = Параметры.ОграничениеТипа;
	КонецЕсли;

	ПоказатьДиалогВыбора = Истина;
	Если Параметры.Свойство("ПоказатьДиалогВыбора") Тогда
		ПоказатьДиалогВыбора = Параметры.ПоказатьДиалогВыбора;
	КонецЕсли;

	СпособОбработкиБитыхСсылок = 1;
	Если Параметры.Свойство("СпособОбработкиБитыхСсылок") Тогда
		СпособОбработкиБитыхСсылок = Параметры.СпособОбработкиБитыхСсылок;
	КонецЕсли;

	Если Параметры.Свойство("СсылкаНаОбъект") Тогда
		СсылкаНаОбъект       = Параметры.СсылкаНаОбъект;
	КонецЕсли;

КонецПроцедуры // ПриСозданииНаСервере()

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	ФормаРедактированияЗапроса();

	ОбновитьСписокКолонокЗапроса();
	
КонецПроцедуры // ПриОткрытии()

#КонецОбласти // ОбработчикиСобытийФормы

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СписокОбъектовТипЗначенияПриИзменении(Элемент)

	Элементы.СписокОбъектовПодбор.Видимость = (СписокОбъектов.ТипЗначения.Типы().Количество() = 1);
	
КонецПроцедуры // СписокОбъектовТипЗначенияПриИзменении()

&НаКлиенте
Процедура СписокОбъектовПриИзменении(Элемент)

	УстановитьФлагВыгрузкиДвижений();

КонецПроцедуры // СписокОбъектовПриИзменении()

#КонецОбласти // ОбработчикиСобытийЭлементовШапкиФормы

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура РедактироватьЗапрос(Команда)

	ФормаРедактированияЗапроса().Открыть();

КонецПроцедуры // РедактироватьЗапрос()

&НаКлиенте
Процедура ЗаполнитьСписокОбъектов(Команда)

	НастройкиПолученияДанных = ФормаРедактированияЗапроса().ПолучитьЗапросСПараметрами();

	ЗаполнитьСписокОбъектовНаСервере(НастройкиПолученияДанных);

КонецПроцедуры // ЗаполнитьСписокОбъектов()

// Процедура - заполняет список объектов по указанным настройкам процессора запрососв
//
// Параметры:
//  НастройкиПолученияДанных   - Структура             - настройки процессора запросов
//    *Запрос_Текст               - Строка               - текст запроса
//    *Запрос_Параметры           - Массив из Структура  - таблица параметров запроса
//    *ПроизвольныеВыражения      - Массив из Структура  - таблица произвольных функций
//
&НаСервере
Процедура ЗаполнитьСписокОбъектовНаСервере(Знач НастройкиПолученияДанных)

	СписокОбъектов.Очистить();

	ПроцессорЗапросов = Обработки.бир_ПроцессорЗапросов.Создать();
	ПроцессорЗапросов.УстановитьТекстЗапроса(НастройкиПолученияДанных.Запрос_Текст);
	ПроцессорЗапросов.УстановитьПараметрыЗапроса(НастройкиПолученияДанных.Запрос_Параметры);
	ПроцессорЗапросов.УстановитьПроизвольныеВыражения(НастройкиПолученияДанных.ПроизвольныеВыражения);

	Попытка
		РезультатЗапроса = ПроцессорЗапросов.ВыполнитьЗапрос(0, Ложь);
	Исключение
		ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ТекстОшибки = СтрШаблон("Ошибка выполнения запроса 1С:%1%2", Символы.ПС, ТекстОшибки);
		ВызватьИсключение ТекстОшибки;
	КонецПопытки;

	Если РезультатЗапроса.Пустой() Тогда
		ОбщегоНазначения.СообщитьПользователю("Запрос не вернул результатов!");
		Возврат;
	КонецЕсли;

	ТипыОбъектов = Новый Массив();

	Выборка = РезультатЗапроса.Выбрать();

	Пока Выборка.Следующий() Цикл
		ТипСсылки = ТипЗнч(Выборка[КолонкаЗапроса]);
		Если ТипыОбъектов.Найти(ТипСсылки) = Неопределено Тогда
			ТипыОбъектов.Добавить(ТипСсылки);
		КонецЕсли;
	КонецЦикла;

	Если ТипыОбъектов.Количество() > 0 Тогда
		СписокОбъектов.ТипЗначения = Новый ОписаниеТипов(ТипыОбъектов);
	КонецЕсли;

	Выборка.Сбросить();

	Пока Выборка.Следующий() Цикл
		ТекСсылка = СписокОбъектов.ТипЗначения.ПривестиЗначение(Выборка[КолонкаЗапроса]);
		Если НЕ ЗначениеЗаполнено(ТекСсылка) Тогда
			Продолжить;
		КонецЕсли;
		СписокОбъектов.Добавить(Выборка[КолонкаЗапроса]);
	КонецЦикла;

	Элементы.СписокОбъектовПодбор.Видимость = (СписокОбъектов.ТипЗначения.Типы().Количество() = 1);
	УстановитьФлагВыгрузкиДвижений();

КонецПроцедуры // ЗаполнитьСписокОбъектовНаСервере()

&НаКлиенте
Процедура СохранитьСписокОбъектов(Команда)

	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);

	Диалог.Фильтр = "Файл списка объектов (*.json)|*.json";
	Диалог.Заголовок = "Файл списка объектов";

	ЗавершениеВыбораФайла = Новый ОписаниеОповещения("СохранитьСписокОбъектовЗавершение", ЭтотОбъект);

	Диалог.Показать(ЗавершениеВыбораФайла);

КонецПроцедуры // СохранитьСписокОбъектов()

// Процедура - завершение обработки команды "СохранитьСписокОбъектов"
//
// Параметры:
//   ВыбранныеФайлы             - Массив из Строка           - массив выбранных файлов
//   ДополнительныеПараметры    - Структура                  - параметры обработки
//
&НаКлиенте
Процедура СохранитьСписокОбъектовЗавершение(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт

	Если НЕ ТипЗнч(ВыбранныеФайлы) = Тип("Массив") Тогда
		Возврат;
	КонецЕсли;

	Если ВыбранныеФайлы.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	Текст = Новый ТекстовыйДокумент();
	Текст.УстановитьТекст(ПолучитьСписокОбъектовДляСохранения());
	Текст.НачатьЗапись(, ВыбранныеФайлы[0], "UTF-8");

КонецПроцедуры // СохранитьСписокОбъектовЗавершение()

&НаКлиенте
Процедура ВосстановитьСписокОбъектов(Команда)

	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);

	Диалог.Фильтр = "Файл списка документов (*.json)|*.json";
	Диалог.Заголовок = "Файл списка документов";

	ЗавершениеВыбораФайла = Новый ОписаниеОповещения("ВосстановитьСписокОбъектовПродолжение", ЭтотОбъект);
	Диалог.Показать(ЗавершениеВыбораФайла);

КонецПроцедуры // ВосстановитьСписокОбъектов()

// Процедура - продолжение обработки команды "ВосстановитьСписокОбъектов"
//
// Параметры:
//   ВыбранныеФайлы             - Массив из Строка           - массив выбранных файлов
//   ДополнительныеПараметры    - Структура                  - параметры обработки
//
&НаКлиенте
Процедура ВосстановитьСписокОбъектовПродолжение(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт

	Если НЕ ТипЗнч(ВыбранныеФайлы) = Тип("Массив") Тогда
		Возврат;
	КонецЕсли;

	Если ВыбранныеФайлы.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	Данные = Новый ТекстовыйДокумент();
	ДопПараметры = Новый Структура("Данные", Данные);

	ОбработкаЧтенияФайла = Новый ОписаниеОповещения("ВосстановитьСписокОбъектовЗавершение", ЭтотОбъект, ДопПараметры);
	Данные.НачатьЧтение(ОбработкаЧтенияФайла, ВыбранныеФайлы[0], "UTF-8");

КонецПроцедуры // ВосстановитьСписокОбъектовПродолжение()

// Процедура - завершение обработки команды "ВосстановитьСписокОбъектов"
//
// Параметры:
//   ДополнительныеПараметры    - Структура                  - параметры обработки
//     *Данные                    - Массив из ЛюбаяСсылка      - массив ссылок на сохраняемые данные
//
&НаКлиенте
Процедура ВосстановитьСписокОбъектовЗавершение(ДополнительныеПараметры) Экспорт

	ДанныеJSON  = ДополнительныеПараметры.Данные.ПолучитьТекст();
	АдресДанных = ПоместитьВоВременноеХранилище(ДанныеJSON);

	ВосстановитьСписокОбъектовНаСервере(АдресДанных);

КонецПроцедуры // ВосстановитьСписокОбъектовЗавершение()

&НаКлиенте
Процедура СохранитьДанные(Команда)

	Данные = Новый Массив();

	Для Каждого ТекЭлемент Из СписокОбъектов Цикл
		Если НЕ ТекЭлемент.Пометка Тогда
			Продолжить;
		КонецЕсли;
		Данные.Добавить(ТекЭлемент.Значение);
	КонецЦикла;

	ВыбратьФайлИСохранитьДанные(Данные);

КонецПроцедуры // СохранитьДанные()

&НаКлиенте
Процедура ВосстановитьДанные(Команда)

	ВыбратьФайлИВосстановитьДанные();

КонецПроцедуры // ВосстановитьДанные()

#КонецОбласти // ОбработчикиКомандФормы

#Область ПрограммныйИнтерфейс

// Процедура - открывает диалог выбора файла и сохраняет данные в выбранный файл
//
// Параметры:
//   Данные    - Массив из ЛюбаяСсылка    - массив ссылок на сохраняемые данные
//
&НаКлиенте
Процедура ВыбратьФайлИСохранитьДанные(Данные) Экспорт

	ДопПараметры = Новый Структура();
	ДопПараметры.Вставить("Данные"        , Данные);

	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);

	Диалог.Фильтр    = "Файл данных (*.json)|*.json";
	Диалог.Заголовок = "Файл данных";

	ЗавершениеВыбораФайла = Новый ОписаниеОповещения("ВыбратьФайлИСохранитьДанныеЗавершение",
	                                                 ЭтотОбъект,
	                                                 ДопПараметры);
	Диалог.Показать(ЗавершениеВыбораФайла);

КонецПроцедуры // ВыбратьФайлИСохранитьДанные()

// Процедура - обработчик выбора файла процедуры "ВыбратьФайлИСохранитьДанные"
//
// Параметры:
//   ВыбранныеФайлы             - Массив из Строка           - массив выбранных файлов
//   ДополнительныеПараметры    - Структура                  - параметры обработки
//     *Данные                    - Массив из ЛюбаяСсылка      - массив ссылок на сохраняемые данные
//
&НаКлиенте
Процедура ВыбратьФайлИСохранитьДанныеЗавершение(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт

	Если НЕ ТипЗнч(ВыбранныеФайлы) = Тип("Массив") ИЛИ ВыбранныеФайлы.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	Если НЕ (ТипЗнч(ДополнительныеПараметры) = Тип("Структура") И ДополнительныеПараметры.Свойство("Данные")) Тогда
		Возврат;
	КонецЕсли;

	ПутьКФайлу  = ВыбранныеФайлы[0];

	СохранитьДанныеВФайл(ДополнительныеПараметры.Данные, ПутьКФайлу);

КонецПроцедуры // ВыбратьФайлИСохранитьДанныеЗавершение()

// Процедура - выполняет сохранение данных в файл
//
// Параметры:
//   Данные        - Массив из ЛюбаяСсылка    - массив ссылок на сохраняемые данные
//   ПутьКФайлу    - Строка                   - путь к файлу для сохранения
//
&НаКлиенте
Процедура СохранитьДанныеВФайл(Данные, ПутьКФайлу) Экспорт

	АдресДанных = ПолучитьДанныеДляСохраненияНаСервере(Данные);
	Данные = ПолучитьИзВременногоХранилища(АдресДанных);

	Текст = Новый ТекстовыйДокумент();
	Текст.УстановитьТекст(Данные);
	Текст.НачатьЗапись( , ПутьКФайлу, "UTF-8");

КонецПроцедуры // СохранитьДанныеВФайл()

// Процедура - открывает диалог выбора файла и загружает данные из выбранного файла
//
&НаКлиенте
Процедура ВыбратьФайлИВосстановитьДанные() Экспорт

	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);

	Диалог.Фильтр    = "Файл данных (*.json)|*.json";
	Диалог.Заголовок = "Файл данных";

	ЗавершениеВыбораФайла = Новый ОписаниеОповещения("ВыбратьФайлИВосстановитьДанныеЗавершение", ЭтотОбъект);
	Диалог.Показать(ЗавершениеВыбораФайла);

КонецПроцедуры // ВыбратьФайлИВосстановитьДанные()

// Процедура - обработчик выбора файла процедуры "ВыбратьФайлИВосстановитьДанные"
//
// Параметры:
//   ВыбранныеФайлы             - Массив из Строка    - массив выбранных файлов
//   ДополнительныеПараметры    - Структура           - параметры обработки
//
&НаКлиенте
Процедура ВыбратьФайлИВосстановитьДанныеЗавершение(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт

	Если НЕ ТипЗнч(ВыбранныеФайлы) = Тип("Массив") ИЛИ ВыбранныеФайлы.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	ПутьКФайлу = ВыбранныеФайлы[0];

	ВосстановитьДанныеИзФайла(ПутьКФайлу);

КонецПроцедуры // ВыбратьФайлИВосстановитьДанныеЗавершение()

// Процедура - выполняет загрузку данных из файла
//
// Параметры:
//   ПутьКФайлу              - Строка           - путь к файлу для сохранения
//
&НаКлиенте
Процедура ВосстановитьДанныеИзФайла(ПутьКФайлу) Экспорт

	ФайлДанных = Новый Файл(ПутьКФайлу);
	Если НЕ ФайлДанных.Существует() Тогда
		Возврат;
	КонецЕсли;

	Данные = Новый ТекстовыйДокумент();

	ДопПараметры = Новый Структура();
	ДопПараметры.Вставить("Данные"              , Данные);
	ДопПараметры.Вставить("ПутьКФайлу"          , ПутьКФайлу);

	ОбработкаЧтенияФайла = Новый ОписаниеОповещения("ВосстановитьДанныеИзФайлаЗавершение", ЭтотОбъект, ДопПараметры);
	Данные.НачатьЧтение(ОбработкаЧтенияФайла, ПутьКФайлу, "UTF-8");

КонецПроцедуры // ВосстановитьДанныеИзФайла()

// Процедура - обработчик чтения файла процедуры "ВосстановитьДанныеИзФайла"
//
// Параметры:
//   ДополнительныеПараметры  - Структура               - параметры обработки
//     *Данные                  - Массив из ЛюбаяСсылка   - массив ссылок на сохраняемые данные
//     *ПутьКФайлу              - Строка                  - путь к файлу с данными
//
&НаКлиенте
Процедура ВосстановитьДанныеИзФайлаЗавершение(ДополнительныеПараметры) Экспорт

	ДанныеJSON  = ДополнительныеПараметры.Данные.ПолучитьТекст();
	АдресДанных = ПоместитьВоВременноеХранилище(ДанныеJSON, ЭтотОбъект.УникальныйИдентификатор);

	Если ПоказатьДиалогВыбора Тогда
		ПараметрыВыбора = Новый Структура();
		ПараметрыВыбора.Вставить("АдресДанных"               , АдресДанных);
		ПараметрыВыбора.Вставить("ПутьКФайлу"                , ДополнительныеПараметры.ПутьКФайлу);
		ПараметрыВыбора.Вставить("ОграничениеТипа"           , ОграничениеТипа);
		ПараметрыВыбора.Вставить("СсылкаНаОбъект"            , СсылкаНаОбъект);
		ПараметрыВыбора.Вставить("СпособОбработкиБитыхСсылок", СпособОбработкиБитыхСсылок);

		Если ЭтотОбъект.ВладелецФормы = Неопределено Тогда
			Владелец = ЭтотОбъект;
		Иначе
			Владелец = ЭтотОбъект.ВладелецФормы;
		КонецЕсли;

		ОповещениеВыбора = Новый ОписаниеОповещения("ФормаВыбораДанныхЗакрытие", ЭтотОбъект, ПараметрыВыбора);
		ФормаВыбораДанных = ОткрытьФорму("Обработка.бир_СохранениеВосстановлениеДанных.Форма.ФормаВыбораДанных",
		                                 ПараметрыВыбора,
		                                 Владелец,
		                                 ,
		                                 ,
		                                 ,
		                                 ОповещениеВыбора);
	Иначе
		ВосстановитьДанныеНаСервере(АдресДанных);
	КонецЕсли;

КонецПроцедуры // ВосстановитьДанныеИзФайлаЗавершение()

// Процедура - обработчик события закрытия формы выбора данных
//
// Параметры:
//   РезультатЗакрытия          - Структура    - данные, возвращенные при закрытии формы
//                                Строка
//     *АдресДанных               - Строка       - адрес хранилища данных
//   ДополнительныеПараметры    - Структура    - параметры обработки
//
&НаКлиенте
Процедура ФормаВыбораДанныхЗакрытие(РезультатЗакрытия, ДополнительныеПараметры) Экспорт

	Если ТипЗнч(РезультатЗакрытия) = Тип("Структура")
	   И РезультатЗакрытия.Свойство("АдресДанных") Тогда
		ВосстановитьДанныеНаСервере(РезультатЗакрытия.АдресДанных);

		Если ЗначениеЗаполнено(СсылкаНаОбъект) И НЕ ЭтотОбъект.ВладелецФормы = Неопределено Тогда
			ЭтотОбъект.ВладелецФормы.Прочитать();
			ЭтотОбъект.ВладелецФормы.ОбновитьОтображениеДанных();
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры // ФормаВыбораДанныхЗакрытие()

#КонецОбласти // ПрограммныйИнтерфейс

#Область СлужебныеПроцедурыИФункции

#Область ПроцедурыСохраненияВосстановленияДанных

// Функция - возвращает список объектов в формате JSON
//
&НаСервере
Функция ПолучитьСписокОбъектовДляСохранения()

	СписокДляСохранения = ПреобразованиеДанных().ЗначениеВСтруктуру(СписокОбъектов);

	Возврат ПреобразованиеДанных.ЗаписатьОписаниеОбъектаВJSON(СписокДляСохранения);

КонецФункции // ПолучитьСписокОбъектовДляСохранения()

// Процедура - выполняет загрузку списка объектов из формата JSON
//
// Параметры:
//  АдресДанных    - Строка    - адрес хранилища данных
//
&НаСервере
Процедура ВосстановитьСписокОбъектовНаСервере(АдресДанных)

	ДанныеJSON = ПолучитьИзВременногоХранилища(АдресДанных);

	СписокДляВосстановления = ПреобразованиеДанных().ПрочитатьОписаниеОбъектаИзJSON(ДанныеJSON);
	СписокДляВосстановления = ПреобразованиеДанных().ЗначениеИзСтруктуры(СписокДляВосстановления);
	
	СписокОбъектов.Очистить();

	Для Каждого ТекЭлемент Из СписокДляВосстановления Цикл
		СписокОбъектов.Добавить(ТекЭлемент.Значение, ТекЭлемент.Представление, ТекЭлемент.Пометка);
	КонецЦикла;

	УстановитьФлагВыгрузкиДвижений();

КонецПроцедуры // ВосстановитьСписокОбъектовНаСервере()

// Функция - выполняет получение сохраняемых данных и возвращает адрес временного хранилища
//
// Параметры:
//   Данные    - Массив из ЛюбаяСсылка    - массив ссылок на сохраняемые данные
//
// Возвращаемое значение:
//   Строка    - адрес временного хранилища данных
//
&НаСервере
Функция ПолучитьДанныеДляСохраненияНаСервере(Данные)

	ИсключаемыеСвойства = Неопределено;
	Если НЕ ВыгружатьДвижения Тогда
		ИсключаемыеСвойства = "Движения";
	КонецЕсли;

	ДанныеДляСохранения = Новый Массив();

	Для Каждого ТекСсылка Из Данные Цикл

		Если ТипЗнч(ТекСсылка) = Тип("Структура") Тогда
			СтруктураОбъекта = ТекСсылка;
		Иначе
			ТекОбъект = Неопределено;
			Попытка
				ТекОбъект = ТекСсылка.ПолучитьОбъект();
			Исключение
				ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
				ТекстОшибки = СтрШаблон("Ошибка сохранения объекта ""%1"":%2%3",
				                        ТекСсылка,
				                        Символы.ПС,
				                        ТекстОшибки);
				ЗаписьЖурналаРегистрации("Преобразование данных.Получение объекта",
				                         УровеньЖурналаРегистрации.Ошибка,
				                         Метаданные.Обработки.бир_СохранениеВосстановлениеДанных,
				                         ТекСсылка,
				                         ТекстОшибки);
			КонецПопытки;

			Если ТекОбъект = Неопределено Тогда
				Продолжить;
			КонецЕсли;

			СтруктураОбъекта = ПреобразованиеДанных().ЗначениеВСтруктуру(ТекОбъект);
		КонецЕсли;

		ДанныеДляСохранения.Добавить(СтруктураОбъекта);
	КонецЦикла;

	ДанныеДляСохранения = ПреобразованиеДанных().ЗаписатьОписаниеОбъектаВJSON(ДанныеДляСохранения);

	Возврат ПоместитьВоВременноеХранилище(ДанныеДляСохранения, ЭтотОбъект.УникальныйИдентификатор);

КонецФункции // ПолучитьДанныеДляСохраненияНаСервере()

// Процедура - выполняет восстановление данных из массива или из формата JSON по указанному адресу хранилища
//
// Параметры:
//   АдресДанных    - Строка    - адрес хранилища данных
//
&НаСервере
Процедура ВосстановитьДанныеНаСервере(АдресДанных)

	ОбъектыДляЗагрузки = ПрочитатьДанныеНаСервере(АдресДанных);

	Для Каждого ТекСтруктураОбъекта Из ОбъектыДляЗагрузки Цикл

		Если ЗначениеЗаполнено(СсылкаНаОбъект) Тогда
			ДанныеОбъект = СсылкаНаОбъект.ПолучитьОбъект();
		Иначе
			ДанныеОбъект = Неопределено;
		КонецЕсли;

		Если ТекСтруктураОбъекта.__Тип = "УдалениеОбъекта" Тогда
			Если ЗначениеЗаполнено(СсылкаНаОбъект) Тогда
				Продолжить;
			Иначе
				Действие = "удалить";
				Удаление = ПреобразованиеДанных().УдалениеОбъектаИзСтруктуры(ТекСтруктураОбъекта);
				Попытка
					ДанныеОбъект = Удаление.Ссылка.ПолучитьОбъект();
				Исключение
					ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
					ТекстОшибки = СтрШаблон("Ошибка получения объекта для удаления:%1%2", Символы.ПС, ТекстОшибки);
					ЗаписьЖурналаРегистрации("Преобразование данных.Получение объекта",
					                         УровеньЖурналаРегистрации.Ошибка,
					                         Метаданные.Обработки.бир_СохранениеВосстановлениеДанных,
					                         Удаление.Ссылка,
					                         ТекстОшибки);
					Продолжить;
				КонецПопытки;
				ДанныеОбъект = Удаление;
			КонецЕсли;
		ИначеЕсли ЗначениеЗаполнено(СсылкаНаОбъект) Тогда
			Действие = "записать";
			ПреобразованиеДанных().ЗаполнитьОбъектИзСтруктуры(ДанныеОбъект, ТекСтруктураОбъекта);
		Иначе
			Действие = "записать";
			ДанныеОбъект = ПреобразованиеДанных().НайтиЗаполнитьОбъектИзСтруктуры(ТекСтруктураОбъекта, Истина);
		КонецЕсли;

		Если ДанныеОбъект = Неопределено Тогда
			Продолжить;
		КонецЕсли;

		ДанныеОбъект.ОбменДанными.Загрузка = Истина;
		
		Попытка
			ДанныеОбъект.Записать();
		Исключение
			ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ТекстОшибки = СтрШаблон("Не удалось %1 объект ""%2"":%3%4",
			                        Действие,
			                        СокрЛП(ДанныеОбъект.Ссылка),
			                        Символы.ПС, ТекстОшибки);
			ЗаписьЖурналаРегистрации("Преобразование данных.Восстановление объекта",
			                         УровеньЖурналаРегистрации.Ошибка,
			                         Метаданные.Обработки.бир_СохранениеВосстановлениеДанных,
			                         ДанныеОбъект.Ссылка,
			                         ТекстОшибки);
			ОбщегоНазначения.СообщитьПользователю(ТекстОшибки);
		КонецПопытки;

	КонецЦикла;

КонецПроцедуры // ВосстановитьДанныеНаСервере()

// Функция - читает данные из массива или формата JSON по указанному адресу хранилища
//
// Параметры:
//   АдресДанных    - Строка    - адрес хранилища данных
//
&НаСервере
Функция ПрочитатьДанныеНаСервере(АдресДанных)

	Данные = ПолучитьИзВременногоХранилища(АдресДанных);

	Если ТипЗнч(Данные) = Тип("Строка") Тогда
		Данные = ПреобразованиеДанных().ПрочитатьОписаниеОбъектаИзJSON(Данные);
	КонецЕсли;

	Возврат Данные;

КонецФункции // ПрочитатьДанныеНаСервере()

#КонецОбласти // ПроцедурыСохраненияВосстановленияДанных

// Функция - Получает форму редактирования запросов
// 
// Возвращаемое значение:
//	 УправляемаяФорма    - форма редактирования запроса
//
&НаКлиенте
Функция ФормаРедактированияЗапроса()

	Если ФормаРедактированияЗапроса = Неопределено Тогда
		//@skip-warning
		ФормаРедактированияЗапроса = ПолучитьФорму("Обработка.бир_ПроцессорЗапросов.Форма.Форма", , ЭтотОбъект);
		ФормаРедактированияЗапроса.ОписаниеОповещенияОЗакрытии =
			Новый ОписаниеОповещения("ФормаРедактированияЗапросаЗакрытие", ЭтотОбъект);
	КонецЕсли;

	Возврат ФормаРедактированияЗапроса;

КонецФункции // ФормаРедактированияЗапроса()

// Процедура - обработчик события закрытия формы редактирования запроса
//
// Параметры:
//   РезультатЗакрытия          - Строка       - данные, возвращенные при закрытии формы
//   ДополнительныеПараметры    - Структура    - параметры обработки
//
&НаКлиенте
Процедура ФормаРедактированияЗапросаЗакрытие(РезультатЗакрытия, ДополнительныеПараметры) Экспорт

	Если РезультатЗакрытия = "ИзмененыНастройки" Тогда
		ОбновитьСписокКолонокЗапроса();
	КонецЕсли;

КонецПроцедуры // ФормаРедактированияЗапросаЗакрытие()

// Процедура - Обновляет список колонок запроса для выбора
//
&НаКлиенте
Процедура ОбновитьСписокКолонокЗапроса()

	Элементы.КолонкаЗапроса.СписокВыбора.Очистить();

	КолонкиЗапроса = ФормаРедактированияЗапроса().ПолучитьКолонкиЗапроса();

	Для Каждого ТекКолонка Из КолонкиЗапроса Цикл
		Элементы.КолонкаЗапроса.СписокВыбора.Добавить(ТекКолонка.Имя);
	КонецЦикла;

КонецПроцедуры // ОбновитьСписокКолонокЗапроса()

&НаСервере
Процедура УстановитьФлагВыгрузкиДвижений()

	ЕстьДокументыВСписке = Ложь;
	Для Каждого ТекЭлемент Из СписокОбъектов Цикл
		МетаОбъект = ТекЭлемент.Значение.Метаданные();
		Если НЕ Метаданные.Документы.Найти(МетаОбъект.Имя) = Неопределено Тогда
			ЕстьДокументыВСписке = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;

	Элементы.ВыгружатьДвижения.Видимость = ЕстьДокументыВСписке;
	Если НЕ ЕстьДокументыВСписке Тогда
		ВыгружатьДвижения = Ложь;
	КонецЕсли;

КонецПроцедуры // УстановитьФлагВыгрузкиДвижений()

&НаСервере
Функция ПреобразованиеДанных()
	
	Если ПреобразованиеДанных = Неопределено Тогда 
		ПреобразованиеДанных = Обработки.бир_ПреобразованиеДанных.Создать();
	КонецЕсли;
	
	ПреобразованиеДанных.УстановитьСпособОбработкиБитыхСсылок(СпособОбработкиБитыхСсылок);
	
	Возврат ПреобразованиеДанных;
	
КонецФункции // ПреобразованиеДанных()

#КонецОбласти // СлужебныеПроцедурыИФункции
