#Область ПрограммныйИнтерфейс

// Функция - выполняет обработку события
//
// Параметры:
//  ОписаниеСобытия     - Структура                 - описание события (см. бир_События.СтруктураОписанияСобытия())
//  Обработчик          - СправочникСсылка			- обработчик события
//                        .бир_СобытияОбработчики
//  ПараметрыСобытия    - Структура                 - параметры, сформированные при возникновении события
// 
// Возвращаемое значение:
//  Булево    - Истина - Обработка выполнена успешно, Ложь - в противном случае
//
Функция ОбработатьСобытие(ОписаниеСобытия, Обработчик, ПараметрыСобытия) Экспорт
	
	Результат = Ложь;
	
	ИсполняемыйКод = ОбработкаНаКлиенте_Код;
	
	Если ИсполняемыйКод = "" Тогда
		Возврат Результат;
	КонецЕсли;
	
	Попытка
		Выполнить(ИсполняемыйКод);
	Исключение
		ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ТекстОшибки = СтрШаблон("Ошибка выполнения обработчика ""%1"" события ""%2"":%3%4%3код обработчика:%3%5",
		                        СокрЛП(Обработчик),
		                        СокрЛП(ОписаниеСобытия.Событие),
		                        Символы.ПС,
		                        ТекстОшибки,
		                        ИсполняемыйКод);
		ПараметрыСобытия.Вставить("РезультатОбработки", ТекстОшибки);
		ПараметрыСобытия.Вставить("ОшибкаОбработки", Истина);
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции // ОбработатьСобытие()

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбработкаНаСервере_Код	= "";
	ОбработкаНаКлиенте_Код	= "";
	ОбработкаПолучениеПользователей_Код	= "";
	
	Если Параметры.Свойство("ОбработкаНастройкиАдресВХранилище") Тогда
		ОбработкаНастройкиАдресВХранилище = Параметры.ОбработкаНастройкиАдресВХранилище;
	
		Настройки = ПолучитьИзВременногоХранилища(ОбработкаНастройкиАдресВХранилище);
	
		Если ТипЗнч(Настройки) = Тип("Структура") Тогда
			Настройки.Свойство("ОбработкаНаСервере_Код"				, ОбработкаНаСервере_Код);
			Настройки.Свойство("ОбработкаНаКлиенте_Код"				, ОбработкаНаКлиенте_Код);
			Настройки.Свойство("ОбработкаПолучениеПользователей_Код", ОбработкаПолучениеПользователей_Код);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры // ПриСозданииНаСервере()

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СохранитьНастройку(Команда)
	
	СохранитьНастройкуНаСервере();
	
	Оповестить("ИзмененыНастройки", ЭтаФорма.ВладелецФормы, ЭтаФорма);
	
	Закрыть("ИзмененыНастройки");
	
КонецПроцедуры // СохранитьНастройку()

&НаСервере
Процедура СохранитьНастройкуНаСервере()
	
	Настройка = Новый Структура();
	Настройка.Вставить("ОбработкаНаСервере_Код"				, ОбработкаНаСервере_Код);
	Настройка.Вставить("ОбработкаНаКлиенте_Код"				, ОбработкаНаКлиенте_Код);
	Настройка.Вставить("ОбработкаПолучениеПользователей_Код", ОбработкаПолучениеПользователей_Код);
	
	ПоместитьВоВременноеХранилище(Настройка, ОбработкаНастройкиАдресВХранилище);
	
КонецПроцедуры // СохранитьНастройкуНаСервере()

#КонецОбласти
