
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПараметрыФормы = Новый Структура("Отбор",
	                                 Новый Структура("Событие", ПараметрКоманды));
	
	ОткрытьФорму("РегистрСведений.бир_События.ФормаСписка",
	             ПараметрыФормы,
	             ПараметрыВыполненияКоманды.Источник,
	             ПараметрыВыполненияКоманды.Уникальность,
	             ПараметрыВыполненияКоманды.Окно,
	             ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	
КонецПроцедуры // ОбработкаКоманды()
