
Функция Получить(ИмяЗначения) Экспорт
	
	Результат = Неопределено;
	
	Попытка
		ЭлементЗначения = ПланыВидовХарактеристик.бир_НастраиваемыеЗначения[ИмяЗначения];
	Исключение
		ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ТекстОшибки = СтрШаблон("Ошибка получения значения:%1%2",
		                        Символы.ПС,
		                        ТекстОшибки);
	КонецПопытки;
	
	Если ЭлементЗначения.Список.Количество() > 0 Тогда
		Результат = ЭлементЗначения.Список.ВыгрузитьКолонку("Значение");
	Иначе
		Результат = ЭлементЗначения.Значение;
	КонецЕсли;
		
	Возврат Результат;
	
КонецФункции //Получить()