
Функция Получить(ИмяЗначения) Экспорт
	
	Результат = Неопределено;
	
	Попытка
		ЭлементЗначения = ПланыВидовХарактеристик.бир_НастраиваемыеЗначения[ИмяЗначения];
	Исключение
		ТекстОшибки = "Ошибка получения значения: " + Символы.ПС + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
	КонецПопытки;
	
	Если ЭлементЗначения.Список.Количество() > 0 Тогда
		Результат = ЭлементЗначения.Список.ВыгрузитьКолонку("Значение");
	Иначе
		Результат = ЭлементЗначения.Значение;
	КонецЕсли;
		
	Возврат Результат;
	
КонецФункции //Получить()