
#Область ОписаниеПеременных

&НаСервере
Перем ПреобразованиеДанных;    // ОбработкаОбъект   - обработка преобразования данных

#КонецОбласти // ОписаниеПеременных

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ)

	КомандыДляОбработки = КомандыДляОбработки();

	Для Каждого ТекКоманда Из КомандыДляОбработки Цикл
		Элементы.КомандаДляОбработки.СписокВыбора.Добавить(ТекКоманда.Значение);
	КонецЦикла;

КонецПроцедуры // ПриСозданииНаСервере()

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	Если НЕ ЗначениеЗаполнено(КомандаДляОбработки) Тогда
		КомандаДляОбработки	= КомандыДляОбработки().ВыполнитьЗапрос;
	КонецЕсли;

	КомандаДляОбработкиПриИзменении(Элементы.КомандаДляОбработки);

	Элементы.ГруппаОсновная.ТекущаяСтраница = Элементы.ГруппаПараметрыКоманды;

КонецПроцедуры // ПриОткрытии()

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура КомандаДляОбработкиПриИзменении(Элемент)

	КомандыДляОбработки	= КомандыДляОбработки();

	Элементы.ПараметрыСписокЗапросов.Видимость	= (КомандаДляОбработки = КомандыДляОбработки.СписокЗапросов);
	Элементы.ПараметрыОписаниеЗапроса.Видимость	= (КомандаДляОбработки = КомандыДляОбработки.ОписаниеЗапроса);
	Элементы.ПараметрыВыполнитьЗапрос.Видимость	= (КомандаДляОбработки = КомандыДляОбработки.ВыполнитьЗапрос);

КонецПроцедуры // КомандаДляОбработкиПриИзменении()

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыполнитьКоманду(Команда)

	ВыполнитьКомандуНаСервере();

	Элементы.ГруппаОсновная.ТекущаяСтраница = Элементы.ГруппаРезультат;

КонецПроцедуры // ВыполнитьКоманду()

&НаСервере
Процедура ВыполнитьКомандуНаСервере()

	ТаблицаРезультат.Очистить();

	КомандыДляОбработки	= КомандыДляОбработки();

	Результат = Новый Массив();

	Если КомандаДляОбработки = КомандыДляОбработки.ВыполнитьЗапрос Тогда
		Результат = ВыполнитьЗапросНаСервере();
	ИначеЕсли КомандаДляОбработки = КомандыДляОбработки.СписокЗапросов Тогда
		Результат = СписокЗапросовНаСервере();
	ИначеЕсли КомандаДляОбработки = КомандыДляОбработки.ОписаниеЗапроса Тогда
		Результат = ОписаниеЗапросаНаСервере();
	Иначе
		Возврат;
	КонецЕсли;

	Если Результат.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	Для й = 1 По Результат.Колонки.Количество() Цикл
		ТаблицаРезультат.Область(1, й).Текст    = Результат.Колонки[й - 1].Имя;
		ТаблицаРезультат.Область(1, й).Шрифт    = Новый Шрифт(ТаблицаРезультат.Область(1, й).Шрифт, , , Истина);
		ТаблицаРезультат.Область(1, й).ЦветФона = Новый Цвет(128, 128, 128);
		ТаблицаРезультат.Область(1, й).РастягиватьПоГоризонтали = Истина;
	КонецЦикла;

	к = 2;
	Для Каждого ТекСтрока Из Результат Цикл
		Для й = 1 По Результат.Колонки.Количество() Цикл
			ТаблицаРезультат.Область(к, й).Текст                    = ТекСтрока[й - 1];
			ТаблицаРезультат.Область(к, й).ВертикальноеПоложение    = ВертикальноеПоложение.Верх;
			ТаблицаРезультат.Область(к, й).РастягиватьПоГоризонтали = Истина;
		КонецЦикла;
		к = к + 1;
	КонецЦикла;

КонецПроцедуры // ВыполнитьКомандуНаСервере()

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция СписокЗапросовНаСервере()

	НастройкиПодключения = бир_ВнешниеИБПолучениеДанных.НастройкиПодключения(НастройкиОбработки(), , Таймаут);

	Результат = бир_ВнешниеИБПолучениеДанных.Запросы(НастройкиПодключения, Поля);

	Если Результат.Количество() = 0 Тогда
		Возврат Результат;
	КонецЕсли;

	Таблица = Новый ТаблицаЗначений();

	Для Каждого ТекЭлемент Из Результат[0] Цикл
		Таблица.Колонки.Добавить(ТекЭлемент.Ключ);
	КонецЦикла;
	Для Каждого ТекЗапрос Из Результат Цикл
		НоваяСтрока = Таблица.Добавить();
		Для Каждого ТекКолонка Из Таблица.Колонки Цикл
			НоваяСтрока[ТекКолонка.Имя] = ТекЗапрос[ТекКолонка.Имя];
			Если НЕ ТипЗнч(НоваяСтрока[ТекКолонка.Имя]) = Тип("Массив") Тогда
				Продолжить;
			КонецЕсли;
			Если ТекКолонка.Имя = "Поля" ИЛИ ТекКолонка.Имя = "Параметры" Тогда
				Значение = Новый Массив();
				Для Каждого ТекЭлемент Из ТекЗапрос[ТекКолонка.Имя] Цикл
					Значение.Добавить(СтрШаблон("%1 (%2)", ТекЭлемент.Имя, ТекЭлемент.ТипЗначения));
				КонецЦикла;
				НоваяСтрока[ТекКолонка.Имя] = СтрСоединить(Значение, Символы.ПС);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;

	Возврат Таблица;

КонецФункции // СписокЗапросовНаСервере()

&НаСервере
Функция ОписаниеЗапросаНаСервере()

	НастройкиПодключения = бир_ВнешниеИБПолучениеДанных.НастройкиПодключения(НастройкиОбработки(), , Таймаут);

	Результат = бир_ВнешниеИБПолучениеДанных.ОписаниеЗапроса(НастройкиПодключения, ИдЗапроса, Поля);

	Таблица = Новый ТаблицаЗначений();
	Таблица.Колонки.Добавить("Реквизит");
	Таблица.Колонки.Добавить("Значение");

	Для Каждого ТекРеквизит Из Результат Цикл
		НоваяСтрока = Таблица.Добавить();
		НоваяСтрока.Реквизит = ТекРеквизит.Ключ;
		НоваяСтрока.Значение = ТекРеквизит.Значение;
		Если НЕ ТипЗнч(ТекРеквизит.Значение) = Тип("Массив") Тогда
			Продолжить;
		КонецЕсли;
		Если ТекРеквизит.Ключ = "Поля" ИЛИ ТекРеквизит.Ключ = "Параметры" Тогда
			Значение = Новый Массив();
			Для Каждого ТекЭлемент Из ТекРеквизит.Значение Цикл
				Значение.Добавить(СтрШаблон("%1 (%2)", ТекЭлемент.Имя, ТекЭлемент.ТипЗначения));
			КонецЦикла;
			НоваяСтрока.Значение = СтрСоединить(Значение, Символы.ПС);
		КонецЕсли;
	КонецЦикла;

	Возврат Таблица;

КонецФункции // ОписаниеЗапросаНаСервере()

&НаСервере
Функция ВыполнитьЗапросНаСервере()

	ВремПараметры = Новый Массив();

	Для Каждого ТекПараметр Из ПараметрыЗапроса Цикл
		бир_ВнешниеИБПолучениеДанных.ДобавитьПараметрЗапроса(ВремПараметры,
		                                                     ТекПараметр.Имя,
															 ТекПараметр.Значение,
															 ТекПараметр.ТипЗначения,
															 ТекПараметр.Предопределенное);
	КонецЦикла;

	НастройкиПодключения = бир_ВнешниеИБПолучениеДанных.НастройкиПодключения(НастройкиОбработки(), , Таймаут);

	ДополнительныеПараметры = Новый Структура();
	ДополнительныеПараметры.Вставить("Первые", Первые);

	РезультатЗапроса = бир_ВнешниеИБПолучениеДанных.РезультатЗапроса(НастройкиПодключения,
	                                                                 ИдЗапроса,
	                                                                 ВремПараметры,
	                                                                 ДополнительныеПараметры);
	Возврат ПреобразованиеДанных().ЗначениеИзСтруктуры(РезультатЗапроса);

КонецФункции // ВыполнитьЗапросНаСервере()

&НаСервере
Функция НастройкиОбработки()

	НастройкиОбработки = Новый Структура();
	НастройкиОбработки.Вставить("Сервер"      , Сервер);
	НастройкиОбработки.Вставить("АдресРесурса", АдресРесурса);
	НастройкиОбработки.Вставить("Пользователь", Пользователь);
	НастройкиОбработки.Вставить("Пароль"      , Пароль);
	НастройкиОбработки.Вставить("Таймаут"     , Таймаут);

	Возврат Новый ФиксированнаяСтруктура(НастройкиОбработки);

КонецФункции // НастройкиОбработки()

&НаСервереБезКонтекста
Функция КомандыДляОбработки()

	КомандыДляОбработки = Новый Структура();
	КомандыДляОбработки.Вставить("СписокЗапросов" , "Получить список запросов");
	КомандыДляОбработки.Вставить("ОписаниеЗапроса", "Получить описание запроса");
	КомандыДляОбработки.Вставить("ВыполнитьЗапрос", "Выполнить запрос");

	Возврат Новый ФиксированнаяСтруктура(КомандыДляОбработки);

КонецФункции // КомандыДляОбработки()

// Функция - Получает обработку сериализации значений
//
// Возвращаемое значение:
//   ВнешняяОбработкаОбъект    - обработка преобразования данных
//
&НаСервере
Функция ПреобразованиеДанных() Экспорт

	Если ПреобразованиеДанных = Неопределено Тогда
		ПреобразованиеДанных = Обработки.бир_ПреобразованиеДанных.Создать();
	КонецЕсли;

	Возврат ПреобразованиеДанных; 

КонецФункции // ПреобразованиеДанных()

#КонецОбласти
