
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ)

	КомандыДляОбработки = КомандыДляОбработки();

	Для Каждого ТекКоманда Из КомандыДляОбработки Цикл
		Элементы.КомандаДляОбработки.СписокВыбора.Добавить(ТекКоманда.Значение);
	КонецЦикла;
	
	Если НЕ Метаданные.Справочники.Найти("бир_АдресаСервисов") = Неопределено Тогда
		СсылкаВыбораОписанияСервиса = Элементы.Вставить("ВыборОписанияСервиса", Тип("ДекорацияФормы"), Элементы.ГруппаНастройкиПодключения, Элементы.Сервер);
		СсылкаВыбораОписанияСервиса.Вид         = ВидДекорацииФормы.Надпись;
		СсылкаВыбораОписанияСервиса.Заголовок   = "Выбрать из справочника";
		СсылкаВыбораОписанияСервиса.Гиперссылка = Истина;
		СсылкаВыбораОписанияСервиса.УстановитьДействие("Нажатие", "ВыборОписанияСервисаНажатие");
	КонецЕсли;

КонецПроцедуры // ПриСозданииНаСервере()

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	Если НЕ ЗначениеЗаполнено(КомандаДляОбработки) Тогда
		КомандаДляОбработки	= КомандыДляОбработки().ВыполнитьЗапрос;
	КонецЕсли;

	КомандаДляОбработкиПриИзменении(Элементы.КомандаДляОбработки);

	Элементы.ГруппаОсновная.ТекущаяСтраница = Элементы.ГруппаПараметрыКоманды;

КонецПроцедуры // ПриОткрытии()

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.бир_АдресаСервисов") Тогда
	   ОписаниеПодключенияКСервису = ОписаниеПодключенияКСервису(ВыбранноеЗначение);
	   
	   Сервер       = ОписаниеПодключенияКСервису.Сервер;
	   АдресРесурса = ОписаниеПодключенияКСервису.АдресРесурса;
	   Пользователь = ОписаниеПодключенияКСервису.Пользователь;
	   Пароль       = ОписаниеПодключенияКСервису.Пароль;
	   Таймаут      = ОписаниеПодключенияКСервису.Таймаут;
	КонецЕсли;
	
КонецПроцедуры // ОбработкаВыбора()

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура КомандаДляОбработкиПриИзменении(Элемент)

	КомандыДляОбработки	= КомандыДляОбработки();

	Элементы.ПараметрыСписокЗапросов.Видимость	= (КомандаДляОбработки = КомандыДляОбработки.СписокЗапросов);
	Элементы.ПараметрыОписаниеЗапроса.Видимость	= (КомандаДляОбработки = КомандыДляОбработки.ОписаниеЗапроса);
	Элементы.ПараметрыВыполнитьЗапрос.Видимость	= (КомандаДляОбработки = КомандыДляОбработки.ВыполнитьЗапрос);

КонецПроцедуры // КомандаДляОбработкиПриИзменении()

&НаКлиенте
Процедура ВыборОписанияСервисаНажатие(Элемент)
	
	ОткрытьФорму("Справочник.бир_АдресаСервисов.ФормаВыбора", , ЭтотОбъект);

КонецПроцедуры // ВыборОписанияСервисаНажатие()

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыполнитьКоманду(Команда)

	ВыполнитьКомандуНаСервере();

	Элементы.ГруппаОсновная.ТекущаяСтраница = Элементы.ГруппаРезультат;

КонецПроцедуры // ВыполнитьКоманду()

&НаСервере
Процедура ВыполнитьКомандуНаСервере()

	ТаблицаРезультат.Очистить();

	КомандыДляОбработки	= КомандыДляОбработки();

	Результат = Новый Массив();

	Если КомандаДляОбработки = КомандыДляОбработки.ВыполнитьЗапрос Тогда
		Результат = ВыполнитьЗапросНаСервере();
	ИначеЕсли КомандаДляОбработки = КомандыДляОбработки.СписокЗапросов Тогда
		Результат = СписокЗапросовНаСервере();
	ИначеЕсли КомандаДляОбработки = КомандыДляОбработки.ОписаниеЗапроса Тогда
		Результат = ОписаниеЗапросаНаСервере();
	Иначе
		Возврат;
	КонецЕсли;

	Если Результат.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	Для й = 1 По Результат.Колонки.Количество() Цикл
		ТаблицаРезультат.Область(1, й).Текст    = Результат.Колонки[й - 1].Имя;
		ТаблицаРезультат.Область(1, й).Шрифт    = Новый Шрифт(ТаблицаРезультат.Область(1, й).Шрифт, , , Истина);
		ТаблицаРезультат.Область(1, й).ЦветФона = Новый Цвет(128, 128, 128);
		ТаблицаРезультат.Область(1, й).РастягиватьПоГоризонтали = Истина;
	КонецЦикла;

	к = 2;
	Для Каждого ТекСтрока Из Результат Цикл
		Для й = 1 По Результат.Колонки.Количество() Цикл
			ТаблицаРезультат.Область(к, й).Текст                    = ТекСтрока[й - 1];
			ТаблицаРезультат.Область(к, й).ВертикальноеПоложение    = ВертикальноеПоложение.Верх;
			ТаблицаРезультат.Область(к, й).РастягиватьПоГоризонтали = Истина;
		КонецЦикла;
		к = к + 1;
	КонецЦикла;

КонецПроцедуры // ВыполнитьКомандуНаСервере()

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция СписокЗапросовНаСервере()

	НастройкиПодключения = бир_ВнешниеИБПолучениеДанных.НастройкиПодключения(НастройкиОбработки(), , Таймаут);

	Результат = бир_ВнешниеИБПолучениеДанных.Запросы(НастройкиПодключения, Поля);

	Если Результат.Количество() = 0 Тогда
		Возврат Результат;
	КонецЕсли;

	Таблица = Новый ТаблицаЗначений();

	Для Каждого ТекЭлемент Из Результат[0] Цикл
		Таблица.Колонки.Добавить(ТекЭлемент.Ключ);
	КонецЦикла;
	Для Каждого ТекЗапрос Из Результат Цикл
		НоваяСтрока = Таблица.Добавить();
		Для Каждого ТекКолонка Из Таблица.Колонки Цикл
			НоваяСтрока[ТекКолонка.Имя] = ТекЗапрос[ТекКолонка.Имя];
			Если НЕ ТипЗнч(НоваяСтрока[ТекКолонка.Имя]) = Тип("Массив") Тогда
				Продолжить;
			КонецЕсли;
			Если ТекКолонка.Имя = "Поля" ИЛИ ТекКолонка.Имя = "Параметры" Тогда
				Значение = Новый Массив();
				Для Каждого ТекЭлемент Из ТекЗапрос[ТекКолонка.Имя] Цикл
					Значение.Добавить(СтрШаблон("%1 (%2)", ТекЭлемент.Имя, ТекЭлемент.ТипЗначения));
				КонецЦикла;
				НоваяСтрока[ТекКолонка.Имя] = СтрСоединить(Значение, Символы.ПС);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;

	Возврат Таблица;

КонецФункции // СписокЗапросовНаСервере()

&НаСервере
Функция ОписаниеЗапросаНаСервере()

	НастройкиПодключения = бир_ВнешниеИБПолучениеДанных.НастройкиПодключения(НастройкиОбработки(), , Таймаут);

	Результат = бир_ВнешниеИБПолучениеДанных.ОписаниеЗапроса(НастройкиПодключения, ИдЗапроса, Поля);

	Таблица = Новый ТаблицаЗначений();
	Таблица.Колонки.Добавить("Реквизит");
	Таблица.Колонки.Добавить("Значение");

	Для Каждого ТекРеквизит Из Результат Цикл
		НоваяСтрока = Таблица.Добавить();
		НоваяСтрока.Реквизит = ТекРеквизит.Ключ;
		НоваяСтрока.Значение = ТекРеквизит.Значение;
		Если НЕ ТипЗнч(ТекРеквизит.Значение) = Тип("Массив") Тогда
			Продолжить;
		КонецЕсли;
		Если ТекРеквизит.Ключ = "Поля" ИЛИ ТекРеквизит.Ключ = "Параметры" Тогда
			Значение = Новый Массив();
			Для Каждого ТекЭлемент Из ТекРеквизит.Значение Цикл
				Значение.Добавить(СтрШаблон("%1 (%2)", ТекЭлемент.Имя, ТекЭлемент.ТипЗначения));
			КонецЦикла;
			НоваяСтрока.Значение = СтрСоединить(Значение, Символы.ПС);
		КонецЕсли;
	КонецЦикла;

	Возврат Таблица;

КонецФункции // ОписаниеЗапросаНаСервере()

&НаСервере
Функция ВыполнитьЗапросНаСервере()

	ВремПараметры = Новый Массив();

	Для Каждого ТекПараметр Из ПараметрыЗапроса Цикл
		бир_ВнешниеИБПолучениеДанных.ДобавитьПараметрЗапроса(ВремПараметры,
		                                                     ТекПараметр.Имя,
															 ТекПараметр.Значение,
															 ТекПараметр.ТипЗначения,
															 ТекПараметр.Предопределенное);
	КонецЦикла;

	НастройкиПодключения = бир_ВнешниеИБПолучениеДанных.НастройкиПодключения(НастройкиОбработки(), , Таймаут);

	ДопПараметры = Новый Структура();
	ДопПараметры.Вставить("Первые", Первые);

	Для Каждого ТекПараметр Из ДополнительныеПараметры Цикл
		ДопПараметры.Вставить(ТекПараметр.Имя, ТекПараметр.Значение);
	КонецЦикла;
		
	РезультатЗапроса = бир_ВнешниеИБПолучениеДанных.РезультатЗапроса(НастройкиПодключения,
	                                                                 ИдЗапроса,
	                                                                 ВремПараметры,
	                                                                 ДопПараметры);
	ПреобразованиеДанных = Обработки.бир_ПреобразованиеДанных.Создать();
	
	Возврат ПреобразованиеДанных.ЗначениеИзСтруктуры(РезультатЗапроса);

КонецФункции // ВыполнитьЗапросНаСервере()

&НаСервере
Функция НастройкиОбработки()

	НастройкиОбработки = Новый Структура();
	НастройкиОбработки.Вставить("Сервер"      , Сервер);
	НастройкиОбработки.Вставить("АдресРесурса", АдресРесурса);
	НастройкиОбработки.Вставить("Пользователь", Пользователь);
	НастройкиОбработки.Вставить("Пароль"      , Пароль);
	НастройкиОбработки.Вставить("Таймаут"     , Таймаут);

	Возврат Новый ФиксированнаяСтруктура(НастройкиОбработки);

КонецФункции // НастройкиОбработки()

&НаСервереБезКонтекста
Функция КомандыДляОбработки()

	КомандыДляОбработки = Новый Структура();
	КомандыДляОбработки.Вставить("СписокЗапросов" , "Получить список запросов");
	КомандыДляОбработки.Вставить("ОписаниеЗапроса", "Получить описание запроса");
	КомандыДляОбработки.Вставить("ВыполнитьЗапрос", "Выполнить запрос");

	Возврат Новый ФиксированнаяСтруктура(КомандыДляОбработки);

КонецФункции // КомандыДляОбработки()

&НаСервереБезКонтекста
Функция ОписаниеПодключенияКСервису(АдресСервиса)

	ОписаниеПодключения = Новый Структура();
	ОписаниеПодключения.Вставить("Сервер"      , "");
	ОписаниеПодключения.Вставить("АдресРесурса", "");
	ОписаниеПодключения.Вставить("Пользователь", "");
	ОписаниеПодключения.Вставить("Пароль"      , "");
	ОписаниеПодключения.Вставить("Таймаут"     , 20);

	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	АдресаСервисов.Сервер КАК Сервер,
	                      |	АдресаСервисов.АдресРесурса КАК АдресРесурса,
	                      |	АдресаСервисов.Пользователь КАК Пользователь,
	                      |	АдресаСервисов.Пароль КАК Пароль,
	                      |	АдресаСервисов.Таймаут КАК Таймаут
	                      |ИЗ
	                      |	Справочник.бир_АдресаСервисов КАК АдресаСервисов
	                      |ГДЕ
	                      |	АдресаСервисов.Ссылка = &АдресСервиса");
	Запрос.УстановитьПараметр("АдресСервиса", АдресСервиса);
	
	Результат = Запрос.Выполнить();
	
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(ОписаниеПодключения, Выборка);
	КонецЕсли;

	Возврат Новый ФиксированнаяСтруктура(ОписаниеПодключения);

КонецФункции // ОписаниеПодключенияКСервису()

#КонецОбласти
