
#Область ОбработчикиСобытийФормы

// Процедура - обработчик события "ПриСозданииНаСервере" формы
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПутьКИнструментуСравнения = ХранилищеОбщихНастроек.Загрузить("бир_СохранениеВосстановлениеДанных_ПутьКИнструментуСравнения");
	
КонецПроцедуры // ПриСозданииНаСервере()

#КонецОбласти // ОбработчикиСобытийФормы

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Процедура - обработчик события "НачалоВыбора" элемента формы "ПутьКИнструментуСравнения"
//
&НаКлиенте
Процедура ПутьКИнструментуСравненияНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	
	Диалог.Фильтр = "Инструмент сравнения (*.exe)|*.exe";
	Диалог.Заголовок = "Выбор инструмента сравнения";
	
	ЗавершениеВыбораФайла = Новый ОписаниеОповещения("ПутьКИнструментуСравненияНачалоВыбораЗавершение", ЭтотОбъект);
	
	Диалог.Показать(ЗавершениеВыбораФайла);
	
КонецПроцедуры // ПутьКИнструментуСравненияНачалоВыбора()

// Процедура - продолжение обработки выбора инструмента сравнения
//
&НаКлиенте
Процедура ПутьКИнструментуСравненияНачалоВыбораЗавершение(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	Если НЕ ТипЗнч(ВыбранныеФайлы) = Тип("Массив") Тогда
		Возврат;
	КонецЕсли;
	
	Если ВыбранныеФайлы.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ПутьКИнструментуСравнения = ВыбранныеФайлы[0];
	
КонецПроцедуры // ПутьКИнструментуСравненияНачалоВыбораЗавершение()

#КонецОбласти // ОбработчикиСобытийЭлементовШапкиФормы

#Область ОбработчикиКомандФормы

// Процедура - обработчик команды "КомандаОк"
//
&НаКлиенте
Процедура КомандаОк(Команда)
	
	СохранитьПутьКИнструментуСравнения(ПутьКИнструментуСравнения);
	
	Закрыть(КодВозвратаДиалога.ОК);
	
КонецПроцедуры // КомандаОк()

#КонецОбласти // ОбработчикиКомандФормы

#Область СлужебныеПроцедурыИФункции

// Процедура - помещает настройку инструмента сравнения в хранилище настроек
//
&НаСервереБезКонтекста
Процедура СохранитьПутьКИнструментуСравнения(Путь)
	
	ХранилищеОбщихНастроек.Сохранить("бир_СохранениеВосстановлениеДанных_ПутьКИнструментуСравнения", , Путь);
	
КонецПроцедуры // СохранитьПутьКИнструментуСравнения()

#КонецОбласти // СлужебныеПроцедурыИФункции
