Перем ПреобразованиеДанных;

#Область ПрограммныйИнтерфейс

// Функция - Подтверждает, что обработка является обработкой обслуживания
// 
// Возвращаемое значение:
//  Булево - Истина
//
Функция ЭтоОбработкаВыполненияОбработчика() Экспорт
	
	Возврат Истина;
	
КонецФункции //ЭтоОбработкаВыполненияОбработчика()

// Функция - Получает форму обработчиков команд, где расположены процедуры-обработчики команд
// 			 из списка действий кнопки открытия поля выбора обработки обслуживания
// 
// Возвращаемое значение:
//  Строка - Имя формы обработчиков комманд
//
Функция ПолучитьФормуОбработчиковКоманд() Экспорт
	
	Возврат "Форма";
	
КонецФункции //ПолучитьФормуОбработчиковКоманд()

// Функция - Получает список действий кнопки открытия поля выбора обработки обслуживания
// 
// Возвращаемое значение:
//  СписокЗначений - Список действий
//
Функция ПолучитьСписокДействийКнопкиОткрытия() Экспорт
	
	СписокДействий = Новый СписокЗначений();
	
	Возврат СписокДействий;
	
КонецФункции //ПолучитьСписокДействийКнопкиОткрытия()

// Функция - выполняет обработку события
//
// Параметры:
//  ОписаниеСобытия     - Структура                 - описание события (см. бир_События.СтруктураОписанияСобытия())
//  Обработчик          - СправочникСсылка			- обработчик события
//                        .бир_СобытияОбработчики
//  ПараметрыСобытия    - Структура                 - параметры, сформированные при возникновении события
// 
// Возвращаемое значение:
//  Булево    - Истина - Обработка выполнена успешно, Ложь - в противном случае
//
Функция ОбработатьСобытие(ОписаниеСобытия, Обработчик, ПараметрыСобытия) Экспорт
	
	Если НЕ ТипЗнч(ПараметрыСобытия) = Тип("Структура") Тогда
		ПараметрыСобытия = Новый Структура();
	КонецЕсли;
	
	ПараметрыСобытия.Вставить("ПредставлениеИсточника", СокрЛП(ОписаниеСобытия.Источник));
	
	Если ПараметрыСобытия.Свойство("__Тип") И ПараметрыСобытия.__Тип = "Структура" Тогда
		СтруктураПараметров = ПараметрыСобытия;
	Иначе
		СтруктураПараметров = ПреобразованиеДанных().ЗначениеВСтруктуру(ПараметрыСобытия);
	КонецЕсли;

	Настройка = Обработчик.ОбработкаНастройки.Получить();
	Если НЕ ТипЗнч(Настройка) = Тип("Структура") Тогда
		ПараметрыСобытия.Вставить("РезультатОбработки", "Не указаны настройки соединения с внешней ИБ");
		ПараметрыСобытия.Вставить("ОшибкаОбработки", Истина);
		Возврат Ложь;
	КонецЕсли;
	
	ВнешниеИБ = Неопределено;
	Если НЕ (Настройка.Свойство("СобытияВнешнихИБДляПередачи", ВнешниеИБ)
	       И ТипЗнч(Настройка.СобытияВнешнихИБДляПередачи) = Тип("ТаблицаЗначений")) Тогда
		ПараметрыСобытия.Вставить("РезультатОбработки", "Не указаны события внешних ИБ для передачи");
		ПараметрыСобытия.Вставить("ОшибкаОбработки", Истина);
		Возврат Ложь;
	КонецЕсли;
	
	Если ВнешниеИБ.Колонки.Найти("ВнешняяСистема") = Неопределено Тогда
		ПараметрыСобытия.Вставить("РезультатОбработки",
		                          "В настройках соединения с внешними ИБ отсутствует колонка ""ВнешняяСистема""");
		ПараметрыСобытия.Вставить("ОшибкаОбработки", Истина);
		Возврат Ложь;
	КонецЕсли;
	
	Для Каждого ТекСтрока Из ВнешниеИБ Цикл
		
		МассивСобытий = Новый Массив();
		
		ОписаниеВнешнегоСобытия = бир_ВнешниеСобытияОбработкаЗапросов.ОписаниеВнешнегоСобытия();
		ОписаниеВнешнегоСобытия.ИдСобытия             = ОписаниеСобытия.ИдСобытия;
		ОписаниеВнешнегоСобытия.Источник_Наименование = СокрЛП(ОписаниеСобытия.Событие);
		ОписаниеВнешнегоСобытия.Источник_Ид           = ОписаниеСобытия.Событие.Ид;
		ОписаниеВнешнегоСобытия.Приемник_Наименование = ТекСтрока.НаименованиеСобытия;
		ОписаниеВнешнегоСобытия.Приемник_Ид           = ТекСтрока.ИдСобытия;
		ОписаниеВнешнегоСобытия.ИдТочки               = ОписаниеСобытия.ТочкаВозникновения.Ид;
		ОписаниеВнешнегоСобытия.Дата                  = ОписаниеСобытия.Дата;
		ОписаниеВнешнегоСобытия.Момент                = ОписаниеСобытия.Момент;
		ОписаниеВнешнегоСобытия.ИдПервичный           = ОписаниеСобытия.ИдПервичный;
		ОписаниеВнешнегоСобытия.Параметры             = СтруктураПараметров;
		
		МассивСобытий.Добавить(ОписаниеВнешнегоСобытия);
		
		СтруктураНастроек = бир_ВнешниеИБПолучениеДанных.НастройкиПодключения(ТекСтрока.ВнешняяСистема.СервисСобытий_Адрес);
		
		Попытка
			бир_ВнешниеСобытияОтправкаЗапросов.ПередатьСобытиеВоВнешнююИБ(СтруктураНастроек, МассивСобытий);
		Исключение
			ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ТекстОшибки = СтрШаблон("Ошибка передачи событий во внешнюю ИБ ""%1"":%2%3",
			                        ТекСтрока.ВнешняяСистема.СервисСобытий_Адрес,
			                        Символы.ПС,
			                        ТекстОшибки);
			ПараметрыСобытия.Вставить("РезультатОбработки", ТекстОшибки);
			ПараметрыСобытия.Вставить("ОшибкаОбработки", Истина);
			Возврат Ложь;
		КонецПопытки;
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции // ОбработатьСобытие()

Функция ПреобразованиеДанных()
	
	Если ПреобразованиеДанных = Неопределено Тогда 
		ПреобразованиеДанных = Обработки.бир_ПреобразованиеДанных.Создать();
	КонецЕсли;
	
	Возврат ПреобразованиеДанных;
	
КонецФункции // ПреобразованиеДанных()

#КонецОбласти // ПрограммныйИнтерфейс
