&НаСервере
Перем ПреобразованиеДанных;

#Область ОписаниеПеременных

&НаКлиенте
Перем ФормаРедактированияЗапроса;    // УправляемаяФорма - форма редактора запроса

#КонецОбласти // ОписаниеПеременных

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ОбработкаНастройкиАдресВХранилище") Тогда
		ОбработкаНастройкиАдресВХранилище = Параметры.ОбработкаНастройкиАдресВХранилище;
	КонецЕсли;
	
	Элементы.ЗаполнениеПолейАтрибутАД.СписокВыбора.ЗагрузитьЗначения(АтрибутыПользователейАД());
	Элементы.ЗаполнениеПолейАтрибутАД.СписокВыбора.СортироватьПоЗначению();

КонецПроцедуры // ПриСозданииНаСервере()

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Настройки = ПолучитьИзВременногоХранилища(ОбработкаНастройкиАдресВХранилище);
	
	ПрочитатьНастройкиИзСтруктуры(Настройки);

	Попытка
		ОбновитьСписокКолонокЗапроса();
	Исключение
		ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ТекстОшибки = СтрШаблон("Ошибка получения списка колонок запроса:%1%2", Символы.ПС, ТекстОшибки);
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки);
	КонецПопытки;

	Попытка
		ОбновитьСписокПроизвольныхВыражений();
	Исключение
		ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ТекстОшибки = СтрШаблон("Ошибка получения списка произвольных выражений запроса:%1%2", Символы.ПС, ТекстОшибки);
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки);
	КонецПопытки;
	
КонецПроцедуры // ПриОткрытии()

// Процедура - Обработка оповещения
//
&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ИзмененыНастройки" И Параметр = ЭтаФорма Тогда
		ОбновитьСписокКолонокЗапроса();
		ОбновитьСписокПроизвольныхВыражений();
	КонецЕсли;
	
КонецПроцедуры // ОбработкаОповещения()

#КонецОбласти // ОбработчикиСобытийФормы

#Область ОбработчикиСобытийЭлементовФормы

// Процедура - Обработчик события "ПриНачалеРедактирования" таблицы "ЗаполнениеПолей" формы
//
&НаКлиенте
Процедура ЗаполнениеПолейПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	
КонецПроцедуры // ЗаполнениеПолейПриНачалеРедактирования()

#КонецОбласти // ОбработчикиСобытийЭлементовФормы()

#Область ОбработчикиКомандФормы

// Процедура - Обработчик команды "СохранитьНастройку"
//
&НаКлиенте
Процедура СохранитьНастройку(Команда)
	
	Настройки = НастройкиВСтруктуру();
	
	ПоместитьВоВременноеХранилище(Настройки, ОбработкаНастройкиАдресВХранилище);
	
	Оповестить("ИзмененыНастройки", ЭтаФорма.ВладелецФормы, ЭтаФорма);
	
	Модифицированность = Ложь;
	
КонецПроцедуры // СохранитьНастройку()

// Процедура - Обработчик команды "СохранитьНастройкуИЗакрыть"
//
&НаКлиенте
Процедура СохранитьНастройкуИЗакрыть(Команда)
	
	СохранитьНастройку(Команда);
	
	Закрыть("ИзмененыНастройки");
	
КонецПроцедуры // СохранитьНастройкуИЗакрыть()

// Процедура - Обработчик команды "РедактироватьЗапрос" - открывает редактор запроса
//
&НаКлиенте
Процедура РедактироватьЗапрос(Команда)
	
	ФормаРедактированияЗапроса().Открыть();
	
КонецПроцедуры // РедактироватьЗапрос()

// Процедура - Обработчик команды "ПоказатьТекстЗапросаАД" - показывает текст исполняемого запроса
//
&НаКлиенте
Процедура ПоказатьТекстЗапросаАД(Команда)
	
	НастройкиПолученияДанных = ПолучитьИзВременногоХранилища(ОбработкаНастройкиАдресВХранилище);
	
	ТекстЗапроса = ТекстЗапросаАД(НастройкиПолученияДанных);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "[[ПутьЛДАП]]", Домен);
	Если НЕ ЗначениеЗаполнено(ТекстЗапроса) Тогда
		Возврат;
	КонецЕсли;
	
	ВремТекст = Новый ТекстовыйДокумент();
	ВремТекст.УстановитьТекст(ТекстЗапроса);
	ВремТекст.Показать("Текст запроса Active Directory");
	
КонецПроцедуры // ПоказатьТекстЗапросаАД()

// Процедура - Обработчик команды "СохранитьНастройкиВФайл"
//
&НаКлиенте
Процедура СохранитьНастройкиВФайл(Команда)
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	Диалог.Фильтр				= "Текстовые файлы (*.json)|*.json|Все файлы (*.*)|*.*";
	Диалог.Расширение			= "json";
	Диалог.МножественныйВыбор	= Ложь;
	
	ОповещениеВыбораФайла = Новый ОписаниеОповещения("СохранитьНастройкиВФайлОбработка", ЭтаФорма);
	
	Диалог.Показать(ОповещениеВыбораФайла);
	
КонецПроцедуры // СохранитьНастройкиВФайл()

// Процедура - Продолжение обработчика команды "СохранитьНастройкиВФайл"
//				после выполнения выбора файла для сохранения
//
// Параметры:
//  ВыбранныеФайлы		 - Массив		 - Имена выбранных файлов
//  Параметры			 - Структура	 - Параметры переданные из команды "СохранитьНастройкиВФайл"
//
&НаКлиенте
Процедура СохранитьНастройкиВФайлОбработка(ВыбранныеФайлы, Параметры) Экспорт
	
	Если ВыбранныеФайлы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Настройки = НастройкиВСтруктуру();
	
	ВремТекст = Новый ТекстовыйДокумент();
	ВремТекст.УстановитьТекст(ТекстНастроекДляСохранения(Настройки));
	
	ВремТекст.Записать(ВыбранныеФайлы[0]);
	
КонецПроцедуры // СохранитьНастройкиВФайлОбработка()

// Процедура - Обработчик команды "ЗагрузитьНастройкиИзФайла"
//
&НаКлиенте
Процедура ЗагрузитьНастройкиИзФайла(Команда)
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Фильтр				= "Текстовые файлы (*.json)|*.json|Все файлы (*.*)|*.*";
	Диалог.Расширение			= "json";
	Диалог.МножественныйВыбор	= Ложь;
	
	ОповещениеВыбораФайла = Новый ОписаниеОповещения("ЗагрузитьНастройкиИзФайлаОбработка", ЭтаФорма);
	
	Диалог.Показать(ОповещениеВыбораФайла);
	
КонецПроцедуры // ЗагрузитьНастройкиИзФайла()

// Процедура - Продолжение обработчика команды "ЗагрузитьНастройкиИзФайла"
//				после выполнения выбора файла для загрузки
//
// Параметры:
//  ВыбранныеФайлы		 - Массив		 - Имена выбранных файлов
//  Параметры			 - Структура	 - Параметры переданные из команды "ЗагрузитьНастройкиИзФайла"
//
&НаКлиенте
Процедура ЗагрузитьНастройкиИзФайлаОбработка(ВыбранныеФайлы, Параметры) Экспорт
	
	Если ВыбранныеФайлы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ВремТекст = Новый ТекстовыйДокумент();
	ВремТекст.Прочитать(ВыбранныеФайлы[0]);
	
	Настройки = НастройкиИзТекста(ВремТекст.ПолучитьТекст());
	
	ПрочитатьНастройкиИзСтруктуры(Настройки);
	
КонецПроцедуры // ЗагрузитьНастройкиИзФайлаОбработка()

// Процедура - Обработчик команды "ВыгрузитьДанные"
//
&НаКлиенте
Процедура ОбновитьДанныеАД(Команда) Экспорт
	
	НастройкиПолученияДанных = ФормаРедактированияЗапроса().ПолучитьЗапросСПараметрами();

	ОбновитьДанныеАДНаСервере(НастройкиПолученияДанных);
	
КонецПроцедуры // ОбновитьДанныеАД()

#КонецОбласти // ОбработчикиКомандФормы

#Область ПроцедурыПодготовкиЗаполненияПолей

// Процедура - Обновляет список колонок запроса для выбора
//
&НаКлиенте
Процедура ОбновитьСписокКолонокЗапроса()
	
	Элементы.ЗаполнениеПолейКолонкаЗапроса.СписокВыбора.Очистить();
	
	КолонкиЗапроса = ФормаРедактированияЗапроса().ПолучитьКолонкиЗапроса();
	
	Для Каждого ТекКолонка Из КолонкиЗапроса Цикл
		Элементы.ЗаполнениеПолейКолонкаЗапроса.СписокВыбора.Добавить(ТекКолонка.Имя);
	КонецЦикла;
	Элементы.ЗаполнениеПолейКолонкаЗапроса.СписокВыбора.СортироватьПоПредставлению();

КонецПроцедуры // ОбновитьСписокКолонокЗапроса()

// Процедура - Обновляет список произвольных выражений
//
&НаКлиенте
Процедура ОбновитьСписокПроизвольныхВыражений()
	
	Элементы.ЗаполнениеПолейВыражение.СписокВыбора.Очистить();
	
	ЗапросСПараметрами = ФормаРедактированияЗапроса().ПолучитьЗапросСПараметрами();
	
	Для Каждого ТекВыражение Из ЗапросСПараметрами.ПроизвольныеВыражения Цикл
		Элементы.ЗаполнениеПолейВыражение.СписокВыбора.Добавить(ТекВыражение.Ключ);
	КонецЦикла;
	
КонецПроцедуры // ОбновитьСписокПроизвольныхВыражений()

#КонецОбласти // ПроцедурыПодготовкиЗаполненияПолей

#Область ПроцедурыОбработкиДанных

// Процедура - Выполняет поиск и изменение записей Active Directory
//
// Параметры:
//  НастройкиПолученияДанных			 - Структура				 - Настройки выполнения запроса к 1С
//  ТекстОшибки							 - Строка					 - Описание возникшей ошибки
//
&НаСервере
Процедура ОбновитьДанныеАДНаСервере(НастройкиПолученияДанных)
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	
	ДопПараметры = Новый Структура();
	ДопПараметры.Вставить("Источник", Неопределено);
	
	ПроцессорЗапросов = Обработки.бир_ПроцессорЗапросов.Создать();
	ПроцессорЗапросов.УстановитьТекстЗапроса(НастройкиПолученияДанных.Запрос_Текст);
	ПроцессорЗапросов.УстановитьПараметрыЗапроса(НастройкиПолученияДанных.Запрос_Параметры);
	ПроцессорЗапросов.УстановитьПроизвольныеВыражения(НастройкиПолученияДанных.ПроизвольныеВыражения);
	ПроцессорЗапросов.УстановитьДополнительныеПараметры(ДопПараметры);

	Попытка
		РезультатЗапроса = ПроцессорЗапросов.ВыполнитьЗапрос(0, Ложь);
	Исключение
		ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ТекстОшибки = СтрШаблон("Ошибка выполнения запроса 1С:%1%2", Символы.ПС, ТекстОшибки);
		ВызватьИсключение ТекстОшибки;
	КонецПопытки;
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаКВыгрузке = РезультатЗапроса.Выгрузить();
	
	ЗапросыАД = ОбработкаОбъект.ПодготовитьДанныеДляВыгрузки(ТаблицаКВыгрузке,
	                                                         ЗаполнениеПолей.Выгрузить(),
															 НастройкиПолученияДанных.ПроизвольныеВыражения);
	
	Если НЕ ПустаяСтрока(ТекстОшибки) Тогда
		ТекстОшибки = "Ошибка подготовки запросов Active Directory: " + ТекстОшибки;
		Возврат;
	КонецЕсли;
	
	НастройкиПолученияДанных = ПолучитьИзВременногоХранилища(ОбработкаНастройкиАдресВХранилище);
    ОбработкаОбъект.ПрочитатьНастройки(НастройкиПолученияДанных);
	
	Результат = ОбработкаОбъект.ОбработатьЗаписиАД(ЗапросыАД);
	
КонецПроцедуры // ОбновитьДанныеАДНаСервере()

#КонецОбласти // ПроцедурыОбработкиДанных

#Область СлужебныеПроцедуры

// Функция - Получает список атрибутов пользователей Active Directory
// 
// Возвращаемое значение:
//   Массив (Строка)		- Массив имен атрибутов пользователей Active Directory
//
&НаКлиентеНаСервереБезКонтекста
Функция АтрибутыПользователейАД()
	
	Атрибуты = Новый Массив();
	Атрибуты.Добавить("ADsPath");
	Атрибуты.Добавить("sAMAccountName");   // Наименование 
	Атрибуты.Добавить("canonicalName"); // КаноничноеИмя
	Атрибуты.Добавить("Enabled"); // Действующий
	Атрибуты.Добавить("info");
	Атрибуты.Добавить("userPrincipalName"); // ИмяПользователяПочты
	Атрибуты.Добавить("displayName"); // ФамилияИмя
	Атрибуты.Добавить("displayNamePrintable"); // ФамилияИмяНаПечать
	Атрибуты.Добавить("distinguishedName");
	Атрибуты.Добавить("employeeType"); // ТипВладельца
	Атрибуты.Добавить("employeeID"); // Табельный номер ИДВладельца
	Атрибуты.Добавить("manager"); // Руководитель
	Атрибуты.Добавить("department"); // Отдел НаименованиеДепартамента
	Атрибуты.Добавить("title"); // Должность НаименованиеПозиции
	Атрибуты.Добавить("physicaldeliveryofficename"); // Адреса местонахождения
	Атрибуты.Добавить("mobile"); // Номер мобильного телефона МобильныйТелефон
	Атрибуты.Добавить("otherMobile"); // Другой номер мобильного телефона
	Атрибуты.Добавить("telephoneNumber"); //Номер стационарного телефона+екстеншен АдресТелефон
	Атрибуты.Добавить("ipphone");
	Атрибуты.Добавить("otheripphone");
	Атрибуты.Добавить("profilePath");
	Атрибуты.Добавить("l");  // Город АдресГород
	Атрибуты.Добавить("countryCode"); // КодСтраны
	Атрибуты.Добавить("co"); // СтранаПолн
	Атрибуты.Добавить("c"); // СтранаСокр
	Атрибуты.Добавить("sn"); // ФамилияВРЕГ
	Атрибуты.Добавить("st"); // Регион АдресРегион
	Атрибуты.Добавить("streetAddress"); // АдресУлица
	Атрибуты.Добавить("postalCode"); // АдресИндекс
	Атрибуты.Добавить("otherTelephone");
	Атрибуты.Добавить("facsimileTelephoneNumber");
	Атрибуты.Добавить("HomeDirectory");
	Атрибуты.Добавить("HomeDrive");
	Атрибуты.Добавить("scriptPath");
	Атрибуты.Добавить("msExchHomeServerName");
	Атрибуты.Добавить("msExchHideFromAddressLists");
	Атрибуты.Добавить("msExchIMPhysicalURL");
	Атрибуты.Добавить("description");
	Атрибуты.Добавить("company"); // Организация

	Атрибуты.Добавить("GivenName"); // ИмяВРЕГ
	Атрибуты.Добавить("HomePhone");
	Атрибуты.Добавить("Initials"); // ИнициалыОтчества
	Атрибуты.Добавить("mail"); // АдресЭП
	Атрибуты.Добавить("Name"); // ФамилияИмяВРЕГ
	Атрибуты.Добавить("lastDataChange"); // ДатаПоследнегоИзменения
	
	Возврат Атрибуты;
	
КонецФункции // АтрибутыПользователейАД()

// Функция - Получает форму редактирования запросов
// 
// Возвращаемое значение:
//  УправляемаяФорма - Форма редактирования запроса
//
&НаКлиенте
Функция ФормаРедактированияЗапроса() Экспорт
	
	Если ФормаРедактированияЗапроса = Неопределено Тогда
		ФормаРедактированияЗапроса = ПолучитьФорму("Обработка.бир_ПроцессорЗапросов.Форма.Форма", , ЭтаФорма);
		ФормаРедактированияЗапроса.ОписаниеОповещенияОЗакрытии =
			Новый ОписаниеОповещения("ФормаРедактированияЗапросаЗакрытие", ЭтотОбъект);
	КонецЕсли;
	
	Возврат ФормаРедактированияЗапроса;
	
КонецФункции // ФормаРедактированияЗапроса()

// Процедура - обработчик события закрытия формы редактирования запроса
//
// Параметры:
//   РезультатЗакрытия          - Строка       - данные, возвращенные при закрытии формы
//   ДополнительныеПараметры    - Структура    - параметры обработки
//
&НаКлиенте
Процедура ФормаРедактированияЗапросаЗакрытие(РезультатЗакрытия, ДополнительныеПараметры) Экспорт

	Если РезультатЗакрытия = "ИзмененыНастройки" Тогда
		ОбновитьСписокКолонокЗапроса();
		ОбновитьСписокПроизвольныхВыражений();
	КонецЕсли;

КонецПроцедуры // ФормаРедактированияЗапросаЗакрытие()

&НаКлиенте
Функция НастройкиВСтруктуру()
	
	Настройки = Новый Структура();
	Настройки.Вставить("Домен"            , Домен);
	Настройки.Вставить("Группа"           , Группа);
	Настройки.Вставить("Пользователь"     , Пользователь);
	Настройки.Вставить("Пароль"           , Пароль);
	Настройки.Вставить("СоздаватьЗаписиАД", СоздаватьЗаписиАД);
	Настройки.Вставить("ПарольПоУмолчанию", ПарольПоУмолчанию);
	
	Настройки.Вставить("ЗаполнениеПолей", Новый Массив());
	Для Каждого ТекСтрока Из ЗаполнениеПолей Цикл
		НоваяСтрока = Новый Структура();
		НоваяСтрока.Вставить("АтрибутАД"     , ТекСтрока.АтрибутАД);
		НоваяСтрока.Вставить("КолонкаЗапроса", ТекСтрока.КолонкаЗапроса);
		НоваяСтрока.Вставить("Выражение"     , ТекСтрока.Выражение);
		НоваяСтрока.Вставить("ПолеПоиска"    , ТекСтрока.ПолеПоиска);
		НоваяСтрока.Вставить("НеПустое"      , ТекСтрока.НеПустое);
		
		Настройки.ЗаполнениеПолей.Добавить(НоваяСтрока);
	КонецЦикла;
	
	ЗапросСПараметрами = ФормаРедактированияЗапроса().ПолучитьЗапросСПараметрами();

	Настройки.Вставить("Запрос_Текст"         , ЗапросСПараметрами.Запрос_Текст);
	Настройки.Вставить("Запрос_Параметры"     , ЗапросСПараметрами.Запрос_Параметры);
	Настройки.Вставить("ПроизвольныеВыражения", ЗапросСПараметрами.ПроизвольныеВыражения);

	Возврат Настройки;
	
КонецФункции // НастройкиВСтруктуру()

&НаКлиенте
Процедура ПрочитатьНастройкиИзСтруктуры(Настройки)

	Если НЕ ТипЗнч(Настройки) = Тип("Структура")  Тогда
		Возврат;
	КонецЕсли;
	
	Настройки.Свойство("Домен"            , Домен);
	Настройки.Свойство("Группа"           , Группа);
	Настройки.Свойство("Пользователь"     , Пользователь);
	Настройки.Свойство("Пароль"           , Пароль);
	Настройки.Свойство("СоздаватьЗаписиАД", СоздаватьЗаписиАД);
	Настройки.Свойство("ПарольПоУмолчанию", ПарольПоУмолчанию);
	
	Если Настройки.Свойство("ЗаполнениеПолей") И ТипЗнч(Настройки.ЗаполнениеПолей) = Тип("Массив") Тогда
		Для Каждого ТекСтрока Из Настройки.ЗаполнениеПолей Цикл
			НоваяСтрока = ЗаполнениеПолей.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
		КонецЦикла;
	КонецЕсли;

	ФормаРедактированияЗапроса().УстановитьЗапросСПараметрами(Настройки);

КонецПроцедуры // ПрочитатьНастройкиИзСтруктуры()

// Функция - Преобразует настройки в текст на сервере
//
&НаСервере
Функция ТекстНастроекДляСохранения(Настройки)
	
	ПреобразованиеДанных = ПреобразованиеДанных();
	
	ТекстНастроек = ПреобразованиеДанных.ЗначениеВСтруктуру(Настройки);

	Возврат ПреобразованиеДанных.ЗаписатьОписаниеОбъектаВJSON(ТекстНастроек);
	
КонецФункции // ТекстНастроекДляСохранения()

// Функция - Преобразует текст в настройки на сервере
//
&НаСервере
Функция НастройкиИзТекста(ТекстНастроек)
	
	ПреобразованиеДанных = ПреобразованиеДанных();

	Настройки = ПреобразованиеДанных.ПрочитатьОписаниеОбъектаИзJSON(ТекстНастроек);

	Возврат ПреобразованиеДанных.ЗначениеИзСтруктуры(Настройки);
	
КонецФункции // НастройкиИзТекста()

// Функция - Получает текст запроса Active Directory
//
// Параметры:
//  НастройкиПолученияДанных		- Структура			 - Настройки получения данных из формы редактирования запроса
// 
// Возвращаемое значение:
//   Строка	- Такст запроса Active Directory
//
&НаСервере
Функция ТекстЗапросаАД(НастройкиПолученияДанных)
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ПрочитатьНастройки(НастройкиПолученияДанных);
	
	ДопПараметры = Новый Структура();
	ДопПараметры.Вставить("Источник", Неопределено);
	
	ПроцессорЗапросов = Обработки.бир_ПроцессорЗапросов.Создать();
	ПроцессорЗапросов.УстановитьТекстЗапроса(НастройкиПолученияДанных.Запрос_Текст);
	ПроцессорЗапросов.УстановитьПараметрыЗапроса(НастройкиПолученияДанных.Запрос_Параметры);
	ПроцессорЗапросов.УстановитьПроизвольныеВыражения(НастройкиПолученияДанных.ПроизвольныеВыражения);
	ПроцессорЗапросов.УстановитьДополнительныеПараметры(ДопПараметры);

	Попытка
		РезультатЗапроса = ПроцессорЗапросов.ВыполнитьЗапрос(1, Ложь);
	Исключение
		ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ТекстОшибки = СтрШаблон("Ошибка выполнения запроса 1С:%1%2", Символы.ПС, ТекстОшибки);
		ВызватьИсключение ТекстОшибки;
	КонецПопытки;

	ТаблицаКВыгрузке = РезультатЗапроса.Выгрузить();
	
	ВсегоСтрок = ТаблицаКВыгрузке.Количество();
	
	Попытка
		ЗапросыАД = ОбработкаОбъект.ПодготовитьДанныеДляОбработки(ТаблицаКВыгрузке);
	Исключение
		ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ТекстОшибки = СтрШаблон("Ошибка подготовки запросов к Active Directory:%1%2",
		                        Символы.ПС,
		                        ТекстОшибки);
		ВызватьИсключение ТекстОшибки;
	КонецПопытки;
	
	Возврат ?(ВсегоСтрок = 0, "", ЗапросыАД[0].Запрос);
	
КонецФункции // ТекстЗапросаАД()

&НаСервере
Функция ПреобразованиеДанных()
	
	Если ПреобразованиеДанных = Неопределено Тогда 
		ПреобразованиеДанных = Обработки.бир_ПреобразованиеДанных.Создать();
	КонецЕсли;
	
	Возврат ПреобразованиеДанных;
	
КонецФункции // ПреобразованиеДанных()

#КонецОбласти // СлужебныеПроцедуры
