#Область ПрограммныйИнтерфейс

// Функция - Подтверждает, что обработка является обработкой обслуживания
// 
// Возвращаемое значение:
//  Булево - Истина
//
Функция ЭтоОбработкаВыполненияОбработчика() Экспорт
	
	Возврат Истина;
	
КонецФункции // ЭтоОбработкаВыполненияОбработчика()

// Функция - Получает форму обработчиков команд, где расположены процедуры-обработчики команд
// 			 из списка действий кнопки открытия поля выбора обработки обслуживания
// 
// Возвращаемое значение:
//  Строка - Имя формы обработчиков комманд
//
Функция ПолучитьФормуОбработчиковКоманд() Экспорт
	
	Возврат "Форма";
	
КонецФункции // ПолучитьФормуОбработчиковКоманд()

// Функция - Получает список действий кнопки открытия поля выбора обработки обслуживания
// 
// Возвращаемое значение:
//  СписокЗначений - Список действий
//
Функция ПолучитьСписокДействийКнопкиОткрытия() Экспорт
	
	СписокДействий = Новый СписокЗначений();
	
	Возврат СписокДействий;
	
КонецФункции // ПолучитьСписокДействийКнопкиОткрытия()

// Функция - выполняет обработку события
//
// Параметры:
//  ОписаниеСобытия     - Структура                 - описание события (см. бир_События.СтруктураОписанияСобытия())
//  Обработчик          - СправочникСсылка			- обработчик события
//                        .бир_СобытияОбработчики
//  ПараметрыСобытия    - Структура                 - параметры, сформированные при возникновении события
// 
// Возвращаемое значение:
//  Булево    - Истина - Обработка выполнена успешно, Ложь - в противном случае
//
Функция ОбработатьСобытие(ОписаниеСобытия, Обработчик, ПараметрыСобытия) Экспорт
	
	ИмяПоляНастройки_Код = "ОбработкаНаСервере_Код";
	
	Результат = Ложь;
	
	Настройка = Обработчик.ОбработкаНастройки.Получить();
	
	Если НЕ ТипЗнч(Настройка) = Тип("Структура") Тогда
		ТекстОшибки = СтрШаблон("Не указаны настройки обработчика события ""%1""!", СокрЛП(Обработчик));
		ПараметрыСобытия.Вставить("РезультатОбработки", ТекстОшибки);
		ПараметрыСобытия.Вставить("ОшибкаОбработки", Истина);
		Возврат Результат;
	КонецЕсли;
	
	ИсполняемыйКод = "";
	Если НЕ Настройка.Свойство(ИмяПоляНастройки_Код, ИсполняемыйКод) Тогда
		ТекстОшибки = СтрШаблон("В настройках обработчика события ""%1"" отсутствует поле ""%2""!",
		                         СокрЛП(Обработчик),
		                         СокрЛП(ИмяПоляНастройки_Код));
		ПараметрыСобытия.Вставить("РезультатОбработки", ТекстОшибки);
		ПараметрыСобытия.Вставить("ОшибкаОбработки", Истина);
		Возврат Результат;
	КонецЕсли;
	
	Если ИсполняемыйКод = "" Тогда
		Возврат Результат;
	КонецЕсли;
	
	Попытка
		Выполнить(ИсполняемыйКод);
	Исключение
		ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ТекстОшибки = СтрШаблон("Ошибка выполнения обработчика ""%1"" события ""%2"":%3%4%3код обработчика:%3%5",
		                        СокрЛП(Обработчик),
		                        СокрЛП(ОписаниеСобытия.Событие),
		                        Символы.ПС,
		                        ТекстОшибки,
		                        ИсполняемыйКод);
		ПараметрыСобытия.Вставить("РезультатОбработки", ТекстОшибки);
		ПараметрыСобытия.Вставить("ОшибкаОбработки", Истина);
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции // ОбработатьСобытие()

// Функция - получает список пользователей, для которых должна быть выполнена обработка на клиенте
//
// Параметры:
//  ОписаниеСобытия     - Структура                  - описание события (см. бир_События.СтруктураОписанияСобытия())
//  Обработчик          - СправочникСсылка           - обработчик события
//                        .бир_СобытияОбработчики
//  ПараметрыСобытия    - Структура                  - параметры, сформированные при возникновении события
// 
// Возвращаемое значение:
//  Массив     - Массив пользователей
//
Функция ПолучитьПользователей(ОписаниеСобытия, Обработчик, ПараметрыСобытия) Экспорт
	
	ИмяПоляНастройки_Код = "ОбработкаПолучениеПользователей_Код";
	
	Результат = Новый Массив();
	
	Настройка = Обработчик.ОбработкаНастройки.Получить();
	
	Если НЕ ТипЗнч(Настройка) = Тип("Структура") Тогда
		ТекстОшибки = "Не указаны настройки обработчика события """ + СокрЛП(Обработчик) + """!";
		Возврат Результат;
	КонецЕсли;
	
	ИсполняемыйКод = "";
	Если НЕ Настройка.Свойство(ИмяПоляНастройки_Код, ИсполняемыйКод) Тогда
		ТекстОшибки = "В настройках обработчика события """ + СокрЛП(Обработчик) + """ отсутствует поле """ + СокрЛП(ИмяПоляНастройки_Код) + """!";
		Возврат Результат;
	КонецЕсли;
	
	Если ИсполняемыйКод = "" Тогда
		Возврат Результат;
	КонецЕсли;
	
	Попытка
		Выполнить(ИсполняемыйКод);
	Исключение
		ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции // ПолучитьПользователей()

#КонецОбласти

#Область СлужебныеПроцедуры

#КонецОбласти
