
#Область СлужебныйПрограммныйИнтерфейс

// Получает значение параметров из строки.
//
// Параметры:
// СтрокаПараметров - строка, содержащая параметры, каждый из которых представляет собой
//        фрагмент вида <Имя параметра>=<Значение>, где:
//          Имя параметра - имя параметра; 
//          Значение - его значение. 
//  Фрагменты отделяются друг от друга символами ';'.
//  Если значение содержит пробельные символы, то оно должно быть заключено в двойные кавычки (").
// Например:
//  "File=""c:\InfoBases\Trade""; Usr=""Director"";"
//
// Возвращаемое значение:
// Структура параметров. В качестве ключей структуры выступают имена параметров из строки параметров;
// в качестве значений структуры выступают значения параметров.
//
Функция ПолучитьПараметрыИзСтроки(Знач СтрокаПараметров)
	
	Результат = Новый Структура;
	
	СимволДвойныеКавычки = Символ(34); // (")
	
	МассивПодстрок = СтрРазделить(СтрокаПараметров, ";", Ложь);
	
	Для Каждого СтрокаПараметра Из МассивПодстрок Цикл
		
		ПозицияПервогоЗнакаРавенства = СтрНайти(СтрокаПараметра, "=");
		
		// Получаем имя параметра
		ИмяПараметра = СокрЛП(Лев(СтрокаПараметра, ПозицияПервогоЗнакаРавенства - 1));
		
		// Получаем значение параметра
		ЗначениеПараметра = Сред(СтрокаПараметра, ПозицияПервогоЗнакаРавенства + 1);
		
		ЗначениеПараметра = СокрЛП(ЗначениеПараметра);
		
		Если  Лев(ЗначениеПараметра, 1) = СимволДвойныеКавычки
			И Прав(ЗначениеПараметра, 1) = СимволДвойныеКавычки Тогда
			
			ЗначениеПараметра = Сред(ЗначениеПараметра, 2, СтрДлина(ЗначениеПараметра) - 2);
			
		КонецЕсли;
		
		Попытка
			Результат.Вставить(ИмяПараметра, ЗначениеПараметра);
		Исключение
			ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		КонецПопытки;
		
	КонецЦикла;
	
	Возврат Результат;

КонецФункции // ПолучитьПараметрыИзСтроки()

// Извлекает из строки соединения с информационной базой параметры подключения
// и передает параметры в структуру для установки внешнего соединения.
//
// Параметры:
//   СтрокаСоединения    - Строка    - строка соединения с информационной базой
//
// Возвращаемое значение:
//   Структура - параметры подключения к информационной базе
//	   *ТипБазы
//	   *КаталогБазы
//	   *ИмяСервера
//	   *ИмяБазы
//	   *АутентификацияОперационнойСистемы
//	   *ИмяПользователя
//	   *ПарольПользователя
//
Функция ПараметрыПодключенияИзСтрокиСоединенияИБ(Знач СтрокаСоединения) Экспорт

	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ТипБазы"                          , 0);
	СтруктураПараметров.Вставить("Протокол"                         , "tcp");
	СтруктураПараметров.Вставить("КаталогБазы"                      , "");
	СтруктураПараметров.Вставить("СтрокаСоединения_АдресСервера"    , "");
	СтруктураПараметров.Вставить("СтрокаСоединения_ИмяСервера"      , "");
	СтруктураПараметров.Вставить("АдресСервера"                     , "");
	СтруктураПараметров.Вставить("ИмяСервера"                       , "");
	СтруктураПараметров.Вставить("ПортСервера"                      , "");
	СтруктураПараметров.Вставить("ИмяБазы"                          , "");
	СтруктураПараметров.Вставить("АутентификацияОперационнойСистемы", Ложь);
	СтруктураПараметров.Вставить("ИмяПользователя"                  , "");
	СтруктураПараметров.Вставить("ПарольПользователя"               , "");

	Параметры = ПолучитьПараметрыИзСтроки(СтрокаСоединения);

	Параметры.Свойство("File", СтруктураПараметров.КаталогБазы);
	Параметры.Свойство("Srvr", СтруктураПараметров.СтрокаСоединения_АдресСервера);
	Если НЕ ЗначениеЗаполнено(СтруктураПараметров.СтрокаСоединения_АдресСервера) Тогда
		Параметры.Свойство("ws", СтруктураПараметров.СтрокаСоединения_АдресСервера);
	КонецЕсли;
	Параметры.Свойство("Ref" , СтруктураПараметров.ИмяБазы);

	СтруктураПараметров.ТипБазы = ?(Параметры.Свойство("File"),
	                                ТипыБаз().Файловая,
	                                ТипыБаз().Серверная);

    Если СтруктураПараметров.ТипБазы = ТипыБаз().Серверная Тогда
		СтруктураАдреса = СтруктураАдресаСервера(СтруктураПараметров.СтрокаСоединения_АдресСервера);
		
		СтруктураПараметров.СтрокаСоединения_ИмяСервера = СтруктураАдреса.ИсходноеИмя;

		СтруктураПараметров.Протокол     = СтруктураАдреса.Протокол;
		СтруктураПараметров.ИмяСервера   = СтруктураАдреса.Имя;
		СтруктураПараметров.ПортСервера  = СтруктураАдреса.Порт;
		СтруктураПараметров.АдресСервера = СтруктураАдреса.Адрес;
		Если ЗначениеЗаполнено(СтруктураАдреса.ИмяБазы) Тогда
			СтруктураПараметров.ИмяБазы      = СтруктураАдреса.ИмяБазы;
		КонецЕсли;
	КонецЕсли;

	Возврат СтруктураПараметров;

КонецФункции // ПараметрыПодключенияИзСтрокиСоединенияИБ()

// Возвращает возможные типы информационных баз
//
// Параметры:
//   СтрокаСоединения    - Строка    - строка соединения с информационной базой
//
// Возвращаемое значение:
//   Структура                - возможные типы информационных баз
//	   *НеУказан     - Число    - (0) тип не указан
//	   *Серверная    - Число    - (1) серверная ИБ
//	   *Файловая     - Число    - (2) файловая ИБ
//
Функция ТипыБаз() Экспорт
	
	ТипыБаз = Новый Структура();
	ТипыБаз.Вставить("НеУказан" , 0);
	ТипыБаз.Вставить("Серверная", 1);
	ТипыБаз.Вставить("Файловая" , 2);
	
	Возврат Новый ФиксированнаяСтруктура(ТипыБаз);
	
КонецФункции // ТипыБаз()

// Извлекает из строки адреса сервера части адреса
//
// Параметры:
//   Значение                           - Строка    - строка соединения с информационной базой
//   ИсправитьНекорректноеИмяСервера    - Булево    - Истина - если в адресе сервера имя сервера
//                                                    указано как "localhost" или в виде адреса IPv4,
//                                                    то заменяет на имя сервра,
//                                                    полученное методом "ИмяКомпьютера()" на сервере
//
// Возвращаемое значение:
//   Структура                     - параметры подключения к информационной базе
//	   *ИсходныйАдрес    - Строка    - исходный адрес сервера, как он передан в параметре "Значение"
//	   *ИсходноеИмя      - Строка    - исходное имя сервера, как оно было указано в параметре "Значение"
//	   *Протокол         - Строка    - протокол подключения "tcp", "http" или "https"
//	   *Имя              - Строка    - имя сервера
//	   *Порт             - Строка    - порт подключения
//	   *Адрес            - Строка    - полный адрес сервера, с указанием протокола и порта, если требуется
//
Функция СтруктураАдресаСервера(Знач Значение, ИсправитьНекорректноеИмяСервера = Истина)

	Результат = Новый Структура();
    Результат.Вставить("ИсходныйАдрес", Значение);
    Результат.Вставить("ИсходноеИмя"  , "");
    Результат.Вставить("Протокол"     , "tcp");
    Результат.Вставить("Имя"          , "");
    Результат.Вставить("Порт"         , "");
    Результат.Вставить("Адрес"        , "");
    Результат.Вставить("ИмяБазы"      , "");

	Если Лев(Значение, 7) = "http://" Тогда
	    Результат.Протокол = "http";
		Значение = Сред(Значение, 8);
	ИначеЕсли Лев(Значение, 8) = "https://" Тогда
	    Результат.Протокол = "https";
		Значение = Сред(Значение, 9);
	КонецЕсли;

	Если Лев(Результат.Протокол, 4) = "http" Тогда
		СерверИБаза = СтрРазделить(Значение, "/", Ложь);
		Результат.ИмяБазы = ?(СерверИБаза.Количество() > 1, СерверИБаза[1], "");
		Значение = СерверИБаза[0];
	КонецЕсли;

	СерверИПорт = СтрРазделить(Значение, ":", Ложь);
	Результат.ИсходноеИмя = СерверИПорт[0];
	Результат.Имя = СерверИПорт[0];
	Если СерверИПорт.Количество() > 1 Тогда
		Результат.Порт = СерверИПорт[1];
	КонецЕсли;
	
	НекорректноеИмяСервера = (ВРег(Результат.ИсходноеИмя) = "LOCALHOST" ИЛИ ЭтоIPv4Адрес(Результат.ИсходноеИмя));
	Если ИсправитьНекорректноеИмяСервера И НекорректноеИмяСервера Тогда
		Результат.Имя = бир_РасположениеИБВызовСервера.ИмяСервера();
	КонецЕсли;

	Результат.Адрес = Результат.Имя;
	//Если НЕ Результат.Протокол = "tcp" Тогда
	//	Результат.Адрес = СтрШаблон("%1://%2", Результат.Протокол, Результат.Адрес);
	//КонецЕсли;
	Если ЗначениеЗаполнено(Результат.Порт) Тогда 	
		Результат.Адрес = СтрШаблон("%1:%2", Результат.Адрес, Результат.Порт);
	КонецЕсли;

	Возврат Результат;

КонецФункции // СтруктураАдресаСервера()

// Функция - проверяет, что переданная строка соответствует формату адреса IPv4
//
// Параметры:
//   Значение    - Строка    - проверяемая строка
//
// Возвращаемое значение:
//   Булево    - Истина - проверяемое значение соответствует формату адреса IPv4
//
Функция ЭтоIPv4Адрес(Значение) Экспорт
	
	ЧастиАдреса = СтрРазделить(Значение, ".", Ложь);
	
	Если ЧастиАдреса.Количество() = 4 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Для Каждого ТекЧасть Из ЧастиАдреса Цикл
		Если НЕ ОбщегоНазначенияКлиентСервер.ЭтоЧисло(ТекЧасть) Тогда
			Возврат Ложь;
		КонецЕсли;
		ТекЧастьЧислом = Число(ТекЧасть);
		Если ТекЧастьЧислом < 0 ИЛИ ТекЧастьЧислом > 255 Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Истина;

КонецФункции // ЭтоIPv4Адрес()

#КонецОбласти
