#Область ОписаниеПеременных

Перем ПреобразованиеДанных;       // ОбработкаОбъект.бир_ПреобразованиеДанных    - обработка преобразования данных
Перем ОтборДанныхДляСохранения;   // Массив из ЛюбаяСсылка, Структура            - ссылки и отборы регистров сведений для сохранения
Перем ДанныеДляВосстановления;    // Массив

Перем ВыгружатьСвязанныеДанные;
Перем ВыгружатьДвижения;
Перем ВосстанавливатьВТранзакции;
Перем ВыполнятьОбработчикиПриЗаписи;

#КонецОбласти // ОписаниеПеременных

#Область ПрограммныйИнтерфейс

// Функция - возвращает флаг выгрузки связанных данных
//
// Возвращаемое значение:
//   Булево    - Истина - будут выгружены данные связанные с переданными для выгрузки объектами
//
Функция ВыгружатьСвязанныеДанные() Экспорт
	
	Возврат ВыгружатьСвязанныеДанные;
	
КонецФункции // ВыгружатьСвязанныеДанные() 

// Процедура - устанавливает флаг выгрузки связанных данных
//
// Параметры:
//   НовоеЗначение    - Булево    - Истина - будут выгружены данные связанные
//                                  с переданными для выгрузки объектами
//
Процедура УстановитьВыгружатьСвязанныеДанные(Знач НовоеЗначение) Экспорт
	
	ВыгружатьСвязанныеДанные = НовоеЗначение;
	
КонецПроцедуры // УстановитьВыгружатьСвязанныеДанные()

// Функция - возвращает флаг выгрузки движений документов
//
// Возвращаемое значение:
//   Булево    - Истина - будут выгружены движения документов
//
Функция ВыгружатьДвижения() Экспорт
	
	Возврат ВыгружатьДвижения;
	
КонецФункции // ВыгружатьДвижения() 

// Процедура - устанавливает флаг выгрузки движений документов
//
// Параметры:
//   НовоеЗначение    - Булево    - Истина - будут выгружены движения документов
//
Процедура УстановитьВыгружатьДвижения(Знач НовоеЗначение) Экспорт
	
	ВыгружатьДвижения = НовоеЗначение;
	
КонецПроцедуры // УстановитьВыгружатьДвижения()

// Функция - возвращает флаг загрузки данных в транзакции
//
// Возвращаемое значение:
//   Булево    - Истина - загрузка данных будет выполняться в транзакции
//
Функция ВосстанавливатьВТранзакции() Экспорт
	
	Возврат ВосстанавливатьВТранзакции;
	
КонецФункции // ВосстанавливатьВТранзакции() 

// Процедура - устанавливает флаг загрузки данных в транзакции
//
// Параметры:
//   НовоеЗначение    - Булево    - Истина - загрузка данных будет выполняться в транзакции
//
Процедура УстановитьВосстанавливатьВТранзакции(Знач НовоеЗначение) Экспорт
	
	ВосстанавливатьВТранзакции = НовоеЗначение;
	
КонецПроцедуры // УстановитьВосстанавливатьВТранзакции()

// Функция - возвращает флаг выполнения обработчиков при записи загружаемых объектов
//
// Возвращаемое значение:
//   Булево    - Истина - при загрузке объектов будут выполнены обработчики при записи
//                        (ОбменДанными.Загрузка = Ложь) 
//
Функция ВыполнятьОбработчикиПриЗаписи() Экспорт
	
	Возврат ВыполнятьОбработчикиПриЗаписи;
	
КонецФункции // ВыполнятьОбработчикиПриЗаписи() 

// Процедура - устанавливает флаг выполнения обработчиков при записи загружаемых объектов
//
// Параметры:
//   НовоеЗначение    - Булево    - Истина - при загрузке объектов будут выполнены обработчики при записи
//                                  (ОбменДанными.Загрузка = Ложь)
//
Процедура УстановитьВыполнятьОбработчикиПриЗаписи(Знач НовоеЗначение) Экспорт
	
	ВыполнятьОбработчикиПриЗаписи = НовоеЗначение;
	
КонецПроцедуры // УстановитьВыполнятьОбработчикиПриЗаписи()

// Функция - возвращает ссылки и отборы регистров сведений для сохранения
//
// Параметры:
//   ДобавитьСвязанныеДанные    - Булево    - Истина - будут добавлены данные, связанные
//                                            с ссылками из массива "ОтборДанныхДляСохранения"
//
// Возвращаемое значение:
//   Массив Из ЛюбаяСсылка,    - ссылки и отборы регистров сведений
//   Структура
//     *__Тип       - Строка     - строкое описание типа регистра
//                                 (например, РегистрСведенийНаборЗаписей.КурсыВалют)
//     *Отбор       - Структура  - значения измерений регистра для отбора
//                                 (Ключ - имя измерения, Значение - значение измерения)
//
Функция ОтборДанныхДляСохранения(ВключитьСвязанныеДанные = Ложь) Экспорт
	
	Если ВключитьСвязанныеДанные Тогда
		Возврат ОтборДанныхДляСохраненияРасширенный();
	Иначе
		Возврат ОтборДанныхДляСохранения;
	КонецЕсли;
	
КонецФункции // ОтборДанныхДляСохранения() 

// Процедура - устанавливает ссылки и отборы регистров сведений
//
// Параметры:
//   НовыеСсылкиИОтборы    - Массив Из ЛюбаяСсылка    - новый массив объектов для сохранения
//                           Структура
//     *__Тип                - Строка                   - строкое описание типа регистра
//                                                        (например, РегистрСведенийНаборЗаписей.КурсыВалют)
//     *Отбор                - Структура                - значения измерений регистра для отбора
//                                                        (Ключ - имя измерения, Значение - значение измерения)
//
Процедура УстановитьОтборДанныхДляСохранения(Знач НовыеСсылкиИОтборы) Экспорт
	
	ОтборДанныхДляСохранения = Новый Массив();
	ДополнитьОтборДанныхДляСохранения(НовыеСсылкиИОтборы);

КонецПроцедуры // УстановитьОтборДанныхДляСохранения() 

// Процедура - добавляет ссылки и отборы регистров сведений к отбору данных для сохранения
//
// Параметры:
//   ДобавляемыеСсылкиИОтборы    - Массив Из ЛюбаяСсылка, Структура,    - добавляемые объекты для сохранения
//                                 ЛюбаяСсылка, Структура
//     *__Тип                      - Строка                 - строкое описание типа регистра
//                                                            (например, РегистрСведенийНаборЗаписей.КурсыВалют)
//     *Отбор                      - Структура              - значения измерений регистра для отбора
//                                                            (Ключ - имя измерения, Значение - значение измерения)
//
Процедура ДополнитьОтборДанныхДляСохранения(Знач ДобавляемыеСсылкиИОтборы) Экспорт
	
	Если НЕ ТипЗнч(ОтборДанныхДляСохранения) = Тип("Массив") Тогда
		ОтборДанныхДляСохранения = Новый Массив();
	КонецЕсли;
	
	КонтрольныеДанные = Новый Соответствие();
	Для Каждого ТекСсылка Из ОтборДанныхДляСохранения Цикл
		Если ТипЗнч(ТекСсылка) = Тип("Структура") Тогда
			КлючДанных = СтруктураСтрокой(ТекСсылка.Отбор);
		Иначе
			КлючДанных = ТекСсылка;
		КонецЕсли;
		КонтрольныеДанные.Вставить(КлючДанных, Истина);
	КонецЦикла;
	
	ДобавляемыеЗначения = ДобавляемыеСсылкиИОтборы;
	Если НЕ ТипЗнч(ДобавляемыеЗначения) = Тип("Массив") Тогда
		ДобавляемыеЗначения = Новый Массив();
		ДобавляемыеЗначения.Добавить(ДобавляемыеСсылкиИОтборы);
	КонецЕсли;
	
	Для Каждого ТекЗначение Из ДобавляемыеЗначения Цикл
		Если ТипЗнч(ТекЗначение) = Тип("Структура") Тогда
			КлючДанных = СтруктураСтрокой(ТекЗначение.Отбор);
		Иначе
			КлючДанных = ТекЗначение;
		КонецЕсли;
		Если КонтрольныеДанные.Получить(КлючДанных) = Неопределено Тогда
			ОтборДанныхДляСохранения.Добавить(ТекЗначение);
			КонтрольныеДанные.Вставить(КлючДанных, Истина);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры // ДополнитьОтборДанныхДляСохранения() 

// Функция - возвращает таблицу соответствия объектов для восстановления (загрузки)
// объектам информационной базы с указанием статуса изменения (см. СтатусыИзменений())
// (ссылочные объекты или наборы записей независимых регистров сведений)
//
// Возвращаемое значение:
//   Массив Из Структура    - массив соответствий объектов со статусами изменения
//                            (см. НоваяСтрокаДанныхДляВосстановления()) 
//
Функция ДанныеДляВосстановления() Экспорт
	
	Возврат ДанныеДляВосстановления;
	
КонецФункции // ДанныеДляВосстановления() 

// Процедура - формирует и устанавливает таблицу соответствия объектов для восстановления (загрузки)
// объектам информационной базы с указанием статуса изменения (см. СтатусыИзменений())
// (ссылочные объекты или наборы записей независимых регистров сведений)
//
// Параметры:
//   АдресИлиДанные    - Строка, Массив Из Структура    - данные для восстановления, возможны варианты
//                                                        - адрес временного хранилища с данными для восстановления
//                                                        - данные сериализованные в формат JSON
//                                                        - данные сериализованные в структуры и массивы
//                                                        - таблица соответствия объектов для восстановления
//                                                          или строка таблицы соответствия
//                                                          (см. НоваяСтрокаДанныхДляВосстановления())
//                                                          объектам информационной базы с указанием статуса изменения
//                                                          (см. СтатусыИзменений())
//   ТолькоИзмененные  - Булево                         - будут добавлены только данные, которые были изменены
//                                                        относительно данных в информационной базе
//
Процедура УстановитьДанныеДляВосстановления(Знач АдресИлиДанные, ТолькоИзмененные = Ложь) Экспорт
	
	ДанныеДляВосстановления = Новый Массив();
	
	Если ТипЗнч(АдресИлиДанные) = Тип("Строка")
	   И Лев(АдресИлиДанные, 18) = "e1cib/tempstorage/" Тогда
		
		АдресИлиДанные = ПолучитьИзВременногоХранилища(АдресИлиДанные);
		
	КонецЕсли;
	
	Если ТипЗнч(АдресИлиДанные) = Тип("Строка")
	   И (Лев(АдресИлиДанные, 1) = "{" ИЛИ Лев(АдресИлиДанные, 1) = "[") Тогда
		
		Данные = ПреобразованиеДанных().ПрочитатьОписаниеОбъектаИзJSON(АдресИлиДанные);
		
	ИначеЕсли ТипЗнч(АдресИлиДанные) = Тип("Структура")
	      ИЛИ (ТипЗнч(АдресИлиДанные) = Тип("Массив")
	         И ТипЗнч(АдресИлиДанные[0]) = Тип("Структура")) Тогда
		
		Данные = АдресИлиДанные;
		
	Иначе 
		ТекстОшибки = СтрШаблон("Неизвестный тип данных для восстановления ""%1"",
		                        |ожидается ""Строка (JSON)"", ""Строка (Адрес)"", ""Массив"" или ""Структура""",
		                        ТипЗнч(АдресИлиДанные));
		ЗаписьЖурналаРегистрации("Восстановление данных.Чтение данных",
		                         УровеньЖурналаРегистрации.Ошибка,
		                         Метаданные.Обработки.бир_СохранениеВосстановлениеДанных,
		                         СокрЛП(АдресИлиДанные),
		                         ТекстОшибки);
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	
	ДобавитьДанныеДляВосстановления(Данные, ТолькоИзмененные);
	
КонецПроцедуры // УстановитьДанныеДляВосстановления() 

// Процедура - дополняет таблицу соответствия объектов для восстановления (загрузки)
// объектам информационной базы переданными данными для восстановления
// (ссылочные объекты или наборы записей независимых регистров сведений)
//
// Параметры:
//   ДобавляемыеДанныеДляВосстановления    - Массив Из Структура    - данные для восстановления, возможны варианты:
//                                                                  - данные сериализованные в структуры и массивы
//                                                                  - таблица соответствия объектов для восстановления
//                                                                    или строка таблицы соответствия
//                                                                    (см. НоваяСтрокаДанныхДляВосстановления())
//                                                                    объектам информационной базы с указанием статуса изменения
//                                                                    (см. СтатусыИзменений())
//   ТолькоИзмененные  - Булево                                     - будут добавлены только данные, которые были изменены
//                                                                    относительно данных в информационной базе
//
Процедура ДобавитьДанныеДляВосстановления(Знач ДобавляемыеДанныеДляВосстановления, ТолькоИзмененные = Ложь) Экспорт
	
	Если НЕ ТипЗнч(ДанныеДляВосстановления) = Тип("Массив") Тогда
		ДанныеДляВосстановления = Новый Массив();
	КонецЕсли;
	
	Данные = ДобавляемыеДанныеДляВосстановления;
	Если НЕ ТипЗнч(ДобавляемыеДанныеДляВосстановления) = Тип("Массив") Тогда
		Данные = Новый Массив();
		Данные.Вставить(ДобавляемыеДанныеДляВосстановления);
	КонецЕсли;
	
	Если Данные.Количество() = 0 ИЛИ НЕ ТипЗнч(Данные[0]) = Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	ОтборыНеУдаляемых = Новый Соответствие();
	
	Для Каждого ТекДанные Из Данные Цикл
		Если ТекДанные.Свойство("__Тип") Тогда
			ДобавитьСтрокуДанныхДляВосстановления(ТекДанные, ОтборыНеУдаляемых, ТолькоИзмененные);
		ИначеЕсли ТекДанные.Свойство("ЗагружаемыеДанные") Тогда
			ДанныеДляВосстановления.Добавить(ТекДанные);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого ТекРегистр Из ОтборыНеУдаляемых Цикл
		ДобавитьУдаляемыеДанные(ТекРегистр.Ключ, ТекРегистр.Значение.РеквизитВладелец, ТекРегистр.Значение.Отбор);
	КонецЦикла;
	
КонецПроцедуры // ДобавитьДанныеДляВосстановления() 

// Функция - возвращает сериализованные в структуры и массивы данные информационной базы
// (ссылочные объекты и наборы записей независимых регистров сведений),
// исходя из заданного отбора данных для сохранения (см. ОтборДанныхДляСохранения()),
// при установленном флаге "ВыгружатьСвязанныеДанные" данные будут дополнены связанными данными
// (см. ОтборДанныхДляСохраненияРасширеный())
//
// Возвращаемое значение:
//   Массив Из Структура    - данные информационной базы, сериализованные в Структуры и Массивы
//
Функция ДанныеДляСохранения() Экспорт
	
	ВсеОбъектыДляСохранения = ОтборДанныхДляСохранения(ВыгружатьСвязанныеДанные);
	
	ДанныеДляСохранения = Новый Массив();
	
	Для Каждого ТекСсылка Из ВсеОбъектыДляСохранения Цикл
		
		Если ТипЗнч(ТекСсылка) = Тип("Структура") Тогда
			СтруктураОбъекта = ДанныеРегистраДляСохранения(ТекСсылка);
		ИначеЕсли ТипЗнч(ТекСсылка) = Тип("УдалениеОбъекта") Тогда
			СтруктураОбъекта = ПреобразованиеДанных().УдалениеОбъектаВСтруктуру(ТекСсылка);
		Иначе
			СтруктураОбъекта = ДанныеПоСсылкеДляСохранения(ТекСсылка);
		КонецЕсли;
		
		Если СтруктураОбъекта = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ДанныеДляСохранения.Добавить(СтруктураОбъекта);
	КонецЦикла;
	
	Возврат ДанныеДляСохранения;
	
КонецФункции // ДанныеДляСохранения() 

// Функция - возвращает сериализованые в формат JSON данные информационной базы
// (ссылочные объекты и наборы записей независимых регистров сведений),
// исходя из заданного отбора данных для сохранения (см. ОтборДанныхДляСохранения()),
// при установленном флаге "ВыгружатьСвязанныеДанные" данные будут дополнены связанными данными
// (см. ОтборДанныхДляСохраненияРасширеный())
//
// Возвращаемое значение:
//   Строка    - данные информационной базы, сериализованные в формат JSON
//
Функция ДанныеДляСохраненияJSON() Экспорт
	
	ДанныеДляСохранения = ДанныеДляСохранения();
	
	Возврат ПреобразованиеДанных().ЗаписатьОписаниеОбъектаВJSON(ДанныеДляСохранения);

КонецФункции // ДанныеДляСохраненияJSON() 

// Процедура - восстанавливает данные из массива данных для восстановления (см. ДанныеДляВосстановления())
// в зависимости от настройки, восстановление выполняется в транзакции или нет (см. ВосстанавливатьВТранзакции())
//
Процедура ВосстановитьДанные() Экспорт
	
	Если ВосстанавливатьВТранзакции Тогда
		НачатьТранзакцию();
		
		Попытка
			ВыполнитьВосстановлениеДанных();
			ЗафиксироватьТранзакцию();
		Исключение
			Если ТранзакцияАктивна() Тогда
				ОтменитьТранзакцию();
			КонецЕсли;
			ВызватьИсключение;
		КонецПопытки;
	Иначе
		ВыполнитьВосстановлениеДанных();
	КонецЕсли;
	
КонецПроцедуры // ВосстановитьДанные()

// Функция - подготавливает данные для сравнения
// 
// Параметры:
//   Данные                - Структура       - подготовленные данные для сравнения
//     *ТипДанных            - Строка          - тип данных строкой
//                                               (например: СправочникОбъект.Номенклатура)
//     *ДанныеВБазе          - ЛюбаяСсылка,    - ссылка на данные в базе или отбор регистра сведений
//                             Структура
//     *ЗагружаемыеДанные    - Структура       - структура загружаемых данных
//
// 
// Возвращаемое значение:
//   Структура                           - подготовленные данные для сравнения
//     *ТипДанных            - Строка      - тип данных строкой
//                                           (например: СправочникОбъект.Номенклатура)
//     *ДанныеВБазе          - Строка      - данные из базы, преобразованные в формат JSON
//     *ЗагружаемыеДанные    - Строка      - загружаемые данные, преобразованные в формат JSON
//
Функция ПодготовитьДанныеДляСравнения(Данные) Экспорт
	
	Если Лев(Данные.ТипДанных, 28) = "РегистрСведенийНаборЗаписей." Тогда
		ИмяРегистра = Сред(Данные.ТипДанных, 29);
		НаборЗаписей = РегистрыСведений[ИмяРегистра].СоздатьНаборзаписей();
		Для Каждого ТекЭлемент Из Данные.ДанныеВБазе.Отбор Цикл
			НаборЗаписей.Отбор[ТекЭлемент.Ключ].Установить(ТекЭлемент.Значение);
		КонецЦикла;
		НаборЗаписей.Прочитать();
		
		ДанныеВБазе = ПреобразованиеДанных().ЗначениеВСтруктуру(НаборЗаписей);
	Иначе
		ДанныеВБазе = Данные.ДанныеВБазе.ПолучитьОбъект();
		ДанныеВБазе = ПреобразованиеДанных().ЗначениеВСтруктуру(ДанныеВБазе);
	КонецЕсли;
	
	ЗагружаемыеДанные = Данные.ЗагружаемыеДанные;
	Если ТипЗнч(ЗагружаемыеДанные) = Тип("Структура") И ЗагружаемыеДанные.Свойство("__Владелец") Тогда
		ЗагружаемыеДанные.Удалить("__Владелец");
	КонецЕсли;
	
	ДанныеВБазе       = ПреобразованиеДанных().ЗаписатьОписаниеОбъектаВJSON(ДанныеВБазе);
	ЗагружаемыеДанные = ПреобразованиеДанных().ЗаписатьОписаниеОбъектаВJSON(ЗагружаемыеДанные);
	
	ДанныеДляСравнения = Новый Структура();
	ДанныеДляСравнения.Вставить("ТипДанных"        , Данные.ТипДанных);
	ДанныеДляСравнения.Вставить("ДанныеВБазе"      , ДанныеВБазе);
	ДанныеДляСравнения.Вставить("ЗагружаемыеДанные", ЗагружаемыеДанные);
	
	Возврат ДанныеДляСравнения;
	
КонецФункции // ПодготовитьДанныеДляСравнения()

#КонецОбласти // ПрограммныйИнтерфейс

#Область СлужебныйПрограммныйИнтерфейс

// Функция - получает обработку преобразования данных
// 
// Возвращаемое значение:
//   ОбработкаОбъект.бир_ПреобразованиеДанных    - обработка преобразования данных
//
Функция ПреобразованиеДанных() Экспорт
	
	Если ПреобразованиеДанных = Неопределено Тогда
		ПреобразованиеДанных = Обработки.бир_ПреобразованиеДанных.Создать();
	КонецЕсли;
	
	Возврат ПреобразованиеДанных; 
	
КонецФункции // ПреобразованиеДанных()

#КонецОбласти // СлужебныйПрограммныйИнтерфейс

#Область СлужебныеПроцедурыИФункции

// Функция - возвращает ссылки и отборы регистров сведений для сохранения,
// дополненный связанными данными, полученными при вызове метода ДополнительныеДанныеДляСохранения()
// модулей менеджера сохраняемых объектов или общего модуля бир_СохранениеВосстановлениеДанныхПереопределяемый
//
// Возвращаемое значение:
//   Массив Из ЛюбаяСсылка    - ссылки и отборы регистров сведений
//   Структура
//     *__Тип      - Строка     - строкое описание типа регистра
//                                (например, РегистрСведенийНаборЗаписей.КурсыВалют)
//     *Отбор      - Структура  - значения измерений регистра для отбора
//                                (Ключ - имя измерения, Значение - значение измерения)
//
//
Функция ОтборДанныхДляСохраненияРасширенный()
	
	МенеджерыОбъектов = МенеджерыОбъектов(ОтборДанныхДляСохранения);
	
	ОтборДанныхДляСохраненияРасширенный = Новый Массив();
	
	Для Каждого ТекСсылка Из ОтборДанныхДляСохранения Цикл
		
		ОтборДанныхДляСохраненияРасширенный.Добавить(ТекСсылка);
		
		Если ТипЗнч(ТекСсылка) = Тип("Структура") Тогда
			Продолжить;
		КонецЕсли;
		
		Менеджер = МенеджерыОбъектов.Получить(ТипЗнч(ТекСсылка));
		
		Попытка
			ДополнительныеДанные = Менеджер.ДополнительныеДанныеДляСохранения(ТекСсылка);
		Исключение
			ДополнительныеДанные = Новый Массив();
		КонецПопытки;
		
		ДобавитьУникальныеДанные(ОтборДанныхДляСохраненияРасширенный, ДополнительныеДанные);
		
		ИмяПереопределяемогоМодуля = "бир_СохранениеВосстановлениеДанныхПереопределяемый";
		
		Если Метаданные.ОбщиеМодули.Найти(ИмяПереопределяемогоМодуля) <> Неопределено Тогда
			УстановитьБезопасныйРежим(Истина);
			ПереопределяемыйМодуль = Вычислить(ИмяПереопределяемогоМодуля);
			
			ДополнительныеДанные = ПереопределяемыйМодуль.ДополнительныеДанныеДляСохранения(ТекСсылка);
			
			ДобавитьУникальныеДанные(ОтборДанныхДляСохраненияРасширенный, ДополнительныеДанные);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ОтборДанныхДляСохраненияРасширенный;
	
КонецФункции // ОтборДанныхДляСохраненияРасширенный()

// Функция - получает объект по ссылке, преобразует в структуру и возвращает результат
// 
// Параметры:
//   Ссылка    - ЛюбаяСсылка    - ссылка на объект
//
// Возвращаемое значение:
//   Структура    - структура объекта
//
Функция ДанныеПоСсылкеДляСохранения(Знач Ссылка)
	
	ТекОбъект = Неопределено;
	Попытка
		ТекОбъект = Ссылка.ПолучитьОбъект();
	Исключение
		ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ТекстОшибки = СтрШаблон("Ошибка сохранения объекта ""%1"":%2%3",
		                        Ссылка,
		                        Символы.ПС,
		                        ТекстОшибки);
		ЗаписьЖурналаРегистрации("Сохранение данных.Получение объекта",
		                         УровеньЖурналаРегистрации.Ошибка,
		                         Метаданные.Обработки.бир_СохранениеВосстановлениеДанных,
		                         Ссылка,
		                         ТекстОшибки);
	КонецПопытки;

	Если ТекОбъект = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;

	МетаОбъект = Ссылка.Метаданные();
	Если НЕ (Метаданные.Документы.Найти(МетаОбъект.Имя) = Неопределено ИЛИ ВыгружатьДвижения) Тогда
		СтруктураОбъекта = ПреобразованиеДанных().ДокументВСтруктуру(ТекОбъект, , "Движения");
	Иначе
		СтруктураОбъекта = ПреобразованиеДанных().ЗначениеВСтруктуру(ТекОбъект);
	КонецЕсли;	

	Возврат СтруктураОбъекта;
	
КонецФункции // ДанныеПоСсылкеДляСохранения() 

// Функция - получает набор записей регистра сведений, преобразует в структуру и возвращает результат
// 
// Параметры:
//   ОтборРегистра    - Структура    - значения полей отбора набора записей регистра
//     *__Тип           - Строка       - тип набора записей регистра
//                                       (например: РегистрСведенийНаборЗаписей.КурсыВалют)
//     *Ключ            - Строка       - имя поля отбора
//     *Значение        - Строка       - значение поля отбора
//
// Возвращаемое значение:
//   Структура                             - структура набора записей регистра сведений
//     *__Тип       - Строка                 - тип набора записей регистра
//                                             (например: РегистрСведенийНаборЗаписей.КурсыВалют)
//     *Отбор       - Структура              - отбор набора записей
//     *Записи      - Массив Из Структура    - записи регистра
//
Функция ДанныеРегистраДляСохранения(Знач ОтборРегистра)
	
	Если НЕ ТипЗнч(ОтборРегистра) = Тип("Структура") Тогда
		Возврат Неопределено;
	КонецЕсли;

	Если НЕ (ОтборРегистра.Свойство("__Тип") И Лев(ОтборРегистра.__Тип, 28) = "РегистрСведенийНаборЗаписей.") Тогда
		Возврат Неопределено;
	КонецЕсли;

	НаборЗаписей = РегистрыСведений[Сред(ОтборРегистра.__Тип, 29)].СоздатьНаборЗаписей();
	Для Каждого ТекСвойство Из ОтборРегистра.Отбор Цикл
		НаборЗаписей.Отбор[ТекСвойство.Ключ].Установить(ТекСвойство.Значение);
	КонецЦикла;
	НаборЗаписей.Прочитать();
	
	СтруктураОбъекта = ПреобразованиеДанных().НаборЗаписейРегистраСведенийВСтруктуру(НаборЗаписей);

	Если ОтборРегистра.Свойство("__Владелец") Тогда
		СтруктураОбъекта.Вставить("__Владелец", ОтборРегистра.__Владелец);
	КонецЕсли;
	
	Возврат СтруктураОбъекта;
	
КонецФункции // ДанныеРегистраДляСохранения() 

// Процедура - формирует и добавляет строку таблицы соответствия объектов для восстановления
// (см. НоваяСтрокаДанныхДляВосстановления())
// объектам информационной базы с указанием статуса изменения (см. СтатусыИзменений())
// 
// Параметры:
//   ЗагружаемыеДанные    - Структура, Массив из Структура   - загружаемые данные в виде массивов и структур
//   ОтборыНеУдаляемых    - Соответствие                     - отборы данных, которые не должны попасть в таблицу
//   ТолькоИзмененные     - Булево                           - Истина - в таблицу будут добавлены только те загружаемые данные
//                                                             в которые имеют изменения по сравнению с соответствующими данными в базе
//     
Процедура ДобавитьСтрокуДанныхДляВосстановления(ЗагружаемыеДанные, ОтборыНеУдаляемых, ТолькоИзмененные = Ложь)
	
	Если НЕ ТипЗнч(ОтборыНеУдаляемых) = Тип("Соответствие") Тогда
		ОтборыНеУдаляемых = Новый Соответствие();
	КонецЕсли;
	
	НоваяСтрока = НоваяСтрокаДанныхДляВосстановления();
	НоваяСтрока.ЗагружаемыеДанные = ЗагружаемыеДанные;
	НоваяСтрока.Статус            = СтатусыИзменений().Нет;
	
	Если ЗагружаемыеДанные.__Тип = "УдалениеОбъекта" Тогда
		НоваяСтрока.ТипДанных = ЗагружаемыеДанные.Ссылка.__Тип;
		ЗагружаемыеДанныеПредставление = "Удалить";
		
		НоваяСтрока.ДанныеВБазе = ПреобразованиеДанных().НайтиЗначениеПоОписанию(ЗагружаемыеДанные.Ссылка);
		НоваяСтрока.ДанныеВБазеПредставление = СокрЛП(НоваяСтрока.ДанныеВБазе);
		
		НоваяСтрока.Статус = СтатусыИзменений().Удален;
	ИначеЕсли Лев(ЗагружаемыеДанные.__Тип, 28) = "РегистрСведенийНаборЗаписей." Тогда
		
		НоваяСтрока = СтрокаДанныхНабораЗаписей(ЗагружаемыеДанные, ОтборыНеУдаляемых);
		
		Если НоваяСтрока = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
	Иначе
		НоваяСтрока.ТипДанных = ЗагружаемыеДанные.__Тип;
		НоваяСтрока.ЗагружаемыеДанныеПредставление = ЗагружаемыеДанные.Ссылка.Представление;
		НоваяСтрока.ДанныеВБазе = ПреобразованиеДанных().НайтиЗначениеПоОписанию(ЗагружаемыеДанные.Ссылка);
		Если ЗначениеЗаполнено(НоваяСтрока.ДанныеВБазе) Тогда
			НоваяСтрока.ДанныеВБазеПредставление = СокрЛП(НоваяСтрока.ДанныеВБазе);
		Иначе
			НоваяСтрока.Статус = СтатусыИзменений().Новый;
			НоваяСтрока.ДанныеВБазеПредставление = "Новый";
		КонецЕсли;
	КонецЕсли;
		
	ПроверитьИзмененияУстановитьСтатус(НоваяСтрока);
	
	Если ТолькоИзмененные И НоваяСтрока.Статус = СтатусыИзменений().Нет Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеДляВосстановления.Добавить(НоваяСтрока);
	
КонецПроцедуры // ДобавитьСтрокуДанныхДляВосстановления() 

// Функция - формирует и возвращает строку таблицы соответствия объектов для восстановления
// для загружаемого набора записей независимого регистра сведений
//
// Параметры:
//   ЗагружаемыеДанные    - Структура       - загружаемые данные в виде массивов и структур
//   ОтборыНеУдаляемых    - Соответствие    - (возвр.) отборы данных, которые не должны попасть в таблицу
//                                            как удаляемые данные
//
Функция СтрокаДанныхНабораЗаписей(ЗагружаемыеДанные, ОтборыНеУдаляемых)
	
	Если НЕ ТипЗнч(ОтборыНеУдаляемых) = Тип("Соответствие") Тогда
		ОтборыНеУдаляемых = новый Соответствие();
	КонецЕсли;
	
	КоличествоЗагружаемыхЗаписей = ЗагружаемыеДанные.Записи.Количество();
	ЕстьРеквизитВладелец = ЗагружаемыеДанные.Свойство("__Владелец");
	
	СтрокаДанных = НоваяСтрокаДанныхДляВосстановления();
	СтрокаДанных.ЗагружаемыеДанные = ЗагружаемыеДанные;
	СтрокаДанных.Статус            = СтатусыИзменений().Нет;
	
	СтрокаДанных.ТипДанных = ЗагружаемыеДанные.__Тип;
	ИмяРегистра = Сред(СтрокаДанных.ТипДанных, 29);
	
	СтрокаДанных.ДанныеВБазе = Новый Структура();
	СтрокаДанных.ДанныеВБазе.Вставить("__Тип", СтрокаДанных.ТипДанных);
	СтрокаДанных.ДанныеВБазе.Вставить("Отбор", Новый Структура());
	
	Если ЕстьРеквизитВладелец Тогда
		ОтборНеУдаляемых = ОтборыНеУдаляемых.Получить(СтрШаблон("РегистрСведений.%1", ИмяРегистра));
		Если ОтборНеУдаляемых = Неопределено Тогда
			ОтборНеУдаляемых = Новый Структура();
			ОтборНеУдаляемых.Вставить("РеквизитВладелец", ЗагружаемыеДанные.__Владелец);
			ОтборНеУдаляемых.Вставить("Отбор"           , Новый ТаблицаЗначений());
			
			Для Каждого ТекСвойство Из ЗагружаемыеДанные.Отбор Цикл
				Если ТипЗнч(ТекСвойство.Значение) = Тип("Структура") И ТекСвойство.Значение.Свойство("__Тип") Тогда
					ТипКолонки = Новый ОписаниеТипов(ТекСвойство.Значение.__Тип);
				Иначе
					ТипКолонки = Новый Массив();
					ТипКолонки.Добавить(ТипЗнч(ТекСвойство.Значение));
					ТипКолонки = Новый ОписаниеТипов(ТипКолонки);
				КонецЕсли;
				ОтборНеУдаляемых.Отбор.Колонки.Добавить(ТекСвойство.Ключ, ТипКолонки);
			КонецЦикла;
		КонецЕсли;
		СтрокаОтбораНеУдаляемых = ОтборНеУдаляемых.Отбор.Добавить();
	КонецЕсли;
	
	ПредставлениеОтбора = Новый Массив();
	НаборЗаписей = РегистрыСведений[ИмяРегистра].СоздатьНаборЗаписей();
	Для Каждого ТекСвойство Из ЗагружаемыеДанные.Отбор Цикл
		ЗначениеОтбора = ПреобразованиеДанных().ЗначениеИзСтруктуры(ТекСвойство.Значение);
		НаборЗаписей.Отбор[ТекСвойство.Ключ].Установить(ЗначениеОтбора);
		ПредставлениеОтбора.Добавить(СтрШаблон("%1 = %2", ТекСвойство.Ключ, ЗначениеОтбора));
		СтрокаДанных.ДанныеВБазе.Отбор.Вставить(ТекСвойство.Ключ, ЗначениеОтбора);
		Если ЕстьРеквизитВладелец Тогда
			СтрокаОтбораНеУдаляемых[ТекСвойство.Ключ] = ЗначениеОтбора;
		КонецЕсли;
	КонецЦикла;
	НаборЗаписей.Прочитать();
	
	Если ЕстьРеквизитВладелец Тогда
		ОтборыНеУдаляемых.Вставить(СтрШаблон("РегистрСведений.%1", ИмяРегистра), ОтборНеУдаляемых);
		ОтборНеУдаляемых = Неопределено;
	КонецЕсли;
	
	Если НаборЗаписей.Количество() = 0 И КоличествоЗагружаемыхЗаписей = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если КоличествоЗагружаемыхЗаписей = 0 Тогда
		СтрокаДанных.ЗагружаемыеДанныеПредставление = "Удалить";
		СтрокаДанных.Статус = СтатусыИзменений().Удален;
	Иначе
		СтрокаДанных.ЗагружаемыеДанныеПредставление = СтрШаблон("%1 (%2)",
		                                                        СтрСоединить(ПредставлениеОтбора, ", "),
		                                                        КоличествоЗагружаемыхЗаписей);
	КонецЕсли;
	
	Если НаборЗаписей.Количество() = 0 Тогда
		СтрокаДанных.Статус = СтатусыИзменений().Новый;
		СтрокаДанных.ДанныеВБазеПредставление = "Новый";
	Иначе
		СтрокаДанных.ДанныеВБазеПредставление = СтрШаблон("%1 (%2)",
		                                                  СтрСоединить(ПредставлениеОтбора, ", "),
		                                                  НаборЗаписей.Количество());
	КонецЕсли;
	
	Возврат СтрокаДанных;
	
КонецФункции // СтрокаДанныхНабораЗаписей()

// Процедура - дополняет таблицу соответствия объектов для восстановления (загрузки)
// объектам информационной базы строками для удаления объектов 
// (ссылочные объекты или наборы записей независимых регистров сведений)
//
// Например:
//   Загружается элемент справочника "Контрагенты" - "Наш контрагент"
//   и связанные с ним по значению измерения "Объект" записи регистра сведений "Версии объектов".
//   В данных для загрузки есть только запись регистра со значением 1 в измерении "НомерВерсии"
//   в таком случае записи с набором значений измерений "Объект = 'Наш контрагент'; "НомерВерсии = 1"
//   не будут добавлены как удаляемые, а все остальные записи со значением "Объект = 'Наш контрагент'"
//   будут добавлены как удаляемые.
//
// Параметры:
//   ТаблицаДанных       - Строка             - полное имя объекта метаданных,
//                                              данные которого будут добавлены как удаляемые
//                                              (например: РегистрСведений.ВерсииОбъектов)
//   РеквизитВладелец    - Строка             - имя реквизита объекта-владельца удаляемых данных
//                                              (например: "Объект") 
//   ОтборНеУдаляемых    - ТаблицаЗначений    - таблица наборов значений значений реквизитов отбора,
//                                              объекты/записи с такими наборами значений реквизитов отбора
//                                              не будут добавлены как удаляемые
//                                              (например: "Объект = 'Наш контрагент'; "НомерВерсии = 1")
//
Процедура ДобавитьУдаляемыеДанные(ТаблицаДанных, РеквизитВладелец, ОтборНеУдаляемых)
	
	ТипОбъекта = Лев(ТаблицаДанных, СтрНайти(ТаблицаДанных, ".") - 1);
	ИмяОбъекта = Сред(ТаблицаДанных, СтрДлина(ТипОбъекта) + 2);
	
	Если ТипОбъекта = "РегистрСведений" Тогда
		ТипДанных = СтрШаблон("РегистрСведенийНаборЗаписей.%1", ИмяОбъекта);
	Иначе
		ТипДанных = СтрШаблон("%1Объект.%2", ТипОбъекта, ИмяОбъекта);
	КонецЕсли;
	
	ТекстЗапроса = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	__Реквизиты__
	               |ПОМЕСТИТЬ ВТОтборНеУдаляемых
	               |ИЗ
	               |	&ОтборНеУдаляемых КАК ТаблицаДанных
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	__Реквизиты__
	               |ИЗ
	               |	__ТаблицаДанных__ КАК ТаблицаДанных
	               |ГДЕ
	               |	ТаблицаДанных.__РеквизитВладелец__ В
	               |			(ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |				ТаблицаДанных.__РеквизитВладелец__ КАК __РеквизитВладелец__
	               |			ИЗ
	               |				ВТОтборНеУдаляемых КАК ТаблицаДанных)
	               |	И НЕ (__РеквизитыОтбора__) В
	               |				(ВЫБРАТЬ
	               |					__Реквизиты__
	               |				ИЗ
	               |					ВТОтборНеУдаляемых КАК ТаблицаДанных)";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "__ТаблицаДанных__", ТаблицаДанных);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "__РеквизитВладелец__", РеквизитВладелец);
	
	Реквизиты = Новый Массив();
	РеквизитыОтбора = Новый Массив();
	Для Каждого ТекКолонка Из ОтборНеУдаляемых.Колонки Цикл
		Реквизиты.Добавить(СтрШаблон("ТаблицаДанных.%1 КАК %1", ТекКолонка.Имя));
		РеквизитыОтбора.Добавить(СтрШаблон("ТаблицаДанных.%1", ТекКолонка.Имя));
	КонецЦикла;
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "__Реквизиты__", СтрСоединить(Реквизиты, "," + Символы.ПС + Символы.Таб));
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "__РеквизитыОтбора__", СтрСоединить(РеквизитыОтбора, ", "));
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("ОтборНеУдаляемых", ОтборНеУдаляемых);
	
	Результат = Запрос.Выполнить();
	
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НоваяСтрока = НоваяСтрокаДанныхДляВосстановления();
		
		НоваяСтрока.ДанныеВБазе = Новый Структура();
		НоваяСтрока.ДанныеВБазе.Вставить("__Тип", ТипДанных);
		НоваяСтрока.ДанныеВБазе.Вставить("Отбор", Новый Структура());
		
		НоваяСтрока.ЗагружаемыеДанные = Новый Структура();
		НоваяСтрока.ЗагружаемыеДанные.Вставить("__Тип",  ТипДанных);
		НоваяСтрока.ЗагружаемыеДанные.Вставить("Отбор",  Новый Структура());
		НоваяСтрока.ЗагружаемыеДанные.Вставить("Записи", Новый Массив());
		
		ПредставлениеОтбора = Новый Массив();
		НаборЗаписей = РегистрыСведений[ИмяОбъекта].СоздатьНаборЗаписей();
		Для Каждого ТекКолонка Из Результат.Колонки Цикл
			ЗначениеОтбора = Выборка[ТекКолонка.Имя];
			НаборЗаписей.Отбор[ТекКолонка.Имя].Установить(ЗначениеОтбора);
			ПредставлениеОтбора.Добавить(СтрШаблон("%1 = %2", ТекКолонка.Имя, ЗначениеОтбора));
			НоваяСтрока.ДанныеВБазе.Отбор.Вставить(ТекКолонка.Имя, ЗначениеОтбора);
			НоваяСтрока.ЗагружаемыеДанные.Отбор.Вставить(ТекКолонка.Имя, ЗначениеОтбора);
		КонецЦикла;
		НаборЗаписей.Прочитать();
		
		НоваяСтрока.ЗагружаемыеДанныеПредставление = "Удалить";
		НоваяСтрока.ДанныеВБазеПредставление       = СтрШаблон("%1 (%2)",
		                                                       СтрСоединить(ПредставлениеОтбора, ", "),
		                                                       НаборЗаписей.Количество());
		НоваяСтрока.ТипДанных                      = ТипДанных;
		НоваяСтрока.Статус                         = СтатусыИзменений().Удален;
		
		ДанныеДляВосстановления.Добавить(НоваяСтрока);
	КонецЦикла;
	
КонецПроцедуры // ДобавитьУдаляемыеДанные()

// Процедура - восстанавливает данные из массива данных для восстановления (см. ДанныеДляВосстановления())
//
Процедура ВыполнитьВосстановлениеДанных()
	
	Для Каждого ТекСтрокаДанных Из ДанныеДляВосстановления Цикл
		
		ДанныеОбъект = Неопределено;
		
		Действие = "записать";
		ВидДанных = "объект";
		Представление = ТекСтрокаДанных.ЗагружаемыеДанныеПредставление;
		Если Лев(ТекСтрокаДанных.ТипДанных, 28) = "РегистрСведенийНаборЗаписей." Тогда
			Действие = ?(ТекСтрокаДанных.ЗагружаемыеДанные.Записи.Количество() = 0, "очистить", "записать");
			ВидДанных = "набор записей";
			ДанныеДляЖурнала = Представление;
			ДанныеОбъект = ПреобразованиеДанных().СоздатьНаборЗаписейРегистраИзСтруктуры(ТекСтрокаДанных.ЗагружаемыеДанные);
		ИначеЕсли ТекСтрокаДанных.Статус = СтатусыИзменений().Удален Тогда
			Действие = "удалить";
			Представление = ТекСтрокаДанных.ДанныеВБазеПредставление;
			ДанныеОбъект = ПреобразованиеДанных().УдалениеОбъектаИзСтруктуры(ТекСтрокаДанных.ЗагружаемыеДанные);
			ДанныеДляЖурнала = ДанныеОбъект.Ссылка;
		ИначеЕсли ТекСтрокаДанных.Статус = СтатусыИзменений().Новый Тогда
			ДанныеОбъект = ПреобразованиеДанных().СоздатьОбъектИзСтруктуры(ТекСтрокаДанных.ЗагружаемыеДанные, Истина);
			ДанныеДляЖурнала = ДанныеОбъект.Ссылка;
		Иначе
			ДанныеОбъект = ПреобразованиеДанных().НайтиЗаполнитьОбъектИзСтруктуры(ТекСтрокаДанных.ЗагружаемыеДанные, Истина, Истина);
			ДанныеДляЖурнала = ДанныеОбъект.Ссылка;
		КонецЕсли;
		
		Если ДанныеОбъект = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ДанныеОбъект.ОбменДанными.Загрузка = НЕ ВыполнятьОбработчикиПриЗаписи;
		
		Попытка
			ДанныеОбъект.Записать();
		Исключение
			ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ТекстОшибки = СтрШаблон("Не удалось %1 объект ""%2"":%3%4",
			                        Действие,
			                        Представление,
			                        Символы.ПС,
			                        ТекстОшибки);
			ЗаписьЖурналаРегистрации("Преобразование данных.Восстановление объекта",
			                         УровеньЖурналаРегистрации.Ошибка,
			                         Метаданные.Обработки.бир_СохранениеВосстановлениеДанных,
			                         ДанныеДляЖурнала,
			                         ТекстОшибки);
			Если ВосстанавливатьВТранзакции Тогда
				ВызватьИсключение ТекстОшибки;
			Иначе
				ОбщегоНазначения.СообщитьПользователю(ТекстОшибки);
			КонецЕсли
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры // ВыполнитьВосстановлениеДанных() 

// Процедура - в строке таблицы соответствия объектов для восстановления
// сравнивает загружаемые данные и в данные в информационной базе
// и устанавливает статус изменений либо "Нет", либо "Изменен" (см. СтатусыИзменений())
//
// Параметры:
//   Данные    - Структура    - строке таблицы соответствия объектов для восстановления
//                              (см. НоваяСтрокаДанныхДляВосстановления())
//
Процедура ПроверитьИзмененияУстановитьСтатус(Данные)
	
	Если НЕ Данные.Статус = СтатусыИзменений().Нет Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеДляСравнения = ПодготовитьДанныеДляСравнения(Данные);
	
	Хеш1 = Новый ХешированиеДанных(ХешФункция.MD5);
	Хеш1.Добавить(ДанныеДляСравнения.ДанныеВБазе);
	Хеш2 = Новый ХешированиеДанных(ХешФункция.MD5);
	Хеш2.Добавить(ДанныеДляСравнения.ЗагружаемыеДанные);
	
	Если НЕ Хеш1.ХешСумма = Хеш2.ХешСумма Тогда
		Данные.Статус = СтатусыИзменений().Изменен;
	КонецЕсли;
	
КонецПроцедуры // ПроверитьИзмененияУстановитьСтатус()

// Функция - формирует соответствие менеджеров объектов для типов переданных ссылок
// 
// Параметры:
//   Ссылки    - Массив Из ЛюбаяСсылка    - ссылки для определения менеджеров объектов
//
// Возвращаемое значение:
//   Соответствие    - соответствие типов ссылок и менеджеров объектов
//     *Ключ        - Строка            - строковое имя типа ссылки
//     *Значение    - ОбъектМенеджер    - менеджер объекта ссылки
//                                        (например: СправочникМенеджер.Номенклатура)
//
Функция МенеджерыОбъектов(Ссылки)
	
	МенеджерыОбъектов = Новый Соответствие();
	
	Для Каждого ТекСсылка Из Ссылки Цикл
		
		ТипСсылки = ТипЗнч(ТекСсылка);
		
		Если ТипСсылки = Тип("Структура")
		 ИЛИ НЕ МенеджерыОбъектов.Получить(ТипСсылки) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ОписаниеВидаСсылки = ПреобразованиеДанных().ОписаниеВидаОбъектов(ТипСсылки);
		
		Менеджер = ОписаниеВидаСсылки.Коллекция[ОписаниеВидаСсылки.ИмяТипа];
		
		МенеджерыОбъектов.Вставить(ТипСсылки, Менеджер);
		
	КонецЦикла;
	
	Возврат МенеджерыОбъектов;
	
КонецФункции // МенеджерыОбъектов()

// Процедура - добавляет в массив уникальные данные из входящего массива
// если в массиве уникальных данных уже присутствуют данные из входящего массива,
// то такие данные добавлены не будут
// 
// Параметры:
//   УникальныеДанные     - Массив Из ЛюбаяСсылка,   - массив уникальных ссылок и отборов регистров сведений
//                          Структура
//   ДобавляемыеДанные    - Массив                   - добавляемые ссылки и отборы регистров сведений
//
Процедура ДобавитьУникальныеДанные(УникальныеДанные, ДобавляемыеДанные)
	
	Если НЕ ТипЗнч(УникальныеДанные) = Тип("Массив") Тогда
		УникальныеДанные = Новый Массив();
	КонецЕСли;
	
	КонтрольныеДанные = Новый Соответствие();
	Для Каждого ТекЭлемент Из УникальныеДанные Цикл
		Если ТипЗнч(ТекЭлемент) = Тип("Структура")
		   И ТекЭлемент.Свойство("Отбор") Тогда
			КлючДанных = СтруктураСтрокой(ТекЭлемент.Отбор);
		Иначе
			КлючДанных = ТекЭлемент;
		КонецЕсли;
		КонтрольныеДанные.Вставить(КлючДанных, Истина);
	КонецЦикла;
	
	Если НЕ ТипЗнч(ДобавляемыеДанные) = Тип("Массив") Тогда
		Возврат;
	КонецЕСли;
	
	Для Каждого ТекЭлемент Из ДобавляемыеДанные Цикл
		Если ТипЗнч(ТекЭлемент) = Тип("Структура")
		   И ТекЭлемент.Свойство("Отбор") Тогда
			Ключ = СтруктураСтрокой(ТекЭлемент.Отбор);
			Значение = ТекЭлемент;
		ИначеЕсли ПреобразованиеДанных().ЭтоСсылка(ТекЭлемент) Тогда
			Ключ = ТекЭлемент;
			Значение = ТекЭлемент;
		Иначе
			Продолжить;
		КонецЕсли;
		Если КонтрольныеДанные.Получить(Ключ) = Неопределено Тогда 
			УникальныеДанные.Добавить(Значение);
			КонтрольныеДанные.Вставить(Ключ, Истина);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры // ДобавитьУникальныеДанные()

// Функция - формирует строковое представление переданной структуры
// 
// Параметры:
//   ИсходнаяСтруктура    - Структура    - структура для получения строкового представления
//
// Возвращаемое значение:
//   Строка    - строковое представление переданной структуры
//
Функция СтруктураСтрокой(ИсходнаяСтруктура)
	
	ТабСортировкиКлючей = Новый ТаблицаЗначений();
	ТабСортировкиКлючей.Колонки.Добавить("Ключ", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(250)));
	
	Для Каждого ТекЭлемент Из ИсходнаяСтруктура Цикл
		НоваяСтрока = ТабСортировкиКлючей.Добавить();
		НоваяСтрока.Ключ = ТекЭлемент.Ключ;
	КонецЦикла;
	
	ТабСортировкиКлючей.Сортировать("Ключ ВОЗР");
	
	МассивПолей = Новый Массив();
	
	Для Каждого ТекСтрока Из ТабСортировкиКлючей Цикл
		Значение = ИсходнаяСтруктура[ТекСтрока.Ключ];
		Если ПреобразованиеДанных().ЭтоСсылка(Значение) Тогда
			Значение = СокрЛП(Значение.УникальныйИдентификатор())
		Иначе
			Значение = СокрЛП(Значение);
		КонецЕсли;
		
		МассивПолей.Добавить(СтрШаблон("%1:%2", ТекСтрока.Ключ, Значение));
	КонецЦикла;
	
	Возврат СтрСоединить(МассивПолей, ",");
	
КонецФункции // СтруктураСтрокой()

// Функция - структуру новой строки таблицы загружаемых данных
// 
// Возвращаемое значение:
//   Структура                                          - возможные статусы изменения загружаемых объектов
//     *ЗагружаемыеДанные                 - Структура     - загружаемые данные
//     *ЗагружаемыеДанныеПредставление    - Строка        - текстовое представление загружаемых данных
//     *ДанныеВБазе                       - ЛюбаяСсылка,  - ссылка на объект в базе или структура отбора
//                                          Структура       набора записей независимого регистра сведений
//     *ДанныеВБазеПредставление          - Строка        - текстовое представление данных в базе
//     *ТипДанных                         - Строка        - описание типа загружаемых данных
//                                                          (например: СправочникОбъект.Номенклатура)
//     *Статус                            - Строка        - статус изменения загружаемых данных
//                                                          (см. СтатусыИзменений())
//
Функция НоваяСтрокаДанныхДляВосстановления()
	
	СтрокаДанных = Новый Структура();
	СтрокаДанных.Вставить("ЗагружаемыеДанные");
	СтрокаДанных.Вставить("ДанныеВБазе");
	СтрокаДанных.Вставить("ТипДанных");
	СтрокаДанных.Вставить("ЗагружаемыеДанныеПредставление");
	СтрокаДанных.Вставить("ДанныеВБазеПредставление");
	СтрокаДанных.Вставить("Статус");
	
	Возврат СтрокаДанных;
	
КонецФункции // НоваяСтрокаДанныхДляВосстановления()

// Функция - возвращает список возможных статусов изменений загружаемых объектов
// 
// Возвращаемое значение:
//   ФиксированнаяСтруктура - возможные статусы изменения загружаемых объектов
//     *Нет        - Строка    - (НЕТ) объект не был изменен
//     *Новый      - Строка    - (НОВЫЙ) объект добавлен
//     *Изменен    - Строка    - (ИЗМЕНЕН) объект изменен
//     *Удален     - Строка    - (УДАЛЕН) объект удален
//
Функция СтатусыИзменений()
	
	СтатусыИзменений = Новый Структура();
	СтатусыИзменений.Вставить("Нет"    , "НЕТ");
	СтатусыИзменений.Вставить("Новый"  , "НОВЫЙ");
	СтатусыИзменений.Вставить("Изменен", "ИЗМЕНЕН");
	СтатусыИзменений.Вставить("Удален" , "УДАЛЕН");
	
	Возврат Новый ФиксированнаяСтруктура(СтатусыИзменений);
	
КонецФункции // СтатусыИзменений()

#КонецОбласти // СлужебныеПроцедурыИФункции
