
&Вместо("НеобходимоВыполнитьОбновление")
Функция бир_НеобходимоВыполнитьОбновление(Знач ВерсияМетаданных, Знач ВерсияДанных)

	ТребуетсяОбновлениеМодулей = Ложь;
	
	ОписанияПодсистем = СтандартныеПодсистемыПовтИсп.ОписанияПодсистем();
	
	Для Каждого ТекПодсистема Из ОписанияПодсистем.Порядок Цикл
		
		Описание = ОписанияПодсистем.ПоИменам[ТекПодсистема];
		
		ЭтоДополнительнаяПодсистема = Ложь;
		Если НЕ Описание.Свойство("ДополнительнаяПодсистема", ЭтоДополнительнаяПодсистема) Тогда
			Продолжить;
		КонецЕсли;
		Если НЕ Описание.ДополнительнаяПодсистема Тогда
			Продолжить;
		КонецЕсли;
		
		Если НЕ (ВерсияИБ(Описание.Имя) = Описание.Версия) Тогда
			ТребуетсяОбновлениеМодулей = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат НЕ ПустаяСтрока(ВерсияМетаданных) И ВерсияДанных <> ВерсияМетаданных ИЛИ ТребуетсяОбновлениеМодулей;

КонецФункции // бир_НеобходимоВыполнитьОбновление()
