
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбновитьТекущееРасположение();
	
КонецПроцедуры // ПриСозданииНаСервере()

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура УстановитьТекущимРасположением(Команда)
	
	ГлавныйСтильИзменен = бир_РасположениеИБВызовСервера.ГлавныйСтильИзменен(, Элементы.Список.ТекущаяСтрока);

	Если ГлавныйСтильИзменен Тогда
		ТекущийГлавныйСтиль = бир_РасположениеИБВызовСервера.ГлавныйСтильРасположенияИБ();
		НовыйГлавныйСтиль = бир_РасположениеИБВызовСервера.ГлавныйСтильРасположенияИБ(Элементы.Список.ТекущаяСтрока);
	КонецЕсли;

	бир_РасположениеИБВызовСервера.ОбновитьТекущееРасположениеИБ(Элементы.Список.ТекущаяСтрока);
	
	ОбновитьТекущееРасположение();
	
	Если ГлавныйСтильИзменен Тогда
		ТекстВопроса = СтрШаблон("Изменен стиль для текущего расположения ИБ (""%1"" -> ""%2"").
		                         |Изменения вступят в силу после перезапуска.
								 |
								 |Перезапустить приложение?",
		                         ТекущийГлавныйСтиль,
								 НовыйГлавныйСтиль);
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ПерезапуститьПриложение", ЭтаФорма);
		
		ПоказатьВопрос(ОписаниеОповещения,
		               ТекстВопроса,
					   РежимДиалогаВопрос.ДаНет,
					   20,
					   КодВозвратаДиалога.Нет,
					   "Перезапуск приложения",
					   КодВозвратаДиалога.Нет);
	КонецЕсли;
	
КонецПроцедуры // УстановитьТекущимРасположением()

&НаСервере
Процедура ОбновитьТекущееРасположение()
	
	ТекущееРасположение = бир_РасположениеИБВызовСервера.ТекущееРасположениеИБ();
	
КонецПроцедуры // ТекущееРасположение()

&НаКлиенте
Процедура ПерезапуститьПриложение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	ЗавершитьРаботуСистемы(Истина, Истина);

КонецПроцедуры // ПерезапуститьПриложение()

#КонецОбласти
