////////////////////////////////////////////////////////////////////////////////
// Подсистема "Обработка событий (EventHUB)". (Глобальные обработчики)
//
////////////////////////////////////////////////////////////////////////////////


#Область ПрограммныйИнтерфейс

// Процедура - глобальный обработчик ожидания, выполняет выборку зарегистрированных обработчиков событий,
// для обработки на клиенте.
// Для каждого обработчика выполняется вызов оповещения о событии.
//
Процедура ОбработкаОжиданияСобытийНаКлиенте() Экспорт
	
	ОбработчикиСобытий = бир_СобытияВызовСервера.ОбработчикиСобытийДляВыполненияНаКлиенте();
	
	Для Каждого ТекОписаниеОбработчика Из ОбработчикиСобытий Цикл
		
		НовоеОписаниеОбработчика = бир_СобытияВызовСервера.СтруктураОписанияСобытия();
		
		ЗаполнитьЗначенияСвойств(НовоеОписаниеОбработчика, ТекОписаниеОбработчика);
		
		НовоеОписаниеОбработчика.Вставить("Пользователь", ТекОписаниеОбработчика.Пользователь);
		НовоеОписаниеОбработчика.Вставить("Обработчик"  , ТекОписаниеОбработчика.Обработчик);
		НовоеОписаниеОбработчика.Вставить("Параметры"   , ТекОписаниеОбработчика.Параметры);

		Если НЕ ТипЗнч(НовоеОписаниеОбработчика.Параметры) = Тип("Структура") Тогда
			НовоеОписаниеОбработчика.Параметры = Новый Структура();
		Конецесли;
		
		НовоеОписаниеОбработчика.Параметры.Вставить("РезультатОбработки", "");
		НовоеОписаниеОбработчика.Параметры.Вставить("ОшибкаОбработки", Ложь);
		
		Оповестить("бир_Событие", НовоеОписаниеОбработчика, НовоеОписаниеОбработчика.Источник);
		
	КонецЦикла;
	
КонецПроцедуры // ОбработкаОжиданияСобытийНаКлиенте()

// Процедура - глобальный обработчик оповещения, выполняет обработку событий
//
// Параметры:
//  ИмяСобытия            - Строка                            - Служебный реквизит, всегда = "бир_Событие"
//  Параметр              - Структура                         - Описание события и обработчика события
//    *Ид                   - Строка                            - Идентификатор возникшего события (экземпляра события)
//    *ТочкаВозникновения   - СправочникСсылка                  - Точка возникновения события
//    *Дата                 - Дата                              - Дата возникновения события
//    *Момент               - Число                             - Момент возникновения события (msec)
//    *Событие              - СправочникСсылка                  - Элемент справочника "События" (обрабатываемое событие)
//    *Источник             - СправочникСсылка                  - Ид. объкета метаданных или точка возникновения,
//                                                                с которыми связано событие
//    *Пользователь         - СправочникСсылка                  - Пользователь,
//                                                                для которого необходимо выполнить обработку события
//    *Параметры            - Структура                         - Параметры возникшего события
//    *Обработчик           - СправочникСсылка                  - Элемент справочника "бир_СобытияОбработчики"
//  Источник              - СправочникСсылка                    - Ид. объекта метаданных или точка возникновения,
//                          .ИдентификаторыОбъектовМетаданных,    с которыми связано событие
//                          .бир_СобытияТочкиВозникновения
//
Процедура ОбработкаСобытийНаКлиенте(ИмяСобытия, Параметр, Источник) Экспорт
	
	Если НЕ (ИмяСобытия = "бир_Событие" И ТипЗнч(Параметр) = Тип("Структура") И Параметр.Свойство("Обработчик")) Тогда
		Возврат;
	КонецЕсли;
	
	ОписаниеСобытия = бир_СобытияВызовСервера.СтруктураОписанияСобытия();
	ЗаполнитьЗначенияСвойств(ОписаниеСобытия, Параметр);

	ПараметрыСобытия = Параметр.Параметры;
	ПараметрыСобытия.Вставить("РезультатОбработки", "");
	ПараметрыСобытия.Вставить("ОшибкаОбработки", Ложь);
	
	ОбработчикСобытия = Параметр.Обработчик;

	Пользователь = бир_СобытияВызовСервера.ТекущийПользователь();
	
	ОписаниеОбработчика = бир_СобытияВызовСервера.ОписаниеОбработчикаСобытий(ОбработчикСобытия);
	
	ИмяОбработки = "ОбработкаСобытия_" + СтрЗаменить(ОписаниеОбработчика.Ид, "-", "_");
	
	АдресОбработки = ?(ОписаниеОбработчика.ОбработкаВнешняя,
					   ПолучитьНавигационнуюСсылку(ОбработчикСобытия, "Обработка"),
					   ОписаниеОбработчика.ОбработкаИмяВстроенной);
					   
	ПараметрыФормы = Новый Структура("ОбработкаНастройкиАдресВХранилище", ПоместитьВоВременноеХранилище(ОписаниеОбработчика.ОбработкаНастройки, Новый УникальныйИдентификатор()));
	ФормаОбработчикаСобытия = бир_СобытияКлиент.ФормаОбработчикаСобытия(АдресОбработки, ИмяОбработки, , ПараметрыФормы);
	
	Попытка
		Результат = ФормаОбработчикаСобытия.ОбработатьСобытие(ОписаниеСобытия, ОбработчикСобытия, ПараметрыСобытия);
	Исключение
		ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ТекстОшибки = СтрШаблон("При выполнении обработчика ""%1"" события ""%2"" для пользователя ""%3""
		                        |для источника ""%4"" произошла ошибка:%5%6",
		                        СокрЛП(ОбработчикСобытия),
		                        СокрЛП(ОписаниеСобытия.Событие),
		                        СокрЛП(Пользователь),
								СокрЛП(ОписаниеСобытия.Источник),
								Символы.ПС,
		                        ТекстОшибки);
		ПараметрыСобытия.Вставить("РезультатОбработки", ТекстОшибки);
		ПараметрыСобытия.Вставить("ОшибкаОбработки", Истина);
	КонецПопытки;
	
	бир_СобытияВызовСервера.ЗаписатьРезультатОбработкиСобытияНаКлиенте(ОписаниеСобытия,
	                                                                   ОбработчикСобытия,
	                                                                   Пользователь,
	                                                                   Результат,
	                                                                   ПараметрыСобытия.РезультатОбработки,
	                                                                   ПараметрыСобытия.ОшибкаОбработки);
	
КонецПроцедуры // ОбработкаСобытийНаКлиенте()

#КонецОбласти
