
////////////////////////////////////////////////////////////////////////////////
// ИНТЕРФЕЙС ОБМЕНА СОБЫТИЯМИ С ВНЕШНИМИ ИБ ЧЕРЕЗ СЕРВИС EventHUB
//
#Область ПрограммныйИнтерфейс

#Область ИнтерфейсСобытияВнешнихИБ

// Функция - Передать событие во внешнюю ИБ
//
// Параметры:
// 	НастройкиПодключения         - Структура             - Структура настроек подключения к http-сервису, в т.ч.:
//    *Сервис_Сервер               - Строка                - адрес сервера http-сервиса
//    *Сервис_АдресРесурса         - Строка                - адрес ресурса http-сервиса
//    *Сервис_Пользователь         - Строка                - имя пользователя сервиса
//    *Сервис_Пароль               - Строка                - пароль пользователя сервиса
//    *Соединение                  - HTTPСоединение        - полученный ранее объект соединения
//                                                           с http-сервисом для повторного использования
//    *Соединение_Использование    - Булево                - флаг необходимости повторного использования
//                                                         объекта соединения с http-сервисом 
//    *Таймаут                     - Число                 - время ожидания соединения
//  МассивСобытий	             - Массив из Структура   - Структура описания события
// 
// Возвращаемое значение:
//  Строка - Ответ сервиса передачи событий внешней ИБ
//
Функция ПередатьСобытиеВоВнешнююИБ(НастройкиПодключения, МассивСобытий) Экспорт
	
	Если МассивСобытий.Количество() = 0 Тогда
		Возврат Ложь;
	КонецЕсли;

	АдресСервиса = СтрШаблон("%1%2/RiseEvent",
	                         НастройкиПодключения.Сервис_Сервер,
	                         НастройкиПодключения.Сервис_АдресРесурса);

	ДопПараметры = бир_ВнешниеИБПолучениеДанных.ПараметрыHTTPЗапроса(НастройкиПодключения);

	ТелоЗапроса = Новый Структура();
	ТелоЗапроса.Вставить("Параметры", МассивСобытий);
	ТелоЗапроса = ПреобразованиеДанных().ЗаписатьОписаниеОбъектаВJSON(ТелоЗапроса);

	Попытка
		ОтветСервиса = бир_КоннекторHTTP.Post(АдресСервиса, ТелоЗапроса, ДопПараметры);
	Исключение
		ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ТекстОшибки = СтрШаблон("Ошибка отправки события ""%1 (%2)"" в сервисе ""%3"":%4%5",
		                        МассивСобытий[0].Источник_Наименование,
		                        МассивСобытий[0].ИдСобытия,
		                        АдресСервиса,
		                        Символы.ПС,
		                        ТекстОшибки);
		ВызватьИсключение ТекстОшибки;
	КонецПопытки;

	Если НЕ ОтветСервиса.КодСостояния = бир_ВнешниеИБОбработкаЗапросов.КодыСостояния().Успешно_200 Тогда
		ТекстОшибки = ПолучитьСтрокуИзДвоичныхДанных(ОтветСервиса.Тело);
		ТекстОшибки = СтрШаблон("Ошибка отправки события выполнения запроса ""%1 (%2)"" в сервисе ""%3"", код состояния (%4):%5%6",
		                        МассивСобытий[0].Источник_Наименование,
		                        МассивСобытий[0].ИдСобытия,
		                        АдресСервиса,
		                        ОтветСервиса.КодСостояния,
		                        Символы.ПС,
		                        ТекстОшибки);
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;

	Возврат Истина;

КонецФункции // ПередатьСобытиеВоВнешнююИБ()

// Функция - Получает описания точек подключения, зарегистрированных во внешней ИБ
//
// Параметры:
// 	НастройкиПодключения          - Структура         - Структура настроек подключения к http-сервису, в т.ч.:
//     *Сервис_Сервер               - Строка            - адрес сервера http-сервиса
//     *Сервис_АдресРесурса         - Строка            - адрес ресурса http-сервиса
//     *Сервис_Пользователь         - Строка            - имя пользователя сервиса
//     *Сервис_Пароль               - Строка            - пароль пользователя сервиса
//     *Соединение                  - HTTPСоединение    - полученный ранее объект соединения
//                                                        с http-сервисом для повторного использования
//     *Соединение_Использование    - Булево            - флаг необходимости повторного использования
//                                                        объекта соединения с http-сервисом 
//     *Таймаут                     - Число             - время ожидания соединения
// 
// Возвращаемое значение:
//  Массив (Структура) - Массив описаний точек подключения
//
&НаСервере
Функция ПолучитьТочкиВозникновенияСобытий(НастройкиПодключения) Экспорт
	
	Попытка
		ДанныеОтвета = ПолучитьДанныеСобытийВнешнейИБ(НастройкиПодключения, "EventPoints");
	Исключение
		ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ТекстОшибки = СтрШаблон("Ошибка получения списка точек возникновения событий:%1%2",
		                        Символы.ПС,
		                        ТекстОшибки);
		ВызватьИсключение ТекстОшибки;
	КонецПопытки;

	Если НЕ ТипЗнч(ДанныеОтвета) = Тип("Массив") Тогда
		ТекстОшибки = "Некорректный тип ответа сервиса """ + СокрЛП(ТипЗнч(ДанныеОтвета)) + """, ожидается ""Массив""!";
		Возврат Неопределено;
	КонецЕсли;
	
	ОбязательныеПоля = Новый Структура("Ид, Наименование");
	
	ОписаниеОшибок = "";
	
	Если ДанныеОтвета.Количество() = 0 Тогда
		ТекстОшибки = "Ответ сервиса не содержит описания точек возникновения событий!";
		Возврат Неопределено;
	КонецЕсли;
	
	Если НЕ ТипЗнч(ДанныеОтвета[0]) = Тип("Структура") Тогда
		ОписаниеОшибок = ОписаниеОшибок + ?(ОписаниеОшибок = "", "", Символы.ПС) + "Описание точки имеет тип """ + СокрЛП(ТипЗнч(ДанныеОтвета[0])) + """, ожидается тип ""Структура""!";
	КонецЕсли;
	Для Каждого ТекПоле Из ОбязательныеПоля Цикл
		Если НЕ ДанныеОтвета[0].Свойство(ТекПоле.Ключ) Тогда
			ОписаниеОшибок = ОписаниеОшибок + ?(ОписаниеОшибок = "", "", Символы.ПС) + "В описании точки отсутствует поле """ + ТекПоле.Ключ + """!";
		КонецЕсли;
	КонецЦикла;
	
	Если НЕ ОписаниеОшибок = "" Тогда
		ТекстОшибки = "В процессе обработки ответа сервиса возникли ошибки: " + Символы.ПС + ОписаниеОшибок;
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат ДанныеОтвета;
	
КонецФункции // ПолучитьТочкиВозникновенияСобытий()

// Функция - Получает идентификатор для текущей точки возникновения события от сервиса
//
// Параметры:
// 	НастройкиПодключения          - Структура         - Структура настроек подключения к http-сервису, в т.ч.:
//     *Сервис_Сервер               - Строка            - адрес сервера http-сервиса
//     *Сервис_АдресРесурса         - Строка            - адрес ресурса http-сервиса
//     *Сервис_Пользователь         - Строка            - имя пользователя сервиса
//     *Сервис_Пароль               - Строка            - пароль пользователя сервиса
//     *Соединение                  - HTTPСоединение    - полученный ранее объект соединения
//                                                        с http-сервисом для повторного использования
//     *Соединение_Использование    - Булево            - флаг необходимости повторного использования
//                                                        объекта соединения с http-сервисом 
//     *Таймаут                     - Число             - время ожидания соединения
// 
// Возвращаемое значение:
//   Строка - Идентификатор точки возникновения событий
//
&НаСервере
Функция ПолучитьИдентификаторВнешнейИБ(НастройкиПодключения) Экспорт
	
	Попытка
		ДанныеОтвета = ПолучитьДанныеСобытийВнешнейИБ(НастройкиПодключения, "ThisEventPoint");
	Исключение
		ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ТекстОшибки = СтрШаблон("Ошибка получения описания внешней точки возникновения событий:%1%2",
		                        Символы.ПС,
		                        ТекстОшибки);
		ВызватьИсключение ТекстОшибки;
	КонецПопытки;

	Если НЕ ТипЗнч(ДанныеОтвета) = Тип("Массив") Тогда
		ТекстОшибки = "Некорректный тип ответа сервиса """ + СокрЛП(ТипЗнч(ДанныеОтвета)) + """, ожидается ""Массив""!";
		Возврат Неопределено;
	КонецЕсли;
	
	ОбязательныеПоля = Новый Структура("Ид, Наименование");
	
	ОписаниеОшибок = "";
	
	Если НЕ ТипЗнч(ДанныеОтвета) = Тип("Структура") Тогда
		ОписаниеОшибок = ОписаниеОшибок + ?(ОписаниеОшибок = "", "", Символы.ПС) + "Описание точки имеет тип """ + СокрЛП(ТипЗнч(ДанныеОтвета)) + """, ожидается тип ""Структура""!";
	КонецЕсли;
	Для Каждого ТекПоле Из ОбязательныеПоля Цикл
		Если НЕ ДанныеОтвета[0].Свойство(ТекПоле.Ключ) Тогда
			ОписаниеОшибок = ОписаниеОшибок + ?(ОписаниеОшибок = "", "", Символы.ПС) + "В описании точки отсутствует поле """ + ТекПоле.Ключ + """!";
		КонецЕсли;
	КонецЦикла;
	
	Если НЕ ОписаниеОшибок = "" Тогда
		ТекстОшибки = "В процессе обработки ответа сервиса возникли ошибки: " + Символы.ПС + ОписаниеОшибок;
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат ДанныеОтвета.Ид;
	
КонецФункции // ПолучитьИдентификаторВнешнейИБ()

// Функция - Получает список событий из внешней ИБ
//
// Параметры:
// 	НастройкиПодключения          - Структура         - Структура настроек подключения к http-сервису, в т.ч.:
//     *Сервис_Сервер               - Строка            - адрес сервера http-сервиса
//     *Сервис_АдресРесурса         - Строка            - адрес ресурса http-сервиса
//     *Сервис_Пользователь         - Строка            - имя пользователя сервиса
//     *Сервис_Пароль               - Строка            - пароль пользователя сервиса
//     *Соединение                  - HTTPСоединение    - полученный ранее объект соединения
//                                                        с http-сервисом для повторного использования
//     *Соединение_Использование    - Булево            - флаг необходимости повторного использования
//                                                        объекта соединения с http-сервисом 
//     *Таймаут                     - Число             - время ожидания соединения
// 
// Возвращаемое значение:
//  Массив (Структура) - Массив описаний событий
//
Функция ПолучитьСписокСобытийВнешнейИБ(НастройкиПодключения) Экспорт
	
	Попытка
		ДанныеОтвета = ПолучитьДанныеСобытийВнешнейИБ(НастройкиПодключения, "PossibleEvents");
	Исключение
		ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ТекстОшибки = СтрШаблон("Ошибка получения списка внешних событий:%1%2",
		                        Символы.ПС,
		                        ТекстОшибки);
		ВызватьИсключение ТекстОшибки;
	КонецПопытки;

	Возврат ДанныеОтвета;

КонецФункции // ПолучитьСписокСобытийВнешнейИБ()

// Функция - Получает список событий из внешней ИБ
//
// Параметры:
// 	НастройкиПодключения          - Структура         - Структура настроек подключения к http-сервису, в т.ч.:
//     *Сервис_Сервер               - Строка            - адрес сервера http-сервиса
//     *Сервис_АдресРесурса         - Строка            - адрес ресурса http-сервиса
//     *Сервис_Пользователь         - Строка            - имя пользователя сервиса
//     *Сервис_Пароль               - Строка            - пароль пользователя сервиса
//     *Соединение                  - HTTPСоединение    - полученный ранее объект соединения
//                                                        с http-сервисом для повторного использования
//     *Соединение_Использование    - Булево            - флаг необходимости повторного использования
//                                                        объекта соединения с http-сервисом 
//     *Таймаут                     - Число             - время ожидания соединения
// 
// Возвращаемое значение:
//  Массив (Структура) - Массив описаний событий
//
Функция ПолучитьДанныеСобытийВнешнейИБ(НастройкиПодключения, ШаблонURL) Экспорт
	
	АдресСервиса = СтрШаблон("%1%2/%3",
	                         НастройкиПодключения.Сервис_Сервер,
	                         НастройкиПодключения.Сервис_АдресРесурса,
	                         ШаблонURL);

	ДопПараметры = бир_ВнешниеИБПолучениеДанных.ПараметрыHTTPЗапроса(НастройкиПодключения);
	
	Попытка
		ОтветСервиса = бир_КоннекторHTTP.Get(АдресСервиса, , ДопПараметры);
	Исключение
		ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ТекстОшибки = СтрШаблон("Ошибка получения данных от сервиса ""%1"":%2%3",
		                        АдресСервиса,
		                        Символы.ПС,
		                        ТекстОшибки);
		ВызватьИсключение ТекстОшибки;
	КонецПопытки;

	Если НЕ ОтветСервиса.КодСостояния = бир_ВнешниеИБОбработкаЗапросов.КодыСостояния().Успешно_200 Тогда
		ТекстОшибки = ПолучитьСтрокуИзДвоичныхДанных(ОтветСервиса.Тело);
		ТекстОшибки = СтрШаблон("Ошибка получения данных от сервиса ""%1"", код состояния (%2):%3%4",
		                        АдресСервиса,
		                        ОтветСервиса.КодСостояния,
		                        Символы.ПС,
		                        ТекстОшибки);
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;

	Попытка
		ДанныеОтвета = бир_КоннекторHTTP.КакJson(ОтветСервиса, ДопПараметры.ПараметрыПреобразованияJSON);
	Исключение
		ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ТекстОшибки = СтрШаблон("Ошибка преобразования данных, полученных от сервиса ""%1"":%2%3",
		                        АдресСервиса,
		                        Символы.ПС,
		                        ТекстОшибки);
		ВызватьИсключение ТекстОшибки;
	КонецПопытки;

	Возврат ДанныеОтвета;

КонецФункции // ПолучитьДанныеСобытийВнешнейИБ()

#КонецОбласти // ИнтерфейсСобытияВнешнихИБ

#КонецОбласти // ПрограммныйИнтерфейс

#Область СлужебныеПроцедурыИФункции

// Функция - Получает обработку сериализации значений
// 
// Возвращаемое значение:
//   ОбработкаОбъект    - обработка преобразования данных
//
Функция ПреобразованиеДанных()

	Возврат Обработки.бир_ПреобразованиеДанных.Создать(); 

КонецФункции // ПреобразованиеДанных()

#КонецОбласти // СлужебныеПроцедурыИФункции
