
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.ПолучитьИдентификатор.Видимость = НЕ Объект.Предопределенный;
	
	Если Объект.Ссылка.Пустая() Тогда
		Объект.Ид = СокрЛП(Новый УникальныйИдентификатор);
	КонецЕсли; 
	
КонецПроцедуры // ПриСозданииНаСервере()
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если НЕ ЗначениеЗаполнено(Объект.Ид) Тогда
		Объект.Ид = СокрЛП(Новый УникальныйИдентификатор());
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийФормы

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОбновитьИдентификатор(Команда)
	
	Объект.Ид = СокрЛП(Новый УникальныйИдентификатор);
	
КонецПроцедуры // ОбновитьИдентификатор()

&НаКлиенте
Процедура ПолучитьИдентификатор(Команда)
	
	ПолучитьИдентификаторСервер();
	
КонецПроцедуры // ПолучитьИдентификатор()

&НаСервере
Процедура ПолучитьИдентификаторСервер()
	
	ТекстОшибки = "";
	
	СтруктураНастроек = бир_ВнешниеИБПолучениеДанных.НастройкиПодключения(Объект.СервисСобытий_Адрес);
	
	Объект.Ид = бир_ВнешниеСобытияОтправкаЗапросов.ПолучитьИдентификаторВнешнейИБ(СтруктураНастроек, ТекстОшибки);
	
КонецПроцедуры // ПолучитьИдентификаторСервер()

#КонецОбласти // ОбработчикиКомандФормы
