
#Область ОбработчикиСобытийФормы

// Процедура - обработчик события "ПриСозданииНаСервере" формы
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Регистры = НезависимыеРегистрыСведений();
	
	Если Параметры.Свойство("ИмяРегистра") Тогда
		ИмяРегистра = Параметры.ИмяРегистра;
	КонецЕсли;
	
	Если ПустаяСтрока(ИмяРегистра) ИЛИ Регистры.Найти(ИмяРегистра) = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Отбор = Новый Структура();
	Если Параметры.Свойство("Отбор") И ТипЗнч(Параметры.Отбор) = Тип("Структура") Тогда
		Отбор = Параметры.Отбор;
	КонецЕсли;
	
	ОбновитьФорму();
	
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийФормы

#Область СлужебныеПроцедурыИФункции

// Функция, получает список всех независимых регистров сведений в конфигурации (не подчиненных регистратору)
//
&НаСервереБезКонтекста
Функция НезависимыеРегистрыСведений()
	
	Регистры = Новый ТаблицаЗначений();
	Регистры.Колонки.Добавить("Имя");
	
	Для Каждого ТекРегистр Из Метаданные.РегистрыСведений Цикл
		Если НЕ ТекРегистр.РежимЗаписи = Метаданные.СвойстваОбъектов.РежимЗаписиРегистра.Независимый Тогда
			Продолжить;
		КонецЕсли;
		Регистры.Добавить().Имя = ТекРегистр.Имя;
	КонецЦикла;
	
	Регистры.Сортировать("Имя");
	
	Возврат Регистры.ВыгрузитьКолонку("Имя");
	
КонецФункции // НезависимыеРегистрыСведений()

// Процедура, обновляет состав реквизитов и элементов формы
// в зависимости от выбранного регистра сведений и установленного отбора
//
&НаСервере
Процедура ОбновитьФорму()
	
	Если ПустаяСтрока(ИмяРегистра) Тогда
		МетаРегистр = Неопределено;
		Заголовок = "<регистр не выбран>";
	Иначе
		МетаРегистр = Метаданные.РегистрыСведений[ИмяРегистра];
		Заголовок = СтрШаблон("Набор записей: %1", МетаРегистр.Представление());
	КонецЕсли;
	
	УдаляемыеРеквизиты = Новый Массив();
	
	Реквизиты = ПолучитьРеквизиты();
	Для Каждого ТекРеквизит Из Реквизиты Цикл
		Если ТекРеквизит.Имя = "Объект" Тогда
			Элементы.Удалить(Элементы.Найти("НаборЗаписей"));
			УдаляемыеРеквизиты.Добавить(ТекРеквизит.Имя);
		ИначеЕсли Лев(ТекРеквизит.Имя, 6) = "Отбор_" Тогда
			Элементы.Удалить(Элементы.Найти(ТекРеквизит.Имя));
			УдаляемыеРеквизиты.Добавить(ТекРеквизит.Имя);
		КонецЕсли;
	КонецЦикла;
	
	ДобавляемыеРеквизиты = Новый Массив();
	
	ТипРегистра = Новый ОписаниеТипов(СтрШаблон("РегистрСведенийНаборЗаписей.%1", ИмяРегистра));
	НаборЗаписей = Новый РеквизитФормы("Объект", ТипРегистра, "", МетаРегистр.Представление());
	ДобавляемыеРеквизиты.Добавить(НаборЗаписей);
	
	Для Каждого ТекЭлемент Из Отбор Цикл
		ИмяРеквизита = СтрШаблон("Отбор_%1", ТекЭлемент.Ключ);
		
		ТипРеквизита = Новый Массив();
		ТипРеквизита.Добавить(ТипЗнч(ТекЭлемент.Значение));
		ТипРеквизита = Новый ОписаниеТипов(ТипРеквизита);
		
		ЗаголовокРеквизита = СтрШаблон("Отбор: %1", ТекЭлемент.Ключ);
		РеквизитОтбора = Новый РеквизитФормы(ИмяРеквизита, ТипРеквизита, "", ЗаголовокРеквизита);
		ДобавляемыеРеквизиты.Добавить(РеквизитОтбора);
	КонецЦикла;
	
	ИзменитьРеквизиты(ДобавляемыеРеквизиты, УдаляемыеРеквизиты);
	
	НаборЗаписейЭлемент = Элементы.Добавить("НаборЗаписей", Тип("ТаблицаФормы"), ЭтотОбъект);
	НаборЗаписейЭлемент.ПутьКДанным = "Объект";
	НаборЗаписейЭлемент.ИзменятьСоставСтрок = Ложь;
	НаборЗаписейЭлемент.ИзменятьПорядокСтрок = Ложь;
	
	Для Каждого ТекСвойство Из МетаРегистр.СтандартныеРеквизиты Цикл
		Если Отбор.Свойство(ТекСвойство.Имя) Тогда
			ДобавитьПолеОтбора(ТекСвойство.Имя, ТекСвойство.Представление());
		Иначе
			ДобавитьКолонкуНабораЗаписей(ТекСвойство.Имя);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого ТекСвойство Из МетаРегистр.Измерения Цикл
		Если Отбор.Свойство(ТекСвойство.Имя) Тогда
			ДобавитьПолеОтбора(ТекСвойство.Имя, ТекСвойство.Представление());
		Иначе
			ДобавитьКолонкуНабораЗаписей(ТекСвойство.Имя);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого ТекСвойство Из МетаРегистр.Ресурсы Цикл
		Если ТекСвойство.Тип.СодержитТип(Тип("ХранилищеЗначения")) Тогда
			Продолжить;
		КонецЕсли;
		ДобавитьКолонкуНабораЗаписей(ТекСвойство.Имя);
	КонецЦикла;
	
	Для Каждого ТекСвойство Из МетаРегистр.Реквизиты Цикл
		Если ТекСвойство.Тип.СодержитТип(Тип("ХранилищеЗначения")) Тогда
			Продолжить;
		КонецЕсли;
		ДобавитьКолонкуНабораЗаписей(ТекСвойство.Имя);
	КонецЦикла;
	
КонецПроцедуры // ОбновитьФорму()

// Процедура, добавляет элемент формы для установки значения отбора по указанному полю
//
&НаСервере
Процедура ДобавитьПолеОтбора(ИмяРеквизита, Заголовок)
	
	ИмяЭлемента = СтрШаблон("Отбор_%1", ИмяРеквизита);
	ЭтотОбъект[ИмяЭлемента] = Отбор[ИмяРеквизита];
	ЭлементОтбора = Элементы.Добавить(ИмяЭлемента, Тип("ПолеФормы"), Элементы.ГруппаОтборы);
	ЭлементОтбора.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементОтбора.ПутьКДанным = ИмяЭлемента;
	ЭлементОтбора.Заголовок = Заголовок;
	ЭлементОтбора.ТолькоПросмотр = Истина;
	
КонецПроцедуры // ДобавитьПолеОтбора()

// Процедура, добавляет колонку в элемент формы "НаборЗаписей"
// для вывода данных регистра
//
&НаСервере
Процедура ДобавитьКолонкуНабораЗаписей(ИмяКолонки)
	
	НаборЗаписейЭлемент = Элементы.Найти("НаборЗаписей");
	
	Если НаборЗаписейЭлемент = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИмяЭлемента = СтрШаблон("НаборЗаписей%1", ИмяКолонки);
	КолонкаЭлемент = Элементы.Добавить(ИмяЭлемента, Тип("ПолеФормы"), НаборЗаписейЭлемент);
	КолонкаЭлемент.ПутьКДанным = СтрШаблон("Объект.%1", ИмяКолонки);
	КолонкаЭлемент.ТолькоПросмотр = Истина;
	
КонецПроцедуры // ДобавитьКолонкуНабораЗаписей()

#КонецОбласти // СлужебныеПроцедурыИФункции
