&НаСервере
Перем ПреобразованиеДанных;

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если НЕ Параметры.Свойство("АдресДанных") Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	Если НЕ Параметры.Свойство("ПутьКФайлу") Тогда
		ТекстОшибки = "Не указан путь к файлу для сохранения данных!";
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	
	Элементы.ВерсияОбработкиПреобразованияДанных.Заголовок =
		СтрШаблон("SerLib1C v. %1", ПреобразованиеДанных().Версия());

	АдресДанных          = Параметры.АдресДанных;
	ПутьКФайлу           = Параметры.ПутьКФайлу;
	ОграничениеТипа      = Параметры.ОграничениеТипа;
	РезервноеКопирование = Параметры.РезервноеКопирование;
	Если Параметры.Свойство("СсылкаНаОбъект") Тогда
		СсылкаНаОбъект       = Параметры.СсылкаНаОбъект;
	КонецЕсли;

	ОбновитьОтображениеТипаДанных();

	ЗаполнитьВыборДанных();

	Если ВыборДанных.Количество() = 0 Тогда
		ТипДанных = "";
		Если ОграничениеТипа.Типы().Количество() = 1 Тогда
			ТипДанных = ОграничениеТипа.Типы()[0];
			МетаОбъект = Метаданные.НайтиПоТипу(ТипДанных);
			ТипДанных = СтрШаблон(" типа ""%1 (%2)""", ТипДанных, МетаОбъект.ПолноеИмя());
		КонецЕсли;
		ТекстСообщения = СтрШаблон("В файле ""%1"" не найдено данных%2!", ПутьКФайлу, ТипДанных);
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , , , Отказ);
	КонецЕсли;
		
КонецПроцедуры // ПриСозданииНаСервере()

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	УстановитьПутьКРезервнойКопии();

КонецПроцедуры // ПриОткрытии()

#КонецОбласти // ОбработчикиСобытийФормы

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВыборДанныхВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;

	ТекущаяСтрока = ВыборДанных.НайтиПоИдентификатору(ВыбраннаяСтрока);

	Если Поле.Имя = "ВыборДанныхПредставлениеОбъекта" Тогда
		Если ТекущаяСтрока.СтруктураОбъекта.__Тип = "УдалениеОбъекта" Тогда
			Возврат;
		КонецЕсли;
		ОткрытьФормуНезаписанногоОбъекта(ТекущаяСтрока.СтруктураОбъекта);
	ИначеЕсли Поле.Имя = "ВыборДанныхСуществующийОбъект" Тогда
		Если ТипЗнч(ТекущаяСтрока.СуществующийОбъект) = Тип("Строка") Тогда
			Возврат;
		КонецЕсли;
		ПоказатьЗначение(, ТекущаяСтрока.СуществующийОбъект);
	КонецЕсли;
	
КонецПроцедуры // ВыборДанныхВыбор()

&НаКлиенте
Процедура ВыборДанныхПометкаПриИзменении(Элемент)

	Если НЕ ЗначениеЗаполнено(СсылкаНаОбъект) Тогда
		Возврат;
	КонецЕсли;

	Для Каждого ТекСтрока Из ВыборДанных Цикл
		ТекСтрока.Пометка = Ложь;
	КонецЦикла;

	Если НЕ Элементы.ВыборДанных.ТекущиеДанные = Неопределено Тогда
		Элементы.ВыборДанных.ТекущиеДанные.Пометка = Истина;
	КонецЕсли;

КонецПроцедуры // ВыборДанныхПометкаПриИзменении()

&НаКлиенте
Процедура ПутьКРезервнойКопииНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)

	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);

	Диалог.Фильтр = "Файл резервной копии (*.json)|*.json";
	Диалог.Заголовок = "Файл резервной копии";

	ЗавершениеВыбораФайла = Новый ОписаниеОповещения("ПутьКРезервнойКопииНачалоВыбораЗавершение", ЭтаФорма);

	Диалог.Показать(ЗавершениеВыбораФайла);

КонецПроцедуры // ПутьКРезервнойКопииНачалоВыбора()

// Процедура - продолжение обработки выбора файла резервной копии
//
&НаКлиенте
Процедура ПутьКРезервнойКопииНачалоВыбораЗавершение(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт

	Если НЕ ТипЗнч(ВыбранныеФайлы) = Тип("Массив") Тогда
		Возврат;
	КонецЕсли;

	Если ВыбранныеФайлы.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	ПутьКРезервнойКопии = ВыбранныеФайлы[0];

КонецПроцедуры // ПутьКРезервнойКопииНачалоВыбораЗавершение()

&НаКлиенте
Процедура РезервноеКопированиеПриИзменении(Элемент)
	
	УстановитьПутьКРезервнойКопии();

КонецПроцедуры // РезервноеКопированиеПриИзменении()

#КонецОбласти // ОбработчикиСобытийЭлементовШапкиФормы

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Загрузить(Команда)

	Если РезервноеКопирование Тогда
		РезервноеКопирование();
	КонецЕсли;

	Данные = Новый Массив();
	Для Каждого ТекЭлемент Из ВыборДанных Цикл
		Если НЕ ТекЭлемент.Пометка Тогда
			Продолжить;
		КонецЕсли;
		Данные.Добавить(ТекЭлемент.СтруктураОбъекта);
	КонецЦикла;

	ПоместитьВоВременноеХранилище(Данные, АдресДанных);

	РезультатЗакрытия = Новый Структура();
	РезультатЗакрытия.Вставить("АдресДанных", АдресДанных);
	
	Закрыть(РезультатЗакрытия);

КонецПроцедуры // Загрузить() 

&НаКлиенте
Процедура Отмена(Команда)

	Закрыть("Отмена");

КонецПроцедуры // Отмена()

&НаКлиенте
Процедура УстановитьПометки(Команда)
	
	Для Каждого ТекСтрока Из ВыборДанных Цикл
		ТекСтрока.Пометка = Истина;
	КонецЦикла;

КонецПроцедуры // УстановитьПометки()

&НаКлиенте
Процедура СнятьПометки(Команда)

	Для Каждого ТекСтрока Из ВыборДанных Цикл
		ТекСтрока.Пометка = Ложь;
	КонецЦикла;

КонецПроцедуры // СнятьПометки()

&НаКлиенте
Процедура УстановитьПутьКРезервнойКопии(Команда = Неопределено)
	
	Если НЕ РезервноеКопирование Тогда
		ПутьКРезервнойКопии = "";
		Возврат;
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(ПутьКФайлу) Тогда
		ПутьКРезервнойКопии = СтрШаблон("backup_%1.json", Формат(ТекущаяДата(), "ДФ=yyyy-MM-dd-hh-mm-ss"));
		Возврат;
	КонецЕсли;
	
	ФайлДанных = Новый Файл(ПутьКФайлу);
	
	ПутьКРезервнойКопии = СтрШаблон("%1backup_%2_%3.json",
	                                ФайлДанных.Путь,
	                                ФайлДанных.ИмяБезРасширения,
	                                Формат(ТекущаяДата(), "ДФ=yyyy-MM-dd-hh-mm-ss"));

КонецПроцедуры // УстановитьПутьКРезервнойКопии()

#КонецОбласти // ОбработчикиКомандФормы

#Область СлужебныеПроцедурыИФункции

// Процедура - заполняет таблицу "ВыборДанных"
//
&НаСервере
Процедура ЗаполнитьВыборДанных()

	Данные = ПолучитьИзВременногоХранилища(АдресДанных);
	Данные = ПреобразованиеДанных().ПрочитатьОписаниеОбъектаИзJSON(Данные);

	Для Каждого ТекСтруктураОбъекта Из Данные Цикл

		Если НЕ (ОграничениеТипа.Типы().Количество() = 0
		 ИЛИ ОграничениеТипа.СодержитТип(Тип(ТекСтруктураОбъекта.Ссылка.__Тип))) Тогда
			Продолжить;
		КонецЕсли;

		Если ТекСтруктураОбъекта.__Тип = "УдалениеОбъекта" Тогда
			Если ЗначениеЗаполнено(СсылкаНаОбъект) Тогда
				Продолжить;
			Иначе
				ОписаниеВида = ПреобразованиеДанных().ПолучитьОписаниеВидаОбъектов(ТекСтруктураОбъекта.Ссылка);
				ПредставлениеОбъекта = "Удалить";
				УдалениеОбъекта      = Истина;
			КонецЕсли;
		Иначе
			ОписаниеВида = ПреобразованиеДанных().ПолучитьОписаниеВидаОбъектов(ТекСтруктураОбъекта);
			ПредставлениеОбъекта = ТекСтруктураОбъекта.Ссылка.Представление;
			УдалениеОбъекта      = Ложь;
		КонецЕсли;
		МетаОбъект = ОписаниеВида.МетаКоллекция.Найти(ОписаниеВида.ИмяТипа);

		СуществующийОбъект   =
			ПреобразованиеДанных().НайтиЗначениеПоОписанию(ОписаниеВида, МетаОбъект, ТекСтруктураОбъекта.Ссылка);
			
		Если НЕ ЗначениеЗаполнено(СуществующийОбъект) Тогда
			СуществующийОбъект = "Новый";
		КонецЕсли;

		НоваяСтрока = ВыборДанных.Добавить();
		НоваяСтрока.Пометка              = (НЕ ЗначениеЗаполнено(СсылкаНаОбъект) ИЛИ СсылкаНаОбъект = СуществующийОбъект);
		НоваяСтрока.СтруктураОбъекта     = ТекСтруктураОбъекта;
		НоваяСтрока.ТипДанных            = ТекСтруктураОбъекта.Ссылка.__Тип;
		НоваяСтрока.СуществующийОбъект   = СуществующийОбъект;
		НоваяСтрока.ПредставлениеОбъекта = ПредставлениеОбъекта;
		НоваяСтрока.УдалениеОбъекта      = УдалениеОбъекта;

	КонецЦикла;

КонецПроцедуры // ЗаполнитьВыборДанных()

&НаКлиенте
Процедура ОткрытьФормуНезаписанногоОбъекта(СтруктураОбъекта)

	ИмяФормыОбъекта = ИмяФормыОбъекта(СтруктураОбъекта);
	ФормаОбъекта = ПолучитьФорму(ИмяФормыОбъекта, , ЭтотОбъект);

	ДанныеФормы = ФормаОбъекта.Объект;
	ЗаполнитьДанныеФормыНаСервере(ДанныеФормы, СтруктураОбъекта);
	КопироватьДанныеФормы(ДанныеФормы, ФормаОбъекта.Объект);

	ФормаОбъекта.ТолькоПросмотр = Истина;
	ФормаОбъекта.Открыть();

КонецПроцедуры // ИмяФормыОбъекта()

&НаСервере
Функция ИмяФормыОбъекта(СтруктураОбъекта)

	ОписаниеВида = ПреобразованиеДанных().ПолучитьОписаниеВидаОбъектов(СтруктураОбъекта);

	Возврат СтрШаблон("%1.%2.ФормаОбъекта", ОписаниеВида.Имя, ОписаниеВида.ИмяТипа);

КонецФункции // ИмяФормыОбъекта()

&НаСервере
Процедура ЗаполнитьДанныеФормыНаСервере(ДанныеФормы, СтруктураОбъекта)

	ДанныеОбъекта = ПреобразованиеДанных().ЗначениеИзСтруктуры(СтруктураОбъекта);
	ЗначениеВДанныеФормы(ДанныеОбъекта, ДанныеФормы);

КонецПроцедуры // ЗаполнитьДанныеФормыНаСервере()

&НаСервере
Функция ДанныеДляРезервногоКопирования()

	Данные = Новый Массив();
	Для Каждого ТекСтрока Из ВыборДанных Цикл
		Если НЕ ТекСтрока.Пометка Тогда
			Продолжить;
		КонецЕсли;

		Если ТекСтрока.СуществующийОбъект = "Новый" Тогда
			Ссылка = ПреобразованиеДанных().СсылкаИзСтруктуры(ТекСтрока.СтруктураОбъекта.Ссылка, Истина);
			Ссылка = Новый УдалениеОбъекта(Ссылка);
			Ссылка = ПреобразованиеДанных().УдалениеОбъектаВСтруктуру(Ссылка);
			Данные.Добавить(Ссылка);
		Иначе
			Данные.Добавить(ТекСтрока.СуществующийОбъект);
		КонецЕсли;
	КонецЦикла;

	Возврат ПоместитьВоВременноеХранилище(Данные, ЭтотОбъект.УникальныйИдентификатор);

КонецФункции // ДанныеДляРезервногоКопирования()

&НаКлиенте
Процедура РезервноеКопирование()

	АдресДанных = ДанныеДляРезервногоКопирования();
	Данные = ПолучитьИзВременногоХранилища(АдресДанных);

	бир_СохранениеВосстановлениеДанныхКлиент.СохранитьДанныеВФайл(Данные, ПутьКРезервнойКопии, ЭтотОбъект);

КонецПроцедуры // РезервноеКопирование()

&НаСервере
Процедура ОбновитьОтображениеТипаДанных()

	Если ОграничениеТипа.Типы().Количество() = 1 Тогда
		ТипДанных = ОграничениеТипа.Типы()[0];
		МетаОбъект = Метаданные.НайтиПоТипу(ТипДанных);
		Элементы.ТипДанных.Заголовок = СтрШаблон("%1 (%2)", ТипДанных, МетаОбъект.ПолноеИмя());
		Элементы.ТипДанных.Видимость = Истина;
		Элементы.ВыборДанныхТипДанных.Видимость = Ложь;
	Иначе
		ТипДанных = "";
		Элементы.ТипДанных.Видимость = Ложь;
		Элементы.ВыборДанныхТипДанных.Видимость = Истина;
	КонецЕсли;

КонецПроцедуры // ОбновитьОтображениеТипаДанных()

&НаСервере
Функция ПреобразованиеДанных()
	
	Если ПреобразованиеДанных = Неопределено Тогда 
		ПреобразованиеДанных = Обработки.бир_ПреобразованиеДанных.Создать();
	КонецЕсли;
	
	Возврат ПреобразованиеДанных;
	
КонецФункции // ПреобразованиеДанных()

#КонецОбласти // СлужебныеПроцедурыИФункции
