#Область ОписаниеПеременных

&НаСервере
Перем ЭтаОбработка;           // ОбработкаОбъект.бир_СохранениеВосстановлениеДанных - объект текущей обработки

&НаСервере
Перем ПреобразованиеДанных;   // ОбработкаОбъект.бир_ПреобразованиеДанных - объект обработки преобразование данных

#КонецОбласти // ОписаниеПеременных

#Область ОбработчикиСобытийФормы

// Процедура - обработчик события "ПриСозданииНаСервере" формы
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("АдресДанных"                  , АдресДанных);
	Параметры.Свойство("ПутьКФайлу"                   , ПутьКФайлу);
	Параметры.Свойство("РезервноеКопирование"         , РезервноеКопирование);
	
	Если НЕ ЗначениеЗаполнено(ПутьКФайлу) Тогда
		ТекстОшибки = "Не указан путь к файлу с данными для восстановления!";
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(АдресДанных) Тогда
		ТекстОшибки = "Отсутствует адрес для передачи загружаемых данных!";
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	
	Элементы.ВерсияОбработкиПреобразованияДанных.Заголовок =
	    СтрШаблон("SerLib1C v. %1", ПреобразованиеДанных().Версия());
	
	ЗаполнитьВыборДанных();
	
	Если ВыборДанных.Количество() = 0 Тогда
		ТекстСообщения = СтрШаблон("В файле ""%1"" не найдено данных!", ПутьКФайлу);
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , , , Отказ);
	КонецЕсли;
	
КонецПроцедуры // ПриСозданииНаСервере()

// Процедура - обработчик события "ПриОткрытии" формы
//
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьПутьКРезервнойКопии();
	
КонецПроцедуры // ПриОткрытии()

#КонецОбласти // ОбработчикиСобытийФормы

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Процедура - обработчик события "Выбор" элемента формы "ВыборДанных"
//
&НаКлиенте
Процедура ВыборДанныхВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущаяСтрока = ВыборДанных.НайтиПоИдентификатору(ВыбраннаяСтрока);
	
	Если Поле.Имя = "ВыборДанныхЗагружаемыеДанныеПредставление"
	   И НЕ ТекущаяСтрока.Статус = СтатусыИзменений().Удален Тогда
		   
		ОткрытьФормуЗагружаемыхДанных(ВыбраннаяСтрока);
		
	ИначеЕсли Поле.Имя = "ВыборДанныхДанныеВБазеПредставление"
	        И НЕ ТекущаяСтрока.Статус = СтатусыИзменений().Новый Тогда
		
		ОткрытьФормуДанныхВБазе(ВыбраннаяСтрока);
		
	ИначеЕсли Поле.Имя = "ВыборДанныхСтатус"
	        И ТекущаяСтрока.Статус = СтатусыИзменений().Изменен Тогда
		
		НачатьСравнениеДанных(ВыбраннаяСтрока);
		
	КонецЕсли;
	
КонецПроцедуры // ВыборДанныхВыбор()

// Процедура - обработчик события "НачалоВыбора" элемента формы "ПутьКРезервнойКопии"
//
&НаКлиенте
Процедура ПутьКРезервнойКопииНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	
	Диалог.Фильтр = "Файл резервной копии (*.json)|*.json";
	Диалог.Заголовок = "Файл резервной копии";
	
	ЗавершениеВыбораФайла = Новый ОписаниеОповещения("ПутьКРезервнойКопииНачалоВыбораЗавершение", ЭтаФорма);
	
	Диалог.Показать(ЗавершениеВыбораФайла);
	
КонецПроцедуры // ПутьКРезервнойКопииНачалоВыбора()

// Процедура - продолжение обработки выбора файла резервной копии
//
&НаКлиенте
Процедура ПутьКРезервнойКопииНачалоВыбораЗавершение(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	Если НЕ ТипЗнч(ВыбранныеФайлы) = Тип("Массив") Тогда
		Возврат;
	КонецЕсли;
	
	Если ВыбранныеФайлы.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ПутьКРезервнойКопии = ВыбранныеФайлы[0];
	
КонецПроцедуры // ПутьКРезервнойКопииНачалоВыбораЗавершение()

// Процедура - обработчик события "ПриИзменении" элемента формы "РезервноеКопирование"
//
&НаКлиенте
Процедура РезервноеКопированиеПриИзменении(Элемент)
	
	УстановитьПутьКРезервнойКопии();
	
КонецПроцедуры // РезервноеКопированиеПриИзменении()

#КонецОбласти // ОбработчикиСобытийЭлементовШапкиФормы

#Область ОбработчикиКомандФормы

// Процедура - обработчик команды "Загрузить"
//
&НаКлиенте
Процедура Загрузить(Команда)
	
	Если РезервноеКопирование Тогда
		РезервноеКопирование();
	Иначе
		СформироватьДанныеДляЗагрузкиИЗакрыть();
	КонецЕсли;
	
КонецПроцедуры // Загрузить() 

// Процедура - формирует массив данных для загрузки, помещает во временное хранилище
// и передает в основную форму обработки
//
&НаКлиенте
Процедура СформироватьДанныеДляЗагрузкиИЗакрыть()
	
	Данные = Новый Массив();
	Для Каждого ТекЭлемент Из ВыборДанных Цикл
		Если НЕ ТекЭлемент.Пометка Тогда
			Продолжить;
		КонецЕсли;
		ДанныеСтрока = ЗагружаемыеДанныеСтрока();
		ЗаполнитьЗначенияСвойств(ДанныеСтрока, ТекЭлемент);
		Данные.Добавить(ДанныеСтрока);
	КонецЦикла;
	
	ПоместитьВоВременноеХранилище(Данные, АдресДанных);
	
	РезультатЗакрытия = Новый Структура();
	РезультатЗакрытия.Вставить("АдресДанных", АдресДанных);
	
	Закрыть(РезультатЗакрытия);
	
КонецПроцедуры // СформироватьДанныеДляЗагрузкиИЗакрыть() 

// Процедура - обработчик команды "Отмена", закрывает форму без выполнения загрузки данных
//
&НаКлиенте
Процедура Отмена(Команда)
	
	Закрыть("Отмена");
	
КонецПроцедуры // Отмена()

// Процедура - обработчик команды "УстановитьПометки", устанавливает все флаги загрузки данных
//
&НаКлиенте
Процедура УстановитьПометки(Команда)
	
	Для Каждого ТекСтрока Из ВыборДанных Цикл
		Если ТекСтрока.Статус = СтатусыИзменений().Нет Тогда
			Продолжить;
		КонецЕсли;
		ТекСтрока.Пометка = Истина;
	КонецЦикла;
	
КонецПроцедуры // УстановитьПометки()

// Процедура - обработчик команды "СнятьПометки", снимает все флаги загрузки данных
//
&НаКлиенте
Процедура СнятьПометки(Команда)
	
	Для Каждого ТекСтрока Из ВыборДанных Цикл
		ТекСтрока.Пометка = Ложь;
	КонецЦикла;
	
КонецПроцедуры // СнятьПометки()

// Процедура - обработчик команды "УстановитьПутьКРезервнойКопии", генерирует путь к файлу резервной копии
//
&НаКлиенте
Процедура УстановитьПутьКРезервнойКопии(Команда = Неопределено)
	
	Если НЕ РезервноеКопирование Тогда
		ПутьКРезервнойКопии = "";
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ПутьКФайлу) Тогда
		ПутьКРезервнойКопии = СтрШаблон("backup_%1.json", Формат(ТекущаяДата(), "ДФ=yyyy-MM-dd-hh-mm-ss"));
		Возврат;
	КонецЕсли;
	
	ФайлДанных = Новый Файл(ПутьКФайлу);
	
	ПутьКРезервнойКопии = СтрШаблон("%1backup_%2_%3.json",
	                                ФайлДанных.Путь,
	                                ФайлДанных.ИмяБезРасширения,
	                                Формат(ТекущаяДата(), "ДФ=yyyy-MM-dd-hh-mm-ss"));
	
КонецПроцедуры // УстановитьПутьКРезервнойКопии()

// Процедура - обработчик команды "ИзменитьПутьКИнструментуСравнения",
// открывает форму редактирования команды открытия внешнего инструмента сравнения данных
//
&НаКлиенте
Процедура ИзменитьПутьКИнструментуСравнения(Команда)
	ОткрытьФорму("Обработка.бир_СохранениеВосстановлениеДанных.Форма.ФормаВыбораИнструментаСравнения",
	             ,
	             ЭтотОбъект);
КонецПроцедуры // ИзменитьПутьКИнструментуСравнения()

#КонецОбласти // ОбработчикиКомандФормы

#Область СлужебныеПроцедурыИФункции

#Область ЗаполнениеДанных

// Процедура - заполняет таблицу "ВыборДанных"
//
&НаСервере
Процедура ЗаполнитьВыборДанных()
	
	ЭтаОбработка().УстановитьДанныеДляВосстановления(АдресДанных);
	Данные = ЭтаОбработка().ДанныеДляВосстановления();
	
	Для Каждого ТекЭлемент Из Данные Цикл
		
		НоваяСтрока = ВыборДанных.Добавить();
		НоваяСтрока.ЗагружаемыеДанные              = ТекЭлемент.ЗагружаемыеДанные;
		НоваяСтрока.ЗагружаемыеДанныеПредставление = ТекЭлемент.ЗагружаемыеДанныеПредставление;
		НоваяСтрока.ДанныеВБазе                    = ТекЭлемент.ДанныеВБазе;
		НоваяСтрока.ДанныеВБазеПредставление       = ТекЭлемент.ДанныеВБазеПредставление;
		НоваяСтрока.ТипДанных                      = ТекЭлемент.ТипДанных;
		НоваяСтрока.Статус                         = ТекЭлемент.Статус;
		НоваяСтрока.Пометка                        = (НЕ НоваяСтрока.Статус = СтатусыИзменений().Нет);
		
	КонецЦикла;
	
КонецПроцедуры // ЗаполнитьВыборДанных()

// Функция - структуру новой строки таблицы загружаемых данных
// 
// Возвращаемое значение:
//   Структура                                         - возможные статусы изменения загружаемых объектов
//     *ЗагружаемыеДанные                 - Структура    - загружаемые данные
//     *ЗагружаемыеДанныеПредставление    - Строка       - текстовое представление загружаемых данных
//     *ДанныеВБазе                       - ЛюбаяСсылка  - ссылка на объект в базе или структура отбора
//                                          Структура      набора записей независимого регистра сведений
//     *ДанныеВБазеПредставление          - Строка       - текстовое представление данных в базе
//     *ТипДанных                         - Строка       - описание типа загружаемых данных
//                                                         (например: СправочникОбъект.Номенклатура)
//     *Статус                            - Строка       - статус изменения загружаемых данных
//                                                         (см. СтатусыИзменений())
//
&НаКлиенте
Функция ЗагружаемыеДанныеСтрока()
	
	СтрокаДанных = Новый Структура();
	СтрокаДанных.Вставить("ЗагружаемыеДанные");
	СтрокаДанных.Вставить("ЗагружаемыеДанныеПредставление");
	СтрокаДанных.Вставить("ДанныеВБазе");
	СтрокаДанных.Вставить("ДанныеВБазеПредставление");
	СтрокаДанных.Вставить("ТипДанных");
	СтрокаДанных.Вставить("Статус");
	
	Возврат СтрокаДанных;
	
КонецФункции // ЗагружаемыеДанныеСтрока()

#КонецОбласти // ЗаполнениеДанных

#Область ПросмотрДанных

// Процедура - открывает форму для просмотра загружаемых данных
// 
// Параметры:
//   СтрокаДанных    - Число    - идентификатор строки таблицы "ВыборДанных" для просмотра загружаемых данных
//
&НаКлиенте
Процедура ОткрытьФормуЗагружаемыхДанных(СтрокаДанных)
	
	Данные = ВыборДанных.НайтиПоИдентификатору(СтрокаДанных);
	
	ПараметрыФормы = Новый Структура();
	
	Если Лев(Данные.ТипДанных, 28) = "РегистрСведенийНаборЗаписей." Тогда
		ИмяФормыДанных = "Обработка.бир_СохранениеВосстановлениеДанных.Форма.ФормаНабораЗаписейРегистра";
		
		ПараметрыФормы.Вставить("ИмяРегистра", Сред(Данные.ТипДанных, 29));
		ПараметрыФормы.Вставить("Отбор", ОтборЗагружаемыхДанных(Данные.ЗагружаемыеДанные.Отбор));
	Иначе
		ИмяФормыДанных = СтрШаблон("%1.ФормаОбъекта", СтрЗаменить(Данные.ТипДанных, "Объект.", "."));
	КонецЕсли;
	ФормаОбъекта = ПолучитьФорму(ИмяФормыДанных, ПараметрыФормы, ЭтотОбъект);
	
	ДанныеФормы = ФормаОбъекта.Объект;
	ЗаполнитьДанныеФормыИзЗагружаемыхДанных(ДанныеФормы, Данные.ЗагружаемыеДанные);
	КопироватьДанныеФормы(ДанныеФормы, ФормаОбъекта.Объект);
	
	ФормаОбъекта.ТолькоПросмотр = Истина;
	ФормаОбъекта.Открыть();
	
КонецПроцедуры // ОткрытьФормуЗагружаемыхДанных()

// Процедура - открывает форму для просмотра данных в базе
// 
// Параметры:
//   СтрокаДанных    - Число    - идентификатор строки таблицы "ВыборДанных" для просмотра данных в базе
//
&НаКлиенте
Процедура ОткрытьФормуДанныхВБазе(СтрокаДанных)
	
	Данные = ВыборДанных.НайтиПоИдентификатору(СтрокаДанных);
	
	Если Лев(Данные.ТипДанных, 28) = "РегистрСведенийНаборЗаписей." Тогда
		ИмяФормыДанных = "Обработка.бир_СохранениеВосстановлениеДанных.Форма.ФормаНабораЗаписейРегистра";
		
		ПараметрыФормы = Новый Структура();
		ПараметрыФормы.Вставить("ИмяРегистра", Сред(Данные.ТипДанных, 29));
		ПараметрыФормы.Вставить("Отбор", Данные.ДанныеВБазе.Отбор);
		
		ФормаОбъекта = ПолучитьФорму(ИмяФормыДанных, ПараметрыФормы, ЭтотОбъект);
		
		ДанныеФормы = ФормаОбъекта.Объект;
		ЗаполнитьДанныеФормыРегистраИзБазы(ДанныеФормы, Данные.ДанныеВБазе);
		КопироватьДанныеФормы(ДанныеФормы, ФормаОбъекта.Объект);
		
		ФормаОбъекта.ТолькоПросмотр = Истина;
		ФормаОбъекта.Открыть();
	Иначе
		ПоказатьЗначение(, Данные.ДанныеВБазе);
	КонецЕсли;
	
КонецПроцедуры // ОткрытьФормуДанныхВБазе()

// Процедура - заполняет данные формы для просмотра загружаемых данных
// из переданной структуры загружаемых данных
// 
// Параметры:
//   ДанныеФормы    - ДанныеФормыСтруктура    - данные формы для заполнения
//   Данные         - Структура               - структура загружаемых данных
//
&НаСервере
Процедура ЗаполнитьДанныеФормыИзЗагружаемыхДанных(ДанныеФормы, Данные)
	
	ДанныеОбъекта = ПреобразованиеДанных().ЗначениеИзСтруктуры(Данные);
	ЗначениеВДанныеФормы(ДанныеОбъекта, ДанныеФормы);
	
КонецПроцедуры // ЗаполнитьДанныеФормыИзЗагружаемыхДанных()

// Процедура - заполняет данные формы для просмотра текущих данных регистра сведений в базе
// из переданной структуры описания набора записей регистра
// 
// Параметры:
//   ДанныеФормы    - ДанныеФормыСтруктура    - данные формы для заполнения
//   Данные         - Структура               - описание набора записей регистра
//
&НаСервере
Процедура ЗаполнитьДанныеФормыРегистраИзБазы(ДанныеФормы, Данные)
	
	НаборЗаписей = РегистрыСведений[Сред(Данные.__Тип, 29)].СоздатьНаборзаписей();
	Для Каждого ТекЭлемент Из Данные.Отбор Цикл
		НаборЗаписей.Отбор[ТекЭлемент.Ключ].Установить(ТекЭлемент.Значение);
	КонецЦикла;
	НаборЗаписей.Прочитать();
	
	ЗначениеВДанныеФормы(НаборЗаписей, ДанныеФормы);
	
КонецПроцедуры // ЗаполнитьДанныеФормыРегистраИзБазы()

// Функция - десериализует значения полей переданного отбора
// и возвращает результирующую структуру отбора
// 
// Параметры:
//   Отбор    - Структура    - структура отбора записей регистра в сериализованом виде
//
// Возвращаемое значение:
//   Структура    - структура отбора с десериализованными значениями полей
//
&НаСервере
Функция ОтборЗагружаемыхДанных(Отбор)
	
	ОтборЗагружаемыхДанных = Новый Структура();
	
	Для Каждого ТекЭлемент Из Отбор Цикл
		ЗначениеОтбора = ПреобразованиеДанных().ЗначениеИзСтруктуры(ТекЭлемент.Значение);
		ОтборЗагружаемыхДанных.Вставить(ТекЭлемент.Ключ, ЗначениеОтбора);
	КонецЦикла;
	
	Возврат ОтборЗагружаемыхДанных;
	
КонецФункции // ОтборЗагружаемыхДанных()

#КонецОбласти // ПросмотрДанных

#Область СравнениеДанных

// Процедура - запускает сравнение данных в информационной базе с загружаемыми данными
// 
// Параметры:
//   СтрокаДанных    - Число    - идентификатор строки таблицы "ВыборДанных" для которой выполняется сравнение
//
&НаКлиенте
Процедура НачатьСравнениеДанных(СтрокаДанных)
	
	ПутьКИнструментуСравнения = ПутьКИнструментуСравнения();
	
	ДанныеДляСравнения = ПодготовитьДанныеДляСравнения(СтрокаДанных);
	
	Если ЗначениеЗаполнено(ПутьКИнструментуСравнения) Тогда
		ДанныеДляСравнения.Вставить("ПутьКИнструментуСравнения", ПутьКИнструментуСравнения);
		ПоказатьСравнениеДанных(ДанныеДляСравнения);
	Иначе
		ВыборИнструментаСравненияЗавершение = Новый ОписаниеОповещения("ВыборИнструментаСравненияЗавершение",
		                                                               ЭтотОбъект,
		                                                               ДанныеДляСравнения);
		ОткрытьФорму("Обработка.бир_СохранениеВосстановлениеДанных.Форма.ФормаВыбораИнструментаСравнения",
		             ,
		             ЭтотОбъект,
		             ,
		             ,
		             ,
		             ВыборИнструментаСравненияЗавершение);
	КонецЕсли;
	
КонецПроцедуры // НачатьСравнениеДанных()

// Процедура - обработчик завершения внешней программы сравнения файлов
// 
&НаКлиенте
Процедура ВыборИнструментаСравненияЗавершение(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если НЕ РезультатЗакрытия = КодВозвратаДиалога.ОК Тогда
		Возврат;
	КонецЕсли;
	
	ДополнительныеПараметры.Вставить("ПутьКИнструментуСравнения", ПутьКИнструментуСравнения());
	ПоказатьСравнениеДанных(ДополнительныеПараметры);
	
КонецПроцедуры // ВыборИнструментаСравненияЗавершение()

// Процедура - сохраняет данные для сравнения во временные файлы и запускает внешнее приложение сравнения файлов
// 
// Параметры:
//   ДанныеДляСравнения    - Структура    - подготовленные данные для сравнения
//     *ТипДанных            - Строка       - тип данных строкой
//                                            (например: СправочникОбъект.Номенклатура)
//     *ДанныеВБазе          - Строка       - адрес данных из базы во временном хранилище
//     *ЗагружаемыеДанные    - Строка       - адрес загружаемых данных  во временном хранилище
//
&НаКлиенте
Процедура ПоказатьСравнениеДанных(ДанныеДляСравнения)
	
	ТипДанных = СтрЗаменить(ДанныеДляСравнения.ТипДанных, "Ссылка.", "");
	ТипДанных = СтрЗаменить(ТипДанных, "НаборЗаписей.", "");
	
	ПутьКФайлам = ПолучитьИмяВременногоФайла();
	СоздатьКаталог(ПутьКФайлам);
	
	ПутьКФайлу1 = СтрШаблон("%1\%2_BASE.json", ПутьКФайлам, ТипДанных);
	ПутьКФайлу2 = СтрШаблон("%1\%2_NEW.json", ПутьКФайлам, ТипДанных);
	
	Текст = Новый ТекстовыйДокумент();
	Текст.УстановитьТекст(ПолучитьИзВременногоХранилища(ДанныеДляСравнения.ДанныеВБазе));
	Текст.Записать(ПутьКФайлу1);
	
	Текст.УстановитьТекст(ПолучитьИзВременногоХранилища(ДанныеДляСравнения.ЗагружаемыеДанные));
	Текст.Записать(ПутьКФайлу2);
	Текст = Неопределено;
	
	ПутьКИнструментуСравнения = ПутьКИнструментуСравнения();
	
	Команда = СтрШаблон("%1 ""%2"" ""%3""", ПутьКИнструментуСравнения, ПутьКФайлу1, ПутьКФайлу2);
	КодВозврата = Неопределено;
	
	ДополнительныеПараметры = Новый Структура();
	ДополнительныеПараметры.Вставить("ПутьКФайлам", ПутьКФайлам);
	СравнениеДанныхЗавершение = Новый ОписаниеОповещения("ПоказатьСравнениеДанныхЗавершение",
	                                                     ЭтотОбъект,
	                                                     ДополнительныеПараметры);
	
	НачатьЗапускПриложения(СравнениеДанныхЗавершение, Команда, ПутьКФайлам, Истина);
	
КонецПроцедуры // ПоказатьСравнениеДанных()

// Процедура - обработчик завершения внешней программы сравнения файлов
// 
&НаКлиенте
Процедура ПоказатьСравнениеДанныхЗавершение(КодВозврата, ДополнительныеПараметры) Экспорт
	
	УдалитьФайлы(ДополнительныеПараметры.ПутьКФайлам);
	
КонецПроцедуры // ПоказатьСравнениеДанныхЗавершение()

// Функция - подготавливает данные указанной строки таблицы "ВыборДанных" для сравнения
// 
// Параметры:
//   СтрокаДанных    - Число    - идентификатор строки таблицы "ВыборДанных" для которой выполняется сравнение
//
// 
// Параметры:
//   Структура                         - подготовленные данные для сравнения
//     *ТипДанных            - Строка    - тип данных строкой
//                                         (например: СправочникОбъект.Номенклатура)
//     *ДанныеВБазе          - Строка    - адрес данных из базы во временном хранилище
//     *ЗагружаемыеДанные    - Строка    - адрес загружаемых данных  во временном хранилище
//
&НаСервере
Функция ПодготовитьДанныеДляСравнения(СтрокаДанных)
	
	ДанныеДляСравнения = ВыборДанных.НайтиПоИдентификатору(СтрокаДанных);
	
	ДанныеДляСравнения = ЭтаОбработка().ПодготовитьДанныеДляСравнения(ДанныеДляСравнения);
	
	ДанныеДляСравнения.ДанныеВБазе       = ПоместитьВоВременноеХранилище(ДанныеДляСравнения.ДанныеВБазе,
	                                                                     ЭтотОбъект.УникальныйИдентификатор);
	ДанныеДляСравнения.ЗагружаемыеДанные = ПоместитьВоВременноеХранилище(ДанныеДляСравнения.ЗагружаемыеДанные,
	                                                                     ЭтотОбъект.УникальныйИдентификатор);
	Возврат ДанныеДляСравнения;
	
КонецФункции // ПодготовитьДанныеДляСравнения()

// Функция - возвращает настройку внешнего инструмента сравнения данных из хранилища настроек
// 
// Возвращаемое значение:
//   Строка    - строка запуска внешнего инструмента сравнения данных
//
&НаСервереБезКонтекста
Функция ПутьКИнструментуСравнения()
	
	Возврат ХранилищеОбщихНастроек.Загрузить("бир_СохранениеВосстановлениеДанных_ПутьКИнструментуСравнения");
	
КонецФункции // ПутьКИнструментуСравнения()

#КонецОбласти // СравнениеДанных

#Область РезервноеКопирование

// Функция - формирует набор данных для резервного копирования и помещает во временное хранилище
// 
// Возвращаемое значение:
//   Строка    - адрес временного хранилища с данными для резервного копирования
//
&НаСервере
Функция ДанныеДляРезервногоКопирования()
	
	ДанныеДляСохранения = Новый Массив();
	Для Каждого ТекСтрока Из ВыборДанных Цикл
		Если НЕ ТекСтрока.Пометка Тогда
			Продолжить;
		КонецЕсли;
		
		Если Лев(ТекСтрока.ТипДанных, 28) = "РегистрСведенийНаборЗаписей." Тогда
			ОтборДляСохранения = Новый Структура();
			Если ТекСтрока.Статус = СтатусыИзменений().Новый Тогда
				ОтборДанных = ТекСтрока.ЗагружаемыеДанные.Отбор;
			Иначе
				ОтборДанных = ТекСтрока.ДанныеВБазе.Отбор;
			КонецЕсли;
			Для Каждого ТекЭлемент Из ОтборДанных Цикл
				Если ТекСтрока.Статус = СтатусыИзменений().Новый Тогда
					ЗначениеОтбора = ПреобразованиеДанных().ЗначениеИзСтруктуры(ТекЭлемент.Значение);
				Иначе
					ЗначениеОтбора = ТекЭлемент.Значение;
				КонецЕсли;
				ОтборДляСохранения.Вставить(ТекЭлемент.Ключ, ЗначениеОтбора);
			КонецЦикла;
			ЭлементДанных = Новый Структура();
			ЭлементДанных.Вставить("__Тип", ТекСтрока.ТипДанных);
			ЭлементДанных.Вставить("Отбор", ОтборДляСохранения);
			
			ДанныеДляСохранения.Добавить(ЭлементДанных);
		ИначеЕсли ТекСтрока.Статус = СтатусыИзменений().Новый Тогда
			Ссылка = ПреобразованиеДанных().СсылкаИзСтруктуры(ТекСтрока.ЗагружаемыеДанные.Ссылка, Истина);
			Ссылка = Новый УдалениеОбъекта(Ссылка);
			
			ДанныеДляСохранения.Добавить(Ссылка);
		Иначе
			ДанныеДляСохранения.Добавить(ТекСтрока.ДанныеВБазе);
		КонецЕсли;
	КонецЦикла;
	
	ЭтаОбработка().УстановитьОтборДанныхДляСохранения(ДанныеДляСохранения);
	ЭтаОбработка().УстановитьВыгружатьСвязанныеДанные(Ложь);
	ЭтаОбработка().УстановитьВыгружатьДвижения(Истина);
	
	ДанныеДляСохранения = ЭтаОбработка().ДанныеДляСохраненияJSON();
	
	Возврат ПоместитьВоВременноеХранилище(ДанныеДляСохранения, ЭтотОбъект.УникальныйИдентификатор);
	
КонецФункции // ДанныеДляРезервногоКопирования()

// Процедура - получает набор данных для резервного копирования и сохраняет в файл в формате JSON
// 
&НаКлиенте
Процедура РезервноеКопирование()
	
	АдресДанныхРезервнойКопии = ДанныеДляРезервногоКопирования();
	Данные = ПолучитьИзВременногоХранилища(АдресДанныхРезервнойКопии);
	
	Текст = Новый ТекстовыйДокумент();
	Текст.УстановитьТекст(Данные);
	
	ДополнительныеПараметры = Новый Структура();
	ДополнительныеПараметры.Вставить("ПутьКФайлу", ПутьКФайлу);
	ОповещениеОРезервномКопировании = Новый ОписаниеОповещения("РезервноеКопированиеЗавершение",
	                                                           ЭтотОбъект,
	                                                           ДополнительныеПараметры);
	
	Текст.НачатьЗапись(ОповещениеОРезервномКопировании, ПутьКРезервнойКопии, "UTF-8");
	
КонецПроцедуры // РезервноеКопирование()

// Процедура - обработчик завершения сохранения резервной копии данных в файл
// 
&НаКлиенте
Процедура РезервноеКопированиеЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если НЕ Результат Тогда
		Возврат;
	КонецЕсли;
	
	ТекстСообщения = СтрШаблон("Создана резервная копия данных в файле ""%1""!", ДополнительныеПараметры.ПутьКФайлу);
	ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
	
	СформироватьДанныеДляЗагрузкиИЗакрыть();
	
КонецПроцедуры // РезервноеКопированиеЗавершение()

#КонецОбласти // РезервноеКопирование

#Область ПрочиеПроцедурыИФункции

// Функция - возвращает список возможных статусов изменений загружаемых объектов
// 
// Возвращаемое значение:
//   ФиксированнаяСтруктура - возможные статусы изменения загружаемых объектов
//     *Нет        - Строка    - (НЕТ) объект не был изменен
//     *Новый      - Строка    - (НОВЫЙ) объект добавлен
//     *Изменен    - Строка    - (ИЗМЕНЕН) объект изменен
//     *Удален     - Строка    - (УДАЛЕН) объект удален
//
&НаСервереБезКонтекста
Функция СтатусыИзменений()
	
	СтатусыИзменений = Новый Структура();
	СтатусыИзменений.Вставить("Нет"    , "НЕТ");
	СтатусыИзменений.Вставить("Новый"  , "НОВЫЙ");
	СтатусыИзменений.Вставить("Изменен", "ИЗМЕНЕН");
	СтатусыИзменений.Вставить("Удален" , "УДАЛЕН");
	
	Возврат Новый ФиксированнаяСтруктура(СтатусыИзменений);
	
КонецФункции // СтатусыИзменений()

// Функция - получает объект обработки преобразования данных
// 
// Возвращаемое значение:
//   ОбработкаОбъект.бир_ПреобразованиеДанных    - объект обработки преобразования данных
//
&НаСервере
Функция ПреобразованиеДанных()
	
	Если ПреобразованиеДанных = Неопределено Тогда 
		ПреобразованиеДанных = ЭтаОбработка().ПреобразованиеДанных();
	КонецЕсли;
	
	Возврат ПреобразованиеДанных;
	
КонецФункции // ПреобразованиеДанных()

// Функция - получает объект текущей обработки сохранения/восстановления данных
// 
// Возвращаемое значение:
//   ОбработкаОбъект.бир_СохранениеВосстановлениеДанных    - объект обработки сохранения/восстановления данных
//
&НаСервере
Функция ЭтаОбработка()
	
	Если ЭтаОбработка = Неопределено Тогда 
		ЭтаОбработка = РеквизитФормыВЗначение("Объект");
	КонецЕсли;
	
	Возврат ЭтаОбработка;
	
КонецФункции // ЭтаОбработка()

#КонецОбласти // ПрочиеПроцедурыИФункции

#КонецОбласти // СлужебныеПроцедурыИФункции
